[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾وَالضُّحَىٰ  ﴿١‎",
     "ابوالاعلی مودودی ": "قسم ہے روز روشن کی",
     "  احمد رضا خان ": "چاشت کی قسم",
      "احمد علی ": "دن کی روشنی کی قسم ہے",
      "  جالندہری ": "آفتاب کی روشنی کی قسم",
      "  طاہر القادری": "قَسم ہے چاشت کے وقت کی (جب آفتاب بلند ہو کر اپنا نور پھیلاتا ہے)۔ (یا:- اے حبیبِ مکرّم!) قَسم ہے چاشت (کی طرح آپ کے چہرۂ انور) کی (جس کی تابانی نے تاریک روحوں کو روشن کر دیا)۔ (یا:- قَسم ہے وقتِ چاشت (کی طرح آپ کے آفتابِ رِسالت کے بلند ہونے) کی (جس کے نور نے گمراہی کے اندھیروں کو اجالے سے بدل دیا)،",
      "   علامہ جوادی": "قسم ہے ایک پہر چڑھے دن کی",
      " محمد جوناگڑھی": "قسم ہے چاشت کے وقت کی",
      " محمد حسین نجفی ": "قَسم ہے روزِ روشن کی۔",
      "مفتی تقی عثمانی": " اے پیغمبر  قسم ہے چڑھتے دن کی روشنی کی ۔"
     },
     {
      "Aya": " ﴾وَاللَّيْلِ إِذَا سَجَىٰ ﴿٢ ‎",
     "ابوالاعلی مودودی ": "اور رات کی جبکہ وہ سکون کے ساتھ طاری ہو جائے",
     "  احمد رضا خان ": "اور رات کی جب پردہ ڈالے",
      "احمد علی ": "اور رات کی جب وہ چھا جائے",
      "  جالندہری ": "اور رات (کی تاریکی) کی جب چھا جائے",
      "  طاہر القادری": "اور قَسم ہے رات کی جب وہ چھا جائے۔ (یا:- اے حبیبِ مکرّم!) قَسم ہے سیاہ رات کی (طرح آپ کی زلفِ عنبریں کی) جب وہ (آپ کے رُخ زیبا یا شانوں پر) چھا جائے)۔ (یا:- قَسم ہے رات کی (طرح آپ کے حجابِ ذات کی) جب کہ وہ (آپ کے نورِ حقیقت کو کئی پردوں میں) چھپائے ہوئے ہے)،",
      "   علامہ جوادی": "اور قسم ہے رات کی جب وہ چیزوں کی پردہ پوشی کرے",
      " محمد جوناگڑھی": "اور قسم ہے رات کی جب چھا جائے",
      " محمد حسین نجفی ": "اور رات کی جب کہ وہ آرام و سکون کے ساتھ چھا جائے۔",
      "مفتی تقی عثمانی": "اور رات کی جب اس کا اندھیرا بیٹھ جائے ۔"
     },
     {
      "Aya": "﴾‏ مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ ﴿٣‎‏ ",
     "ابوالاعلی مودودی ": "اے نبیؐ تمہارے رب نے تم کو ہرگز نہیں چھوڑا اور نہ وہ ناراض ہوا",
     "  احمد رضا خان ": "کہ تمہیں تمہارے رب نے نہ چھوڑا، اور نہ مکروہ جانا،",
      "احمد علی ": "آپ کے رب نے نہ آپ کو چھوڑا ہے اور نہ بیزار ہوا ہے",
      "  جالندہری ": "کہ (اے محمدﷺ) تمہارے پروردگار نے نہ تو تم کو چھوڑا اور نہ (تم سے) ناراض ہوا",
      "  طاہر القادری": "آپ کے رب نے (جب سے آپ کو منتخب فرمایا ہے) آپ کو نہیں چھوڑا اور نہ ہی (جب سے آپ کو محبوب بنایا ہے) ناراض ہوا ہے،",
      "   علامہ جوادی": "تمہارے پروردگار نے نہ تم کو چھو ڑا ہے اور نہ تم سے ناراض ہوا ہے",
      " محمد جوناگڑھی": "نہ تو تیرے رب نے تجھے چھوڑا ہے اور نہ وه بیزار ہو گیا ہے",
      " محمد حسین نجفی ": "اے رسول(ص) نہ آپ کے پروردگار نے آپ کو چھوڑا ہے اور نہ وہ ناراض ہوا ہے۔",
      "مفتی تقی عثمانی": "کہ تمہارے پروردگار نے نہ تمہیں چھوڑا ہے اور نہ ناراض ہوا ہے ۔"
     },
     {
      "Aya": "  ﴾وَلَلْآخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ ﴿٤   ‎",
     "ابوالاعلی مودودی ": "اور یقیناً تمہارے لیے بعد کا دور پہلے دور سے بہتر ہے",
     "  احمد رضا خان ": "اور بیشک پچھلی تمہارے لیے پہلی سے بہتر ہے",
      "احمد علی ": "اور البتہ آخرت آپ کے لیے دنیا سے بہتر ہے",
      "  جالندہری ": "اور آخرت تمہارے لیے پہلی (حالت یعنی دنیا) سے کہیں بہتر ہے",
      "  طاہر القادری": "اور بیشک (ہر) بعد کی گھڑی آپ کے لئے پہلے سے بہتر (یعنی باعثِ عظمت و رفعت) ہے،",
      "   علامہ جوادی": "اور آخرت تمہارے لئے دنیا سے کہیں زیادہ بہتر ہے",
      " محمد جوناگڑھی": "یقیناً تیرے لئے انجام آغاز سے بہتر ہوگا",
      " محمد حسین نجفی ": "یقیناً آپ کے لئے انجام (اور بعد کا دور) آغاز (پہلے دور) سے بہتر ہے۔",
      "مفتی تقی عثمانی": "اور یقینا آگے آنے والے حالات تمہارے لیے پہلے حالات سے بہتر ہیں"
     },
     {
      "Aya": "﴾‏وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَىٰ ﴿٥   ‎‏",
     "ابوالاعلی مودودی ": "اور عنقریب تمہارا رب تم کو اتنا دے گا کہ تم خوش ہو جاؤ گے",
     "  احمد رضا خان ": "اور بیشک قریب ہے کہ تمہارا رب تمہیں اتنا دے گا کہ تم راضی ہوجاؤ گے",
      "احمد علی ": "اور آپ کا رب آپ کو (اتنا) دے گا کہ آپ خوش ہو جائیں گے",
      "  جالندہری ": "اور تمہیں پروردگار عنقریب وہ کچھ عطا فرمائے گا کہ تم خوش ہو جاؤ گے",
      "  طاہر القادری": "اور آپ کا رب عنقریب آپ کو (اتنا کچھ) عطا فرمائے گا کہ آپ راضی ہو جائیں گے،",
      "   علامہ جوادی": "اور عنقریب تمہارا پروردگار تمہیں اس قدر عطا کردے گا کہ خوش ہوجاؤ",
      " محمد جوناگڑھی": "تجھے تیرا رب بہت جلد (انعام) دے گا اور تو راضی (وخوش) ہو جائے گا",
      " محمد حسین نجفی ": "اورعنقریب آپ(ص) کا پروردگار آپ(ص) کو اتنا عطا کرے گا کہ آپ(ص) خوش ہو جائینگے۔",
      "مفتی تقی عثمانی": "کیا اس نے تمہیں یتیم نہیں پایا تھا ، پھر ( تمہیں ) ٹھکانا دیا؟ "
     },
     {
      "Aya": "﴾أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ ﴿٦‎",
     "ابوالاعلی مودودی ": "کیا اس نے تم کو یتیم نہیں پایا اور پھر ٹھکانا فراہم کیا؟",
     "  احمد رضا خان ": "کیا اس نے تمہیں یتیم نہ پایا پھر جگہ دی",
      "احمد علی ": "کیا اس نے آپ کو یتیم نہیں پایا تھا پھر جگہ دی",
      "  جالندہری ": "بھلا اس نے تمہیں یتیم پا کر جگہ نہیں دی؟ (بےشک دی)",
      "  طاہر القادری": "(اے حبیب!) کیا اس نے آپ کو یتیم نہیں پایا پھر اس نے (آپ کو معزّز و مکرّم) ٹھکانا دیا۔ یا- کیا اس نے آپ کو (مہربان) نہیں پایا پھر اس نے (آپ کے ذریعے) یتیموں کو ٹھکانا دیا)٭، ٭ اِس ترجہ میں یتیماً کو فاٰوٰی کا مفعولِ مقدّم قرار دیا گیا ہے۔ (ملاحظہ ہو: التفسیر الکبیر، القرطبی، البحر المحیط، روح البیان، الشفاء اور شرح خفاجی)",
      "   علامہ جوادی": "کیا اس نے تم کو یتیم پاکر پناہ نہیں دی ہے",
      " محمد جوناگڑھی": "کیا اس نے تجھے یتیم پا کر جگہ نہیں دی",
      " محمد حسین نجفی ": "کیا خدانے آپ(ص) کو یتیم نہیں پایا؟ تو پناہ کی جگہ دی؟",
      "مفتی تقی عثمانی": "اور تمہیں راستے سے ناواقف پایا تو راستہ دکھایا"
     },
     {
      "Aya": "﴾وَوَجَدَكَ ضَالًّا فَهَدَىٰ ﴿٧‎‏ ",
     "ابوالاعلی مودودی ": "اور تمہیں ناواقف راہ پایا اور پھر ہدایت بخشی",
     "  احمد رضا خان ": "اور تمہیں اپنی محبت میں خود رفتہ پایا تو اپنی طرف راہ دی",
      "احمد علی ": "اور آپ کو (شریعت سے) بے خبر پایا پھر (شریعت کا) راستہ بتایا",
      "  جالندہری ": "اور رستے سے ناواقف دیکھا تو رستہ دکھایا",
      "  طاہر القادری": "اور اس نے آپ کو اپنی محبت میں خود رفتہ و گم پایا تو اس نے مقصود تک پہنچا دیا۔ یا- اور اس نے آپ کو بھٹکی ہوئی قوم کے درمیان (رہنمائی فرمانے والا) پایا تو اس نے (انہیں آپ کے ذریعے) ہدایت دے دی۔٭، ٭ اِس ترجہ میں ضالاً کو فَھَدٰی کا مفعولِ مقدم قرار دیا گیا ہے۔ (ملاحظہ ہو: التفسیر الکبیر، القرطبی، البحر المحیط، روح البیان، الشفاء اور شرح خفاجی)",
      "   علامہ جوادی": "اور کیا تم کو گم گشتہ پاکر منزل تک نہیں پہنچایا ہے",
      " محمد جوناگڑھی": "اور تجھے راه بھوﻻ پا کر ہدایت نہیں دی",
      " محمد حسین نجفی ": "اور آپ(ص) کو گمنام پایا تو (لوگوں کو آپ(ص) کی طرف) راہنمائی کی۔",
      "مفتی تقی عثمانی": "اور تمہیں نادار پایا تو غنی کردیا "
     },
     {
      "Aya": "﴾وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ ﴿٨  ‎",
     "ابوالاعلی مودودی ": "اور تمہیں نادار پایا اور پھر مالدار کر دیا",
     "  احمد رضا خان ": "اور تمہیں حاجت مند پایا پھر غنی کردیا",
      "احمد علی ": "اوراس نے آپ کو تنگدست پایا پھر غنی کر دیا",
      "  جالندہری ": "اور تنگ دست پایا تو غنی کر دیا",
      "  طاہر القادری": "اور اس نے آپ کو (وصالِ حق کا) حاجت مند پایا تو اس نے (اپنی لذتِ دید سے نواز کر ہمیشہ کے لئے ہر طلب سے) بے نیاز کر دیا۔ (یا:- اور اس نے آپ کو (جوّاد و کریم) پایا تو اس نے (آپ کے ذریعے) محتاجوں کو غنی کر دیا۔٭، ٭ ان تینوں تراجم میں یَتِیماً کو فَاٰوٰی کا، ضآلًّا کو فَھَدٰی کا اور عائِلًا کو فَاَغنٰی کا مفعولِ مقدم قرار دیا ہے۔ (ملاحظہ ہو: التفسیر الکبیر، القرطبی، البحر المحیط، روح البیان، الشفاء اور شرح خفاجی)",
      "   علامہ جوادی": "اور تم کو تنگ دست پاکر غنی نہیں بنایا ہے",
      " محمد جوناگڑھی": "اور تجھے نادار پاکر تونگر نہیں بنا دیا؟",
      " محمد حسین نجفی ": "اور اللہ تعالیٰ نے آپ(ص) کونادار پایا سو مالدار بنا دیا۔",
      "مفتی تقی عثمانی": "اب جو یتیم ہے تم اس پر سختی مت کرنا ۔"
     },
     {
      "Aya": "  ﴾فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ ﴿٩   ",
     "ابوالاعلی مودودی ": "لہٰذا یتیم پر سختی نہ کرو",
     "  احمد رضا خان ": "تو یتیم پر دباؤ نہ ڈالو",
      "احمد علی ": "پھر یتیم کو دبایا نہ کرو",
      "  جالندہری ": "تو تم بھی یتیم پر ستم نہ کرنا",
      "  طاہر القادری": "سو آپ بھی کسی یتیم پر سختی نہ فرمائیں،",
      "   علامہ جوادی": "لہذا اب تم یتیم پر قہر نہ کرنا",
      " محمد جوناگڑھی": "پس یتیم پر تو بھی سختی نہ کیا کر",
      " محمد حسین نجفی ": "پس یتیم پر سختی نہ کیجئے۔",
      "مفتی تقی عثمانی": "اور جو سوال کرنے والا ہو ، اسے جھڑکنا نہیں ۔"
     },
     {
      "Aya": "  ﴾ السَّائِلَ فَلَا تَنْهَرْ ﴿١٠    ‎",
     "ابوالاعلی مودودی ": "اور سائل کو نہ جھڑکو",
     "  احمد رضا خان ": "اور منگتا کو نہ جھڑکو",
      "احمد علی ": "اورسائل کو جھڑکا نہ کرو",
      "  جالندہری ": "اور مانگنے والے کو جھڑکی نہ دینا",
      "  طاہر القادری": "اور (اپنے در کے) کسی منگتے کو نہ جھڑکیں،",
      "   علامہ جوادی": "اور سائل کوجھڑک مت دینا",
      " محمد جوناگڑھی": "اور نہ سوال کرنے والے کو ڈانٹ ڈپٹ",
      " محمد حسین نجفی ": "اور سائل کو نہ جھڑکئے۔",
      "مفتی تقی عثمانی": "اور جو تمہارے پروردگار کی نعمت ہے اس کا تذکرہ کرتے رہنا ۔"
     },
     {
      "Aya": "﴾وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ ﴿١١‎‏",
     "ابوالاعلی مودودی ": "اور اپنے رب کی نعمت کا اظہار کرو",
     "  احمد رضا خان ": "اور اپنے رب کی نعمت کا خوب چرچا کرو",
      "احمد علی ": "اورہر حال میں اپنے رب کے احسان کا ذکر کیا کرو",
      "  جالندہری ": "اور اپنے پروردگار کی نعمتوں کا بیان کرتے رہنا",
      "  طاہر القادری": "اور اپنے رب کی نعمتوں کا (خوب) تذکرہ کریں،",
      "   علامہ جوادی": "اور اپنے پروردگار کی نعمتوں کو برابر بیان کرتے رہنا",
      " محمد جوناگڑھی": "اور اپنے رب کی نعمتوں کو بیان کرتا ره",
      " محمد حسین نجفی ": "اور اپنے پروردگار کی نعمت کا اظہار کیجئے۔",
      "مفتی تقی عثمانی":"اور جو تمہارے پروردگار کی نعمت ہے اس کا تذکرہ کرتے رہنا ۔"

     }
    ]
    