[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
    "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
    " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya": "﴾أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ ﴿١",
    "ابوالاعلی مودودی ": "تم نے دیکھا نہیں کہ تمہارے رب نے ہاتھی والوں کے ساتھ کیا کیا؟",
     "  احمد رضا خان ": "اے محبوب! کیا تم نے نہ دیکھا تمہارے رب نے ان ہاتھی والوں کیا حال کیا",
     "احمد علی ": "کیا آپ نے نہیں دیکھا کہ آپ کے رب نے ہاتھی والوں سے کیا برتاؤ کیا",
      "  جالندہری ": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے ہاتھی والوں کے ساتھ کیا کیا",
     "  طاہر القادری": "کیا آپ نے نہیں دیکھا کہ آپ کے رب نے ہاتھی والوں کے ساتھ کیا سلوک کیا،",
     "   علامہ جوادی": "کیا تم نے نہیں دیکھا کہ تمہارے رب نے ہاتھی والوں کے ساتھ کیا برتاؤ کیاہے",
    " محمد جوناگڑھی": "کیا تو نے نہ دیکھا کہ تیرے رب نے ہاتھی والوں کے ساتھ کیا کیا؟",
     " محمد حسین نجفی ": "کیا تو نے نہ دیکھا کہ تیرے رب نے ہاتھی والوں کے ساتھ کیا کیا؟",
     "مفتی تقی عثمانی": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے ہاتھی والوں کے ساتھ کیسا معاملہ کیا؟ "
    },
    {
     "Aya": "﴾أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ ﴿٢",
    "ابوالاعلی مودودی ": "کیا اُس نے اُن کی تدبیر کو اکارت نہیں کر دیا؟",
     "  احمد رضا خان ": "کیا ان کا داؤ تباہی میں نہ ڈالا،",
     "احمد علی ": "کیا اس نے ان کی تدبیر کوبے کار نہیں بنا دیا تھا",
      "  جالندہری ": "کیا ان کا داؤں غلط نہیں کیا؟ (گیا)",
     "  طاہر القادری": "کیا اس نے ان کے مکر و فریب کو باطل و ناکام نہیں کر دیا،",
     "   علامہ جوادی": "کیا ان کی چال کو بے کار نہیں کردیا ہے",
    " محمد جوناگڑھی": "کیا ان کے مکر کو بےکار نہیں کردیا؟",
     " محمد حسین نجفی ": "کیا ان کے مکر کو بےکار نہیں کردیا؟",
     "مفتی تقی عثمانی": "کیا اس نے ان لوگوں کی ساری چالیں بیکار نہیں کردی تھیں؟"
    },
    {
     "Aya": " ﴾وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ ﴿٣",
    "ابوالاعلی مودودی ": "اور اُن پر پرندوں کے جھنڈ کے جھنڈ بھیج دیے",
     "  احمد رضا خان ": "اور ان پر پرندوں کی ٹکڑیاں (فوجیں) بھیجیں",
     "احمد علی ": "اور اس نے ان پر غول کے غول پرندے بھیجے",
      "  جالندہری ": "اور ان پر جھلڑ کے جھلڑ جانور بھیجے",
     "  طاہر القادری": "اور اس نے ان پر (ہر سمت سے) پرندوں کے جھنڈ کے جھنڈ بھیج دیئے،",
     "   علامہ جوادی": "اور ان پر اڑتی ہوئی ابابیل کو بھیج دیا ہے",
    " محمد جوناگڑھی": "اور ان پر پرندوں کے جھنڈ کے جھنڈ بھیج دیئے",
     " محمد حسین نجفی ": "اور ان پر پرندوں کے جھنڈ کے جھنڈ بھیج دیئے",
     "مفتی تقی عثمانی": "اور ان پر غول کے غول پرندے چھوڑ دیے تھے ۔"
    },
    {
     "Aya": " ﴾تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ ﴿٤",
    "ابوالاعلی مودودی ": "جو اُن پر پکی ہوئی مٹی کے پتھر پھینک رہے تھے",
     "  احمد رضا خان ": "کہ انہیں کنکر کے پتھروں سے مارتے",
     "احمد علی ": "جہاں پر پتھر کنکر کی قسم کے پھینکتے تھے",
      "  جالندہری ": "جو ان پر کھنگر کی پتھریاں پھینکتے تھے",
     "  طاہر القادری": "جو ان پر کنکریلے پتھر مارتے تھے،",
     "   علامہ جوادی": "جو انہیں کھرنجوں کی کنکریاں ماررہی تھیں",
    " محمد جوناگڑھی": "جو انہیں مٹی اور پتھر کی کنکریاں مار رہے تھے",
     " محمد حسین نجفی ": "جو انہیں مٹی اور پتھر کی کنکریاں مار رہے تھے",
     "مفتی تقی عثمانی": "جو ان پر پکی مٹی کے پتھر پھینک رہے تھے "
    },
    {
     "Aya": "﴾‏فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ ﴿٥",
    "ابوالاعلی مودودی ": "پھر اُن کا یہ حال کر دیا جیسے جانوروں کا کھایا ہوا بھوسا",
     "  احمد رضا خان ": "تو انہیں کر ڈالا جیسے کھائی کھیتی کی پتی (بھوسہ)",
     "احمد علی ": "پھر انہیں کھائے ہوئے بھس کی طرح کر ڈالا",
      "  جالندہری ": "تو ان کو ایسا کر دیا جیسے کھایا ہوا بھس",
     "  طاہر القادری": "پھر (اﷲ نے) ان کو کھائے ہوئے بھوسے کی طرح (پامال) کر دیا،",
     "   علامہ جوادی": "پھر انہوں نے ان سب کو چبائے ہوئے بھوسے کے مانند بنادیا",
    " محمد جوناگڑھی": "پس انہیں کھائے ہوئے بھوسے کی طرح کردیا",
     " محمد حسین نجفی ": "پس انہیں کھائے ہوئے بھوسے کی طرح کردیا",
     "مفتی تقی عثمانی": "چنانچہ انہیں ایسا کر ڈالا جیسے کھایا ہوا بھوسا "
    }
   ]