[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
       "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾وَيْلٌ لِّكُلِّ هُمَزَةٍ لُّمَزَةٍ  ﴿١",
        "ابوالاعلی مودودی ": "تباہی ہے ہر اُس شخص کے لیے جو (منہ در منہ) لوگوں پر طعن اور (پیٹھ پیچھے) برائیاں کرنے کا خوگر ہے",
      "  احمد رضا خان ": "خرابی ہے اس کے لیے جو لوگوں کے منہ پر عیب کرے پیٹھ پیچھے بدی کرے",
      "احمد علی ": "ہر غیبت کرنے والے طعنہ دینے والے کے لیے ہلاکت ہے",
     "  جالندہری ": "ہر طعن آمیز اشارتیں کرنے والے چغل خور کی خرابی ہے",
      "  طاہر القادری": "ہر اس شخص کے لئے ہلاکت ہے جو (روبرو) طعنہ زنی کرنے والا ہے (اور پسِ پشت) عیب جوئی کرنے والا ہے،",
       "   علامہ جوادی": "تباہی اور بربادی ہے ہر طعنہ زن اور چغلخور کے لئے",
      " محمد جوناگڑھی": "بڑی خرابی ہے ہر ایسے شخص کی جو عیب ٹٹولنے واﻻ غیبت کرنے واﻻ ہو",
      " محمد حسین نجفی ": "تباہی ہے ہر اس شخص کیلئے جو (رُوبرُو) طعن و تشنیع کرنے والا (اور پسِ پشت) عیب جوئی کرنے والا ہے۔",
     "مفتی تقی عثمانی": "بڑی خرابی ہے اس شخص کی جو پیٹھ پیچھے دوسروں پر عیب لگانے والا ( اور ) منہ پر طعنے دینے کا عادی ہو ۔ "
     },
     {
      "Aya": " ﴾الَّذِي جَمَعَ مَالًا وَعَدَّدَهُ ﴿٢",
        "ابوالاعلی مودودی ": "جس نے مال جمع کیا اور اُسے گن گن کر رکھا",
      "  احمد رضا خان ": "جس نے مال جوڑا اور گن گن کر رکھا،",
      "احمد علی ": "جو مال کو جمع کرتا ہے اور اسے گنتا رہتا ہے",
     "  جالندہری ": "جو مال جمع کرتا اور اس کو گن گن کر رکھتا ہے",
      "  طاہر القادری": "خرابی و تباہی ہے اس شخص کے لئے جس نے مال جمع کیا اور اسے گن گن کر رکھتا ہے،",
       "   علامہ جوادی": "جس نے مال کو جمع کیا اور خوب اس کا حساب رکھا",
      " محمد جوناگڑھی": "جو مال کو جمع کرتا جائے اور گنتا جائے",
      " محمد حسین نجفی ": "جو مال جمع کرتا ہے اور اسے گن گن کر رکھتا ہے۔",
     "مفتی تقی عثمانی": "جس نے مال اکٹھا کیا ہو اور اسے گنتا رہتا ہو ۔"
     },
     {
      "Aya": " ﴾يَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ ﴿٣",
        "ابوالاعلی مودودی ": "وہ سمجھتا ہے کہ اُس کا مال ہمیشہ اُس کے پاس رہے گا",
      "  احمد رضا خان ": "کیا یہ سمجھتا ہے کہ اس کا مال اسے دنیا میں ہمیشہ رکھے گا",
      "احمد علی ": "وہ خیال کرتا ہے کہ اس کا مال اسے سدا رکھے گا",
     "  جالندہری ": " خیال کرتا ہے کہ اس کا مال اس کی ہمیشہ کی زندگی کا موجب ہو گا",
      "  طاہر القادری": "وہ یہ گمان کرتا ہے کہ اس کی دولت اسے ہمیشہ زندہ رکھے گی،",
       "   علامہ جوادی": "اس کا خیال تھا کہ یہ مال اسے ہمیشہ باقی رکھے گا",
      " محمد جوناگڑھی": "وه سمجھتا ہے کہ اس کا مال اس کے پاس سدا رہے گا",
      " محمد حسین نجفی ": "کیا وہ خیال کرتا ہے کہ اس کا مال اسے ہمیشہ زندہ رکھے گا۔",
     "مفتی تقی عثمانی": "وہ سمجھتا ہے کہ اسکا مال اسے ہمیشہ زندہ رکھے گا "
     },
     {
      "Aya": " ﴾كَلَّا ۖ لَيُنبَذَنَّ فِي الْحُطَمَةِ ﴿٤",
        "ابوالاعلی مودودی ": "ہرگز نہیں، وہ شخص تو چکنا چور کر دینے والی جگہ میں پھینک دیا جائے گا",
      "  احمد رضا خان ": "ہر گز نہیں ضرور وہ روندنے والی میں پھینکا جائے گا",
      "احمد علی ": "ہرگز نہیں وہ ضرور حطمہ میں پھینکا جائے گا",
     "  جالندہری ": "ہر گز نہیں وہ ضرور حطمہ میں ڈالا جائے گا",
      "  طاہر القادری": "ہرگز نہیں! وہ ضرور حطمہ (یعنی چورا چورا کر دینے والی آگ) میں پھینک دیا جائے گا،",
       "   علامہ جوادی": "ہرگز نہیں اسے یقینا حطمہ میں ڈال دیا جائے گا",
      " محمد جوناگڑھی": "ہرگز نہیں یہ تو ضرور توڑ پھوڑ دینے والی آگ میں پھینک دیا جائے گا",
      " محمد حسین نجفی ": "ہرگز نہیں وہ تو چکناچور کر دینے والی جگہ میں پھینک دیا جائے گا۔",
     "مفتی تقی عثمانی": "ہرگز نہیں ! اس کو تو ایسی جگہ میں پھینکا جائے گا جو چورا چورا کرنے والی ہے ۔"
     },
     {
      "Aya": " ﴾وَمَا أَدْرَاكَ مَا الْحُطَمَةُ ﴿٥",
        "ابوالاعلی مودودی ": "اور تم کیا جانو کہ کیا ہے وہ چکنا چور کر دینے والی جگہ؟",
      "  احمد رضا خان ": "اور تو نے کیا جانا کیا روندنے والی،",
      "احمد علی ": "اور آپ کو کیا معلوم حطمہ کیا ہے",
     "  جالندہری ": "اور تم کیا سمجھے حطمہ کیا ہے؟",
      "  طاہر القادری": "اور آپ کیا سمجھے ہیں کہ حطمہ (چورا چورا کر دینے والی آگ) کیا ہے،",
       "   علامہ جوادی": "اور تم کیا جانو کہ حطمہ کیا شے ہے",
      " محمد جوناگڑھی": "اور تجھے کیا معلوم کہ ایسی آگ کیا ہوگی؟",
      " محمد حسین نجفی ": "اور تمہیں کیا معلوم ہے کہ وہ چکناچور کردینے والی جگہ کیا ہے؟",
     "مفتی تقی عثمانی": "اور تمہیں کیا معلوم وہ چورا چورا کرنے والی چیز کیا ہے؟"
     },
     {
      "Aya": " ﴾‏نَارُ اللَّهِ الْمُوقَدَةُ ﴿٦‏",
        "ابوالاعلی مودودی ": "اللہ کی آگ، خوب بھڑکائی ہوئی",
      "  احمد رضا خان ": "اللہ کی آگ کہ بھڑک رہی ہے",
      "احمد علی ": "وہ الله کی بھڑکائی ہوئی آگ ہے",
     "  جالندہری ": "وہ خدا کی بھڑکائی ہوئی آگ ہے",
      "  طاہر القادری": "(یہ) اﷲ کی بھڑکائی ہوئی آگ ہے،",
       "   علامہ جوادی": "یہ اللہ کی بھڑکائی ہوئی آگ ہے",
      " محمد جوناگڑھی": "وه اللہ تعالیٰ کی سلگائی ہوئی آگ ہوگی",
      " محمد حسین نجفی ": "وہ اللہ کی خوب بھڑکائی ہوئی آگ ہے۔",
     "مفتی تقی عثمانی": "اللہ کی سلگائی ہوئی آگ"
     },
     {
      "Aya": " ﴾الَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ ﴿٧",
        "ابوالاعلی مودودی ": "جو دلوں تک پہنچے گی",
      "  احمد رضا خان ": "وہ جو دلوں پر چڑھ جائے گی",
      "احمد علی ": "جو دلوں تک جا پہنچتی ہے",
     "  جالندہری ": "جو دلوں پر جا لپٹے گی",
      "  طاہر القادری": "جو دلوں پر (اپنی اذیت کے ساتھ) چڑھ جائے گی،",
       "   علامہ جوادی": "جو دلوں تک چڑھ سسجائے گی",
      " محمد جوناگڑھی": "جو دلوں پر چڑھتی چلی جائے گی",
      " محمد حسین نجفی ": "جو دلوں تک جا پہنچے گی۔",
     "مفتی تقی عثمانی": "جو دلوں تک جا چڑھے گی ۔"
     },
     {
      "Aya": " ﴾إِنَّهَا عَلَيْهِم مُّؤْصَدَةٌ ﴿٨",
        "ابوالاعلی مودودی ": "وہ اُن پر ڈھانک کر بند کر دی جائے گی",
      "  احمد رضا خان ": "بیشک وہ ان پر بند کردی جائے گی",
      "احمد علی ": "بے شک وہ ان پر چاروں طرف سے بند کر دی جائے گی",
     "  جالندہری ": "(اور) وہ اس میں بند کر دیئے جائیں گے",
      "  طاہر القادری": "بیشک وہ (آگ) ان لوگوں پر ہر طرف سے بند کر دی جائے گی،",
       "   علامہ جوادی": "وہ آگ ان کے اوپر گھیر دی جائے گی",
      " محمد جوناگڑھی": "وہ ان پر ہر طرف سے بند کی ہوئی ہوگی",
      " محمد حسین نجفی ": "جو چَو طرفہ طور پر ان پر بند کر دی جائے گی۔",
     "مفتی تقی عثمانی": "یقینا جانو وہ ان پر بند کردی جائے گی ۔"
     },
     {
      "Aya": "﴾‏ فِي عَمَدٍ مُّمَدَّدَةٍ  ﴿٩",
        "ابوالاعلی مودودی ": "اِس حالت میں کہ وہ اونچے اونچے ستونوں میں (گھرے ہوئے ہوں گے)",
      "  احمد رضا خان ": "لمبے لمبے ستونوں میں",
      "احمد علی ": "لمبے لمبے ستونوں میں",
     "  جالندہری ": "(یعنی آگ کے) لمبے لمبے ستونوں میں",
      "  طاہر القادری": "(بھڑکتے شعلوں کے) لمبے لمبے ستونوں میں (اور ان لوگوں کے لئے کوئی راہِ فرار نہ رہے گی)،",
       "   علامہ جوادی": "لمبے لمبے ستونوں کے ساتھ",
      " محمد جوناگڑھی": "بڑے بڑے ستونوں میں",
      " محمد حسین نجفی ": "وہ لمبے لمبے ستونوں (جیسے شعلوں) میں (گِھرے ہوئے ہوں گے)۔",
     "مفتی تقی عثمانی": "جبکہ وہ ( آگ کے ) لمبے چوڑے ستونوں میں ( گھرے ہوئے ) ہوں گے ۔"
     }
    ]
    