[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
    "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
    "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی":  "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
    " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya": " ﴾وَالْعَادِيَاتِ ضَبْحًا ﴿١‎",
     "ابوالاعلی مودودی ": "قسم ہے اُن (گھوڑوں) کی جو پھنکارے مارتے ہوئے دوڑتے ہیں",
     "  احمد رضا خان ": "قسم ان کی جو دوڑتے ہیں سینے سے آواز نکلتی ہوئی",
    "احمد علی ": "ان گھوڑوں کی قسم جو ہانپتے ہوئے دوڑتے ہیں",
    "  جالندہری ": "ان سرپٹ دوڑنے والے گھوڑوں کی قسم جو ہانپ اٹھتےہیں",
    "  طاہر القادری": "(میدانِ جہاد میں) تیز دوڑنے والے گھوڑوں کی قَسم جو ہانپتے ہیں",
    "   علامہ جوادی": "فراٹے بھرتے ہوئے تیز رفتار گھوڑوں کی قسم",
     " محمد جوناگڑھی":  "ہانپتے ہوئے دوڑنے والے گھوڑوں کی قسم!",
    " محمد حسین نجفی ": "قَسم ہے ان گھوڑوں کی جو پھنکارے مارتے ہوئے دوڑتے ہیں۔",
     "مفتی تقی عثمانی": "قسم ہے ان گھوڑوں کی جو ہانپ ہانپ کر دوڑتے ہیں ۔"
    },
    {
     "Aya": "﴾فَالْمُورِيَاتِ قَدْحًا ﴿٢ ‎",
     "ابوالاعلی مودودی ": "پھر (اپنی ٹاپوں سے) چنگاریاں جھاڑتے ہیں",
     "  احمد رضا خان ": "پھر پتھروں سے آگ نکالتے ہیں سم مارکر",
    "احمد علی ": "پھر (پتھر پر) ٹاپ مار کر آگ جھاڑتے ہیں",
    "  جالندہری ": "پھر (پتھروں پر نعل) مار کر آگ نکالتے ہیں",
    "  طاہر القادری": "پھر جو پتھروں پر سُم مار کر چنگاریاں نکالتے ہیں،",
    "   علامہ جوادی": "جوٹا پ مار کر چنگاریاں اُڑانے والے ہیں",
     " محمد جوناگڑھی":  "پھر ٹاپ مار کر آگ جھاڑنے والوں کی قسم!",
    " محمد حسین نجفی ": "پھر اپنی ٹاپوں کی ٹھوکر سے (پتھر سے) چنگاریاں نکا لتے ہیں۔",
     "مفتی تقی عثمانی": "پھر جو ( اپنی ٹاپوں سے ) چنگاریاں اڑاتے ہیں ۔"
    },
    {
     "Aya": " ﴾فَالْمُغِيرَاتِ صُبْحًا ﴿٣",
     "ابوالاعلی مودودی ": "پھر صبح سویرے چھاپہ مارتے ہیں",
     "  احمد رضا خان ": "پھر صبح ہوتے تاراج کرتے ہیں",
    "احمد علی ": "پھر صبح کے وقت دھاوا کرتے ہیں",
    "  جالندہری ": "پھر صبح کو چھاپہ مارتے ہیں",
    "  طاہر القادری": "پھر جو صبح ہوتے ہی (دشمن پر) اچانک حملہ کر ڈالتے ہیں،",
    "   علامہ جوادی": "پھر صبحدم حملہ کرنے والے ہیں",
     " محمد جوناگڑھی":  "پھر صبح کے وقت دھاوا بولنے والوں کی قسم",
    " محمد حسین نجفی ": "پھر صبح کے وقت (اچانک) چھاپہ مارتے ہیں۔",
     "مفتی تقی عثمانی": "پھر صبح کے وقت یلغار کرتے ہیں ۔"
    },
    {
     "Aya": "﴾فَأَثَرْنَ بِهِ نَقْعًا ﴿٤ ‎",
     "ابوالاعلی مودودی ": "پھر اس موقع پر گرد و غبار اڑاتے ہیں",
     "  احمد رضا خان ": "پھر اس وقت غبار اڑاتے ہیں،",
    "احمد علی ": "پھر اس وقت غبار اُڑاتے ہیں",
    "  جالندہری ": "پھر اس میں گرد اٹھاتے ہیں",
    "  طاہر القادری": "پھر وہ اس (حملے والی) جگہ سے گرد و غبار اڑاتے ہیں،",
    "   علامہ جوادی": "پھر غبار جنگ اڑانے والے نہیں",
     " محمد جوناگڑھی":  "پس اس وقت گرد وغبار اڑاتے ہیں",
    " محمد حسین نجفی ": "تو اس طرح گَرد و غبار اڑاتے ہیں۔",
     "مفتی تقی عثمانی": "پھر صبح کے وقت یلغار کرتے ہیں ۔"
    },
    {
     "Aya": " ﴾‏فَوَسَطْنَ بِهِ جَمْعًا  ﴿٥‎‏",
     "ابوالاعلی مودودی ": "پھر اِسی حالت میں کسی مجمع کے اندر جا گھستے ہیں",
     "  احمد رضا خان ": "پھر دشمن کے بیچ لشکر میں جاتے ہیں،",
    "احمد علی ": "پھر اس وقت دشمنوں کی جماعت میں جا گھستے ہیں",
    "  جالندہری ": "پھر اس وقت دشمن کی فوج میں جا گھستے ہیں",
    "  طاہر القادری": "پھر وہ اسی وقت (دشمن کے) لشکر میں گھس جاتے ہیں،",
    "   علامہ جوادی": "اور دشمن کی جمعیت میں در آنے والے ہیں",
     " محمد جوناگڑھی":  "پھر اسی کے ساتھ فوجیوں کے درمیان گھس جاتے ہیں",
    " محمد حسین نجفی ": "پھر اسی حالت میں (دشمن کی) جماعت (لشکر) میں گھس جاتے ہیں۔",
     "مفتی تقی عثمانی": "پھر اسی وقت کسی جمگھٹے کے بیچوں بیچ جاگھستے ہیں "
    },
    {
     "Aya": " ﴾‏إِنَّ الْإِنسَانَ لِرَبِّهِ لَكَنُودٌ ﴿٦‏",
     "ابوالاعلی مودودی ": "حقیقت یہ ہے کہ انسان اپنے رب کا بڑا ناشکرا ہے",
     "  احمد رضا خان ": "بیشک آدمی اپنے رب کا بڑا ناشکرا ہے",
    "احمد علی ": "بے شک انسان اپنے رب کا بڑا ناشکرا ہے",
    "  جالندہری ": "کہ انسان اپنے پروردگار کا احسان ناشناس (اور ناشکرا) ہے",
    "  طاہر القادری": "بیشک انسان اپنے رب کا بڑا ہی ناشکرا ہے،",
    "   علامہ جوادی": "بے شک انسان اپنے پروردگار کے لئے بڑا ناشکرا ہے",
     " محمد جوناگڑھی":  "یقیناً انسان اپنے رب کا بڑا ناشکرا ہے",
    " محمد حسین نجفی ": "بےشک انسان اپنے پروردگار کا بڑا ناشکرا ہے۔",
     "مفتی تقی عثمانی": "کہ انسان اپنے پروردگار کا بڑا ناشکرا ہے ۔"
    },
    {
     "Aya": " ﴾‏ وَإِنَّهُ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ ﴿٧ ‎‏ ",
     "ابوالاعلی مودودی ": "اور وہ خود اِس پر گواہ ہے",
     "  احمد رضا خان ": "اور بیشک وہ اس پر خود گواہ ہے",
    "احمد علی ": "اوربے شک وہ اس بات پر خود شاہد ہے",
    "  جالندہری ": "اور وہ اس سے آگاہ بھی ہے",
    "  طاہر القادری": "اور یقیناً وہ اس (ناشکری) پر خود گواہ ہے",
    "   علامہ جوادی": "اور وہ خود بھی اس بات کا گواہ ہے",
     " محمد جوناگڑھی":  "اور یقیناً وه خود بھی اس پر گواه ہے",
    " محمد حسین نجفی ": "اور وہ خود اس پر گواہ ہے",
     "مفتی تقی عثمانی": "اور وہ خود اس بات کا گواہ ہے"
    },
    {
     "Aya": " ﴾‏وَإِنَّهُ لِحُبِّ الْخَيْرِ لَشَدِيدٌ ﴿٨‎‏",
     "ابوالاعلی مودودی ": "اور وہ مال و دولت کی محبت میں بری طرح مبتلا ہے",
     "  احمد رضا خان ": "اور بیشک وہ مال کی چاہت میں ضرور کرّا (تیز) ہے",
    "احمد علی ": "اوربے شک وہ مال کی محبت میں بڑا سخت ہے",
    "  جالندہری ": "وہ تو مال سے سخت محبت کرنے والا ہے",
    "  طاہر القادری": "اور بیشک وہ مال کی محبت میں بہت سخت ہے،",
    "   علامہ جوادی": "اور وہ مال کی محبت میں بہت سخت ہے",
     " محمد جوناگڑھی":  "یہ مال کی محنت میں بھی بڑا سخت ہے",
    " محمد حسین نجفی ": "اور وہ مال و دولت کی محبت میں بڑا سخت (گرفتار) ہے۔",
     "مفتی تقی عثمانی": "اور حقیقت یہ ہے کہ وہ مال کی محبت میں بہت پکا ہے"
    },
    {
     "Aya": "‏ ﴾أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِي الْقُبُور ﴿٩‎‏‎",
     "ابوالاعلی مودودی ": "تو کیا وہ اُس حقیقت کو نہیں جانتا جب قبروں میں جو کچھ (مدفون) ہے اُسے نکال لیا جائے گا",
     "  احمد رضا خان ": "تو کیا نہیں جانتا جب اٹھائے جائیں گے جو قبروں میں ہیں،",
    "احمد علی ": "پس کیا وہ نہیں جانتا جب اکھاڑا جائے گا جو کچھ قبروں میں ہے",
    "  جالندہری ": "کیا وہ اس وقت کو نہیں جانتا کہ جو (مردے) قبروں میں ہیں وہ باہر نکال لیے جائیں گے",
    "  طاہر القادری": "تو کیا اسے معلوم نہیں جب وہ (مُردے) اٹھائے جائیں گے جو قبروں میں ہیں،",
    "   علامہ جوادی": "کیا اسے نہیں معلوم ہے کہ جب مفِدوں کو قبروں سے نکالا جائے گا",
     " محمد جوناگڑھی":  "کیا اسے وه وقت معلوم نہیں جب قبروں میں جو (کچھ) ہے نکال لیا جائے گا",
    " محمد حسین نجفی ": "کیا وہ اس وقت کو نہیں جانتا جب قبروں سے نکال لیا جائے گا جو کچھ ان میں (دفن) ہے۔",
     "مفتی تقی عثمانی": "بھلا کیا وہ وقت اسے معلوم نہیں ہے جب قبروں میں جو کچھ ہے اسے باہر بکھیر دیا جائے "
    },
    {
     "Aya": " ﴾وَحُصِّلَ مَا فِي الصُّدُورِ ﴿١٠‎",
     "ابوالاعلی مودودی ": "اور سینوں میں جو کچھ (مخفی) ہے اُسے برآمد کر کے اس کی جانچ پڑتال کی جائے گی؟",
     "  احمد رضا خان ": "اور کھول دی جائے گی جو سینوں میں ہے،",
    "احمد علی ": "اورجو دلوں میں ہے وہ ظاہر کیا جائے گا",
    "  جالندہری ": "اور جو (بھید) دلوں میں ہیں وہ ظاہر کر دیئے جائیں گے",
    "  طاہر القادری": "اور (راز) ظاہر کر دیئے جائیں گے جو سینوں میں ہیں،",
    "   علامہ جوادی": "اور دل کے رازوں کو ظاہر کردیا جائے گا",
     " محمد جوناگڑھی":  "اور سینوں کی پوشیده باتیں ﻇاہر کر دی جائیں گی",
    " محمد حسین نجفی ": "اور جو کچھ سینوں میں (چھپا ہوا) ہے وہ ظاہر کر دیا جائے گا۔",
     "مفتی تقی عثمانی": "اور سینوں میں جو کچھ ہے اسے ظاہر کردیا جائے گا ۔"
    },
    {
     "Aya": " ﴾إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌ ﴿١١‎",
     "ابوالاعلی مودودی ": "یقیناً اُن کا رب اُس روز اُن سے خوب باخبر ہوگا",
     "  احمد رضا خان ": "بیشک ان کے رب کو اس دن ان کی سب خبر ہے",
    "احمد علی ": "بے شک ان کا رب ان سے اس دن خوب خبردار ہو گا",
    "  جالندہری ": "بےشک ان کا پروردگار اس روز ان سے خوب واقف ہوگا",
    "  طاہر القادری": "بیشک ان کا رب اس دن ان (کے اعمال) سے خوب خبردار ہوگا،",
    "   علامہ جوادی": "تو ان کا پروردگار اس دن کے حالات سے خوب باخبر ہوگا",
     " محمد جوناگڑھی":  "بیشک ان کا رب اس دن ان کے حال سے پورا باخبر ہوگا",
    " محمد حسین نجفی ": "اس دن ان کا پروردگار ان کے حالات سے بڑا باخبر ہوگا۔",
     "مفتی تقی عثمانی": "یقینا ان کا پروردگار اس دن ان ( کی جو حالت ہوگی اس ) سے پوری طرح باخبر ہے ۔"
    }
]