[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  جالندہری ":"شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  طاہر القادری":  "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
       " محمد جوناگڑھی":  "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
       " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی":  "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾إِذَا زُلْزِلَتِ الْأَرْضُ زِلْزَالَهَا ﴿١‎",
      "ابوالاعلی مودودی ":  "جب زمین اپنی پوری شدت کے ساتھ ہلا ڈالی جائے گی",
     "  احمد رضا خان ":  "جب زمین تھرتھرا دی جائے جیسا اس کا تھرتھرانا ٹھہرا ہے",
      "احمد علی ": "جب زمین بڑے زور سے ہلا دی جائے گی",
       "  جالندہری ":"جب زمین بھونچال سے ہلا دی جائے گی",
       "  طاہر القادری":  "جب زمین اپنے سخت بھونچال سے بڑی شدت کے ساتھ تھرتھرائی جائے گی،",
      "   علامہ جوادی": "جب زمین زوروں کے ساتھ زلزلہ میں آجائے گی",
       " محمد جوناگڑھی":  "جب زمین پوری طرح جھنجھوڑ دی جائے گی",
       " محمد حسین نجفی ": "جب زمین پوری شدت سے ہلا ڈالی جائے گی۔",
      "مفتی تقی عثمانی":  "جب زمین اپنے بھونچال سے جھنجوڑدی جائے گی ۔"
     },
     {
      "Aya": " ﴾‏وَأَخْرَجَتِ الْأَرْضُ أَثْقَالَهَا ﴿٢‏",
      "ابوالاعلی مودودی ":  "اور زمین اپنے اندر کے سارے بوجھ نکال کر باہر ڈال دے گی",
     "  احمد رضا خان ":  "اور زمین اپنے بوجھ باہر پھینک دے",
      "احمد علی ": "اور زمین اپنے بوجھ نکال پھینکے گی",
       "  جالندہری ":"اور زمین اپنے (اندر) کے بوجھ نکال ڈالے گی",
       "  طاہر القادری":  "اور زمین اپنے (سب) بوجھ نکال باہر پھینکے گی،",
      "   علامہ جوادی": "اور وہ سارے خزانے نکال ڈالے گی",
       " محمد جوناگڑھی":  "اور اپنے بوجھ باہر نکال پھینکے گی",
       " محمد حسین نجفی ": "اور زمین اپنے بوجھوں کو باہر نکال دے گی۔",
      "مفتی تقی عثمانی":  "اور زمین اپنے بوجھ باہر نکال دے گی ۔"
     },
     {
      "Aya": " ﴾وَقَالَ الْإِنسَانُ مَا لَهَا ﴿٣ ‎",
      "ابوالاعلی مودودی ":  "اور انسان کہے گا کہ یہ اِس کو کیا ہو رہا ہے",
     "  احمد رضا خان ":  "اور آدمی کہے اسے کیا ہوا",
      "احمد علی ": "اور انسان کہے گا کہ اس کو کیا ہوگیا",
       "  جالندہری ":"اور انسان کہے گا کہ اس کو کیا ہوا ہے؟",
       "  طاہر القادری":  "اور انسان (حیران و ششدر ہو کر) کہے گا: اسے کیا ہوگیا ہے،",
      "   علامہ جوادی": "اور انسان کہے گا کہ اسے کیا ہو گیا ہے",
       " محمد جوناگڑھی":  "انسان کہنے لگے گا کہ اسے کیا ہوگیا؟",
       " محمد حسین نجفی ": "اور انسان کہے گا کہ اسے کیا ہوگیا ہے؟",
      "مفتی تقی عثمانی":  "اور انسان کہے گا کہ اس کو کیا ہوگیا ہے ؟"
     },
     {
      "Aya": " ﴾يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا ﴿٤  ‎",
      "ابوالاعلی مودودی ":  "اُس روز وہ اپنے (اوپر گزرے ہوئے) حالات بیان کرے گی",
     "  احمد رضا خان ":  "اس دن وہ اپنی خبریں بتائے گی",
      "احمد علی ": "اس دن وہ اپنی خبریں بیا ن کرے گی",
       "  جالندہری ":"اس روز وہ اپنے حالات بیان کردے گی",
       "  طاہر القادری":  "اس دن وہ اپنے حالات خود ظاہر کر دے گی،",
      "   علامہ جوادی": "اس دن وہ اپنی خبریںبیان کرے گی",
       " محمد جوناگڑھی":  "اس دن زمین اپنی سب خبریں بیان کردے گی",
       " محمد حسین نجفی ": "اس دن وہ اپنی تمام خبریں بیان کرے گی۔",
      "مفتی تقی عثمانی":  "اس دن زمین اپنی ساری خبریں بتا دے گی "
     },
     {
      "Aya": " ﴾بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا  ﴿٥‎",
      "ابوالاعلی مودودی ":  "کیونکہ تیرے رب نے اُسے (ایساکرنے کا) حکم دیا ہوگا",
     "  احمد رضا خان ":  "اس لیے کہ تمہارے رب نے اسے حکم بھیجا",
      "احمد علی ": "اس لئے کہ آپ کا رب اس کو حکم دے گا",
       "  جالندہری ":"کیونکہ تمہارے پروردگار نے اس کو حکم بھیجا (ہوگا)",
       "  طاہر القادری":  "اس لئے کہ آپ کے رب نے اس کے لئے تیز اشاروں (کی زبان) کو مسخر فرما دیا ہوگا،",
      "   علامہ جوادی": "کہ تمہارے پروردگار نے اسے اشارہ کیا ہے",
       " محمد جوناگڑھی":  "اس لئے کہ تیرے رب نے اسے حکم دیا ہوگا",
       " محمد حسین نجفی ": "کیونکہ تمہارے پروردگار کا اسے یہی حکم ہوگا۔",
      "مفتی تقی عثمانی":  "کیونکہ تمہارے پروردگار نے اسے یہی حکم دیا ہوگا ۔"
     },
     {
      "Aya": " ﴾‏يَوْمَئِذٍ يَصْدُرُ النَّاسُ أَشْتَاتًا لِّيُرَوْا أَعْمَالَهُمْ  ﴿٦‎‏",
      "ابوالاعلی مودودی ":  "اُس روز لوگ متفرق حالت میں پلٹیں گے تاکہ اُن کے اعمال اُن کو دکھائے جائیں",
     "  احمد رضا خان ":  "اس دن لوگ اپنے رب کی طرف پھریں گے کئی راہ ہوکر تاکہ اپنا کیا دکھائیں جائیں تو،",
      "احمد علی ": "اس دن لوگ مختلف حالتوں میں لوٹیں گے تاکہ انہیں ان کے اعمال دکھائے جائیں",
       "  جالندہری ":"اس دن لوگ گروہ گروہ ہو کر آئیں گے تاکہ ان کو ان کے اعمال دکھا دیئے جائیں",
       "  طاہر القادری":  "اس دن لوگ مختلف گروہ بن کر (جدا جدا حالتوں کے ساتھ) نکلیں گے تاکہ انہیں ان کے اَعمال دکھائے جائیں،",
      "   علامہ جوادی": "اس روز سارے انسان گروہ در گروہ قبروں سے نکلیں گے تاکہ اپنے اعمال کو دیکھ سکیں",
       " محمد جوناگڑھی":  "اس روز لوگ مختلف جماعتیں ہو کر (واپس) لوٹیں گے تاکہ انہیں ان کے اعمال دکھا دیئے جائیں",
       " محمد حسین نجفی ": "اس دن لوگ متفرق طور پر (اپنی قبروں سے) نکلیں گے تاکہ انہیں ان کے اعمال (کے نتائج) دکھائے جائیں۔",
      "مفتی تقی عثمانی":  "اس روز لوگ مختلف ٹولیوں میں واپس ہوں گے ، تاکہ ان کے اعمال انہیں دکھا دیے جائیں ۔ "
     },
     {
      "Aya": " ﴾فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ ﴿٧ ‎",
      "ابوالاعلی مودودی ":  "پھر جس نے ذرہ برابر نیکی کی ہوگی وہ اس کو دیکھ لے گا",
     "  احمد رضا خان ":  "جو ایک ذرہ بھر بھلائی کرے اسے دیکھے گا،",
      "احمد علی ": "پھر جس نے ذرہ بھر نیکی کی ہے وہ اس کو دیکھ لے گا",
       "  جالندہری ":"تو جس نے ذرہ بھر نیکی کی ہو گی وہ اس کو دیکھ لے گا",
       "  طاہر القادری":  "تو جس نے ذرہ بھر نیکی کی ہوگی وہ اسے دیکھ لے گا،",
      "   علامہ جوادی": "پھر جس شخص نے ذرہ برابر نیکی کی ہے وہ اسے دیکھے گا",
       " محمد جوناگڑھی":  "پس جس نے ذره برابر نیکی کی ہوگی وه اسے دیکھ لے گا",
       " محمد حسین نجفی ": "تو جس نے ذرہ برابر نیکی کی ہوگی وہ اس (کی جزا) دیکھ لے گا۔",
      "مفتی تقی عثمانی":  "چنانچہ جس نے ذرہ برابر کوئی اچھائی کی ہوگی وہ اسے دیکھے گا ۔"
     },
     {
      "Aya": " ﴾‏وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ ﴿٨‏",
      "ابوالاعلی مودودی ":  "اور جس نے ذرہ برابر بدی کی ہوگی وہ اس کو دیکھ لے گا",
     "  احمد رضا خان ":  "اور جو ایک ذرہ بھر برائی کرے اسے دیکھے گا",
      "احمد علی ": "اورجس نے ذرہ بھر برائی کی ہے وہ اس کو دیکھ لے گا",
       "  جالندہری ":"اور جس نے ذرہ بھر برائی کی ہوگی وہ اسے دیکھ لے گا",
       "  طاہر القادری":  "اور جس نے ذرہ بھر برائی کی ہوگی وہ اسے (بھی) دیکھ لے گا،",
      "   علامہ جوادی": "اور جس نے ذرہ برابر برائی کی ہے وہ اسے دیکھے گا",
       " محمد جوناگڑھی":  "اور جس نے ذره برابر برائی کی ہوگی وه اسے دیکھ لے گا",
       " محمد حسین نجفی ": "اور جس نے ذرہ برابر بدی کی ہوگی وہ بھی اس (کی سزا) کو دیکھ لے گا۔",
      "مفتی تقی عثمانی":  "اور جس نے ذرہ برابر کوئی برائی کی ہوگی ، وہ اسے دیکھے گا "
     }
    ]
    