[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
       "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی":  "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ ﴿١‎‏ ",
       "ابوالاعلی مودودی ": "کیا تمہیں اُس چھا جانے والی آفت کی خبر پہنچی ہے؟",
       "  احمد رضا خان ": "بیشک تمہارے پاس اس مصیبت کی خبر آئی جو چھا جائے گی",
     "احمد علی ": "کیا آپ کے پاس سب پرچھا جانے والی (قیامت) کا حال پہنچا",
      "  جالندہری ": "بھلا تم کو ڈھانپ لینے والی (یعنی قیامت کا) حال معلوم ہوا ہے",
      "  طاہر القادری": "کیا آپ کو (ہر چیز پر) چھا جانے والی قیامت کی خبر پہنچی ہے،",
     "   علامہ جوادی": "کیا تمہیں ڈھانپ لینے والی قیامت کی بات معلوم ہے",
      " محمد جوناگڑھی":  "کیا تجھے بھی چھپا لینے والی (قیامت) کی خبر پہنچی ہے",
      " محمد حسین نجفی ": "کیا تمہیں (کائنات پر) چھا جانے والی (مصیبت یعنی قیامت) کی خبر پہنچی ہے؟",
      "مفتی تقی عثمانی": "کیا تمہیں اس واقعے ( یعنی قیامت ) کی خبر پہنچی ہے جو سب پر چھا جائے گا؟"
     },
     {
      "Aya": " ﴾‏وُجُوهٌ يَوْمَئِذٍ خَاشِعَةٌ ﴿٢ ‎‏ ",
       "ابوالاعلی مودودی ": "کچھ چہرے اُس روز خوف زدہ ہونگے",
       "  احمد رضا خان ": "کتنے ہی منہ اس دن ذلیل ہوں گے،",
     "احمد علی ": "کئی چہرو ں پر اس دن ذلت برس رہی ہوگی",
      "  جالندہری ": "اس روز بہت سے منہ (والے) ذلیل ہوں گے",
      "  طاہر القادری": "اس دن کتنے ہی چہرے ذلیل و خوار ہوں گے،",
     "   علامہ جوادی": "اس دن بہت سے چہرے ذلیل اور رسوا ہوں گے",
      " محمد جوناگڑھی":  "اس دن بہت سے چہرے ذلیل ہوں گے",
      " محمد حسین نجفی ": "اس دن کچھ چہرے ذلیل (اترے ہوئے) ہوں گے۔",
      "مفتی تقی عثمانی": "بہت سے چہرے اس دن اترے ہوئے ہوں گے ۔"
     },
     {
      "Aya": " ﴾‏امِلَةٌ نَّاصِبَةٌ ﴿٣‎‏",
       "ابوالاعلی مودودی ": "سخت مشقت کر رہے ہونگے",
       "  احمد رضا خان ": "کام کریں مشقت جھیلیں،",
     "احمد علی ": "محنت کرنے والے تھکنے والے",
      "  جالندہری ": "سخت محنت کرنے والے تھکے ماندے",
      "  طاہر القادری": "اﷲ کو بھول کر دنیاوی محنت کرنے والے (چند روزہ عیش و آرام کی خاطر سخت) مشقتیں جھیلنے والے،",
     "   علامہ جوادی": "محنت کرنے والے تھکے ہوئے",
      " محمد جوناگڑھی":  "محنت کرنے والے تھکے ہوئے ہوں گے",
      " محمد حسین نجفی ": "سخت محنت کرنے والے (نڈھال اور) تھکے ماندے ہوں گے۔",
      "مفتی تقی عثمانی": "مصیبت جھیلتے ہوئے ، تھکن سے چور "
     },
     {
      "Aya": " ﴾‏تَصْلَىٰ نَارًا حَامِيَةً ﴿٤   ‎",
       "ابوالاعلی مودودی ": "تھکے جاتے ہونگے، شدید آگ میں جھلس رہے ہونگے",
       "  احمد رضا خان ": "جائیں بھڑکتی آگ میں",
     "احمد علی ": "دھکتی ہوئی آگ میں کریں گے",
      "  جالندہری ": "دہکتی آگ میں داخل ہوں گے",
      "  طاہر القادری": "دہکتی ہوئی آگ میں جا گریں گے،",
     "   علامہ جوادی": "دہکتی ہوئی آگ میں داخل ہوں گے",
      " محمد جوناگڑھی":  "وه دہکتی ہوئی آگ میں جائیں گے",
      " محمد حسین نجفی ": "وہ دہکتی ہوئی آگ میں پڑیں گے (اور جھلسیں گے)۔",
      "مفتی تقی عثمانی": "وہ دہکتی ہوئی آگ میں داخل ہوں گے ۔"
     },
     {
      "Aya": " ﴾‏تُسْقَىٰ مِنْ عَيْنٍ آنِيَةٍ ﴿٥    ‎‏",
       "ابوالاعلی مودودی ": "کھولتے ہوئے چشمے کا پانی انہیں پینے کو دیا جائے گا",
       "  احمد رضا خان ": "نہایت جلتے چشمہ کا پانی پلائے جائیں",
     "احمد علی ": "انہیں ابلتے ہوئے چشمے سے پلایا جائے گا",
      "  جالندہری ": "ایک کھولتے ہوئے چشمے کا ان کو پانی پلایا جائے گا",
      "  طاہر القادری": "انہیں کھولتے ہوئے چشمہ سے (پانے) پلایا جائے گا،",
     "   علامہ جوادی": "انہیں کھولتے ہوئے پانی کے چشمہ سے سیراب کیا جائے گا",
      " محمد جوناگڑھی":  "اور نہایت گرم چشمے کا پانی ان کو پلایا جائے گا",
      " محمد حسین نجفی ": "انہیں کھولتے ہوئے چشمہ کا پانی پلایا جائے گا۔",
      "مفتی تقی عثمانی": "انہیں کھولتے ہوئے چشمے سے پانی پلایا جائے گا ۔"
     },
     {
      "Aya": " ﴾‏لَّيْسَ لَهُمْ طَعَامٌ إِلَّا مِن ضَرِيعٍ ﴿٦‎",
       "ابوالاعلی مودودی ": "خار دار سوکھی گھاس کے سوا کوئی کھانا اُن کے لیے نہ ہوگا",
       "  احمد رضا خان ": "ان کے لیے کچھ کھانا نہیں مگر آگ کے کانٹے",
     "احمد علی ": "ان کے لیے کوئی کھانا سوائے کانٹے دار جھاڑی کے نہ ہوگا",
      "  جالندہری ": "اور خار دار جھاڑ کے سوا ان کے لیے کوئی کھانا نہیں (ہو گا)",
      "  طاہر القادری": "ان کے لئے خاردار خشک زہریلی جھاڑیوں کے سوا کچھ کھانا نہ ہوگا،",
     "   علامہ جوادی": "ان کے لئے کوئی کھانا سوائے خادار جھاڑی کے نہ ہوگا",
      " محمد جوناگڑھی":  "ان کے لئے سوائے کانٹے دار درختوں کے اور کچھ کھانے کو نہ ہوگا",
      " محمد حسین نجفی ": "وہاں ان کیلئے کوئی کھانا نہ ہوگا سوائے خاردار جھاڑ کے۔",
      "مفتی تقی عثمانی": "ان کے لیئے ایک کانٹے دار جھاڑ کے سوا کوئی کھانا نہیں ہوگا ۔"
     },
     {
      "Aya": "﴾‏ا يُسْمِنُ وَلَا يُغْنِي مِن جُوعٍ ﴿٧‎‏",
       "ابوالاعلی مودودی ": "جو نہ موٹا کرے نہ بھوک مٹائے",
       "  احمد رضا خان ": "کہ نہ فربہی لائیں اور نہ بھوک میں کام دیں",
     "احمد علی ": "جو نہ فربہ کرتی ہے اور نہ بھوک کود ور کرتی ہے",
      "  جالندہری ": "جو نہ فربہی لائے اور نہ بھوک میں کچھ کام آئے",
      "  طاہر القادری": "یہ کھانا نہ فربہ کرے گا اور نہ بھوک ہی دور کرے گا،",
     "   علامہ جوادی": "جو نہ موٹائی پیدا کرسکے اور نہ بھوک کے کام آسکے",
      " محمد جوناگڑھی":  "جو نہ موٹا کرے گا نہ بھوک مٹائے گا",
      " محمد حسین نجفی ": "جو نہ (انہیں) موٹا کرے گا اور نہ بھوک دور کرے گا۔",
      "مفتی تقی عثمانی": "جو نہ جسم کا وزن بڑھائے گا اور نہ بھوک مٹائے گا ۔"
     },
     {
      "Aya": "﴾‏وُجُوهٌ يَوْمَئِذٍ نَّاعِمَةٌ ﴿٨‎‏",
       "ابوالاعلی مودودی ": "کچھ چہرے اُس روز با رونق ہوں گے",
       "  احمد رضا خان ": "کتنے ہی منہ اس دن چین میں ہیں",
     "احمد علی ": "کئی منہ اس دن ہشاش بشاش ہوں گے",
      "  جالندہری ": "اور بہت سے منہ (والے) اس روز شادماں ہوں گے",
      "  طاہر القادری": "اس کے برعکس اس دن بہت سے چہرے (حسین) بارونق اور ترو تازہ ہوں گے،",
     "   علامہ جوادی": "اور کچھ چہرے تر و تازہ ہوں گے",
      " محمد جوناگڑھی":  "بہت سے چہرے اس دن تروتازه اور (آسوده حال) ہوں گے",
      " محمد حسین نجفی ": "کچھ چہرے اس دن تر و تازہ (اور با رونق) ہوں گے۔",
      "مفتی تقی عثمانی": "بہت سے چہرے اس دن تروتازہ ہوں گے ۔"
     },
     {
      "Aya": "﴾‏لِّسَعْيِهَا رَاضِيَةٌ ﴿٩‎‏ ",
       "ابوالاعلی مودودی ": "اپنی کار گزاری پر خوش ہونگے",
       "  احمد رضا خان ": "اپنی کوشش پر راضی",
     "احمد علی ": "اپنی کوشش سے خوش ہوں گے",
      "  جالندہری ": "اپنے اعمال (کی جزا) سے خوش دل",
      "  طاہر القادری": "اپنی (نیک) کاوشوں کے باعث خوش و خرم ہوں گے،",
     "   علامہ جوادی": "اپنی محنت و ریاضت سے خوش",
      " محمد جوناگڑھی":  "اپنی کوشش پر خوش ہوں گے",
      " محمد حسین نجفی ": "اپنی کاوش و کوشش پر خوش اور مطمئن ہوں گے۔",
      "مفتی تقی عثمانی": "دنیا میں  اپنی کی ہوئی محنت کی وجہ سے پوری طرح مطمئن ۔"
     },
     {
      "Aya": "﴾‏فِي جَنَّةٍ عَالِيَةٍ ﴿١٠‎‏",
       "ابوالاعلی مودودی ": "عالی مقام جنت میں ہوں گے",
       "  احمد رضا خان ": "بلند باغ میں،",
     "احمد علی ": "اونچے باغ میں ہوں گے",
      "  جالندہری ": "بہشت بریں میں",
      "  طاہر القادری": "عالی شان جنت میں (قیام پذیر) ہوں گے،",
     "   علامہ جوادی": "بلند ترین جنت میں",
      " محمد جوناگڑھی":  "بلند وباﻻ جنتوں میں ہوں گے",
      " محمد حسین نجفی ": " عالیشان جنت میں ہوں گے۔",
      "مفتی تقی عثمانی": "عالیشان جنت میں ہوں گے"
     },
     {
      "Aya":" ﴾‏ا تَسْمَعُ فِيهَا لَاغِيَةً ﴿١١‎",
       "ابوالاعلی مودودی ": "کوئی بیہودہ بات وہاں نہ سنیں گے",
       "  احمد رضا خان ": "کہ اس میں کوئی بیہودہ بات نہ سنیں گے،",
     "احمد علی ": "وہاں کوئی لغو بات نہیں سنیں گے",
      "  جالندہری ": "وہاں کسی طرح کی بکواس نہیں سنیں گے",
      "  طاہر القادری": "اس میں کوئی لغو بات نہ سنیں گے (جیسے اہلِ باطل ان سے دنیا میں کیا کرتے تھے)،",
     "   علامہ جوادی": "جہاں کوئی لغو آواز نہ سنائی دے",
      " محمد جوناگڑھی":  "جہاں کوئی بیہوده بات نہیں سنیں گے",
      " محمد حسین نجفی ": "جہاں وہ کوئی بےہودہ بات نہیں سنیں گے۔",
      "مفتی تقی عثمانی": "جس میں وہ کوئی لغو بات نہیں سنیں گے ۔"
     },
     {
      "Aya": " ﴾‏فِيهَا عَيْنٌ جَارِيَةٌ ﴿١٢‎‏",
       "ابوالاعلی مودودی ": "اُس میں چشمے رواں ہونگے",
       "  احمد رضا خان ": "اس میں رواں چشمہ ہے،",
     "احمد علی ": "وہاں ایک چشمہ جاری ہوگا",
      "  جالندہری ": "اس میں چشمے بہ رہے ہوں گے",
      "  طاہر القادری": "اس میں بہتے ہوئے چشمے ہوں گے",
     "   علامہ جوادی": "وہاں چشمے جاری ہوں گے",
      " محمد جوناگڑھی":  "جہاں بہتا ہوا چشمہ ہوگا",
      " محمد حسین نجفی ": "اس میں چشمہ رواں دواں ہوگا۔",
      "مفتی تقی عثمانی": "اس جنت میں بہتے ہوئے چشمے ہوں گے ۔"
     },
     {
      "Aya": " ﴾‏فِيهَا سُرُرٌ مَّرْفُوعَةٌ ﴿١٣‎‏",
       "ابوالاعلی مودودی ": "اُس کے اندر اونچی مسندیں ہوں گی",
       "  احمد رضا خان ": "اس میں بلند تخت ہیں،",
     "احمد علی ": "وہاں اونچے اونچے تخت ہوں گے",
      "  جالندہری ": "وہاں تخت ہوں گے اونچے بچھے ہوئے",
      "  طاہر القادری": "اس میں اونچے (بچھے ہوئے) تخت ہوں گے،",
     "   علامہ جوادی": "وہاں اونچے اونچے تخت ہوں گے",
      " محمد جوناگڑھی":  "اس میں اونچے اونچے تخت ہوں گے",
      " محمد حسین نجفی ": "اس میں اونچے اونچے تخت (بچھے ہوئے) ہوں گے۔",
      "مفتی تقی عثمانی": "اس میں اونچی اونچی نشستیں ہوں گی ۔"
     },
     {
      "Aya": " ﴾‏وَأَكْوَابٌ مَّوْضُوعَةٌ ﴿١٤ ‎‏",
       "ابوالاعلی مودودی ": "ساغر رکھے ہوئے ہوں گے",
       "  احمد رضا خان ": "اور چنے ہوئے کوزے",
     "احمد علی ": "اور آبخورے سامنے چنے ہوئے",
      "  جالندہری ": "اور آبخورے (قرینے سے) رکھے ہوئے",
      "  طاہر القادری": "اور جام (بڑے قرینے سے) رکھے ہوئے ہوں گے،",
     "   علامہ جوادی": "اور اطراف میں رکھے ہوئے پیالے ہوں گے",
      " محمد جوناگڑھی":  "اور آبخورے رکھے ہوئے (ہوں گے)",
      " محمد حسین نجفی ": "اور جام و ساغر رکھے ہوں گے۔",
      "مفتی تقی عثمانی": "اور سامنے رکھے ہوئے پیالے "
     },
     {
      "Aya": " ﴾‏وَنَمَارِقُ مَصْفُوفَةٌ ﴿١٥ ‎‏",
       "ابوالاعلی مودودی ": "گاؤ تکیوں کی قطاریں لگی ہوں گی",
       "  احمد رضا خان ": "اور برابر برابر بچھے ہوئے قالین",
     "احمد علی ": "اورگاؤ تکیے قطار سے لگے ہوئے",
      "  جالندہری ": "اور گاؤ تکیے قطار کی قطار لگے ہوئے",
      "  طاہر القادری": "اور غالیچے اور گاؤ تکیے قطار در قطار لگے ہوں گے",
     "   علامہ جوادی": "اور قطار سے لگے ہوئے گاؤ تکیے ہوں گے",
      " محمد جوناگڑھی":  "اور ایک قطار میں لگے ہوئے تکیے ہوں گے",
      " محمد حسین نجفی ": "اور گاؤ تکیے قطار در قطار لگے ہوئے ہوں گے۔",
      "مفتی تقی عثمانی": "اور قطار میں لگائے ہوئے گداز تکیے ۔"
     },
     {
      "Aya": " ﴾‏وَزَرَابِيُّ مَبْثُوثَةٌ ﴿١٦‎‏",
       "ابوالاعلی مودودی ": "اور نفیس فرش بچھے ہوئے ہوں گے",
       "  احمد رضا خان ": "اور پھیلی ہوئی چاندنیاں",
     "احمد علی ": "اور مخملی فرش بچھے ہوئے",
      "  جالندہری ": "اور نفیس مسندیں بچھی ہوئی",
      "  طاہر القادری": "اور نرم و نفیس قالین اور مَسندیں بچھی ہوں گی،",
     "   علامہ جوادی": "اور بچھی ہوئی بہترین مسندیں ہوں گی",
      " محمد جوناگڑھی":  "اور مخملی مسندیں پھیلی پڑی ہوں گی",
      " محمد حسین نجفی ": "اور طرح طرح کے نفیس فرش و فروش بچھے ہوئے ہوں گے۔",
      "مفتی تقی عثمانی": "اور بچھے ہوئے قالین ۔"
     },
     {
      "Aya": " ﴾‏أَفَلَا يَنظُرُونَ إِلَى الْإِبِلِ كَيْفَ خُلِقَتْ ﴿١٧‎‏ ",
       "ابوالاعلی مودودی ": "یہ لوگ نہیں مانتے تو کیا یہ اونٹوں کو نہیں دیکھتے کہ کیسے بنائے گئے؟",
       "  احمد رضا خان ": "تو کیا اونٹ کو نہیں دیکھتے کیسا بنایا گیا،",
     "احمد علی ": "پھر کیا وہ اونٹوں کی طرف نہیں دیکھتے کہ کیسے بنائے گئے ہیں",
      "  جالندہری ": "یہ لوگ اونٹوں کی طرف نہیں دیکھتے کہ کیسے (عجیب) پیدا کیے گئے ہیں",
      "  طاہر القادری": "منکرین تعجب کرتے ہیں کہ جنت میں یہ سب کچھ کیسے بن جائے گا! تو کیا یہ لوگ اونٹ کی طرف نہیں دیکھتے کہ وہ کس طرح (عجیب ساخت پر) بنایا گیا ہے،",
     "   علامہ جوادی": "کیا یہ لوگ اونٹ کی طرف نہیں دیکھتے ہیں کہ اسے کس طرح پیدا کیا گیا ہے",
      " محمد جوناگڑھی":  "کیا یہ اونٹوں کو نہیں دیکھتے کہ وه کس طرح پیدا کیے گئے ہیں",
      " محمد حسین نجفی ": "کیا یہ لوگ اونٹ کو (غور سے) نہیں دیکھتے کہ وہ کیونکر پیدا کیا گیا ہے؟",
      "مفتی تقی عثمانی": "تو کیا یہ لوگ اونٹوں کو نہیں دیکھتے کہ انہیں کیسے پیدا کیا گیا؟ "
     },
     {
      "Aya": " ﴾‏وَإِلَى السَّمَاءِ كَيْفَ رُفِعَتْ ﴿١٨‎‏",
       "ابوالاعلی مودودی ": "آسمان کو نہیں دیکھتے کہ کیسے اٹھایا گیا؟",
       "  احمد رضا خان ": "اور آسمان کو کیسا اونچا کیا گیا",
     "احمد علی ": "اور آسمان کی طرف کہ کیسے بلند کیے گئے ہیں",
      "  جالندہری ": "اور آسمان کی طرف کہ کیسا بلند کیا گیا ہے",
      "  طاہر القادری": "اور آسمان کی طرف (نگاہ نہیں کرتے) کہ وہ کیسے (عظیم وسعتوں کے ساتھ) اٹھایا گیا ہے،",
     "   علامہ جوادی": "اور آسمان کو کس طرح بلند کیا گیا ہے",
      " محمد جوناگڑھی":  "اور آسمان کو کہ کس طرح اونچا کیا گیا ہے",
      " محمد حسین نجفی ": "اور آسمان کی طرف نہیں دیکھتے کہ کیسے بلند کیا گیا ہے۔",
      "مفتی تقی عثمانی": "اور آسمان کو کہ اسے کس طرح بلند کیا گیا؟"
     },
     {
      "Aya": " ﴾‏وَإِلَى الْجِبَالِ كَيْفَ نُصِبَتْ ﴿١٩  ‎‏",
       "ابوالاعلی مودودی ": "پہاڑوں کو نہیں دیکھتے کہ کیسے جمائے گئے؟",
       "  احمد رضا خان ": "اور پہاڑوں کو، کیسے قائم کیے گئے،",
     "احمد علی ": "اور پہاڑوں کی طرف کہ کیسے کھڑے کیے گئے ہیں",
      "  جالندہری ": "اور پہاڑوں کی طرف کہ کس طرح کھڑے کیے گئے ہیں",
      "  طاہر القادری": "اور پہاڑوں کو (نہیں دیکھتے) کہ وہ کس طرح (زمین سے ابھار کر) کھڑے کئے گئے ہیں،",
     "   علامہ جوادی": "اور پہاڑ کو کس طرح نصب کیا گیا ہے",
      " محمد جوناگڑھی":  "اور پہاڑوں کی طرف کہ کس طرح گاڑ دیئے گئے ہیں",
      " محمد حسین نجفی ": "اور پہاڑوں کی طرف نہیں دیکھتے کہ کیونکر کھڑے کئے گئے ہیں؟",
      "مفتی تقی عثمانی": "اور پہاڑوں کو کہ انہیں کس طرح گاڑا گیا؟"
     },
     {
      "Aya": " ﴾‏وَإِلَى الْأَرْضِ كَيْفَ سُطِحَتْ ﴿٢٠‎‏",
       "ابوالاعلی مودودی ": "اور زمین کو نہیں دیکھتے کہ کیسے بچھائی گئی؟",
       "  احمد رضا خان ": "اور زمین کو، کیسے بچھائی گئی،",
     "احمد علی ": "اور زمین کی طرف کہ کیسے بچھائی گئی ہے",
      "  جالندہری ": "اور زمین کی طرف کہ کس طرح بچھائی گئی",
      "  طاہر القادری": "اور زمین کو (نہیں دیکھتے) کہ وہ کس طرح (گولائی کے باوجود) بچھائی گئی ہے،",
     "   علامہ جوادی": "اور زمین کو کس طرح بچھایا گیا ہے",
      " محمد جوناگڑھی":  "اور زمین کی طرف کہ کس طرح بچھائی گئی ہے",
      " محمد حسین نجفی ": "اور زمین کی طرف نہیں دیکھتے کہ کیسے بچھائی گئی ہے۔",
      "مفتی تقی عثمانی": "اور زمین کو کہ اسے کیسے بچھایا گیا؟"
     },
     {
      "Aya": " ﴾‏ فَذَكِّرْ إِنَّمَا أَنتَ مُذَكِّرٌ ﴿٢١‎‏ ",
       "ابوالاعلی مودودی ": "اچھا تو (اے نبیؐ) نصیحت کیے جاؤ، تم بس نصیحت ہی کرنے والے ہو",
       "  احمد رضا خان ": "تو تم نصیحت سناؤ تم تو یہی نصیحت سنانے والے ہو،",
     "احمد علی ": "پس آپ نصیحت کیجئے بے شک آپ تو نصیحت کرنے والے ہیں",
      "  جالندہری ": "تو تم نصیحت کرتے رہو کہ تم نصیحت کرنے والے ہی ہو",
      "  طاہر القادری": "پس آپ نصیحت فرماتے رہئے، آپ تو نصیحت ہی فرمانے والے ہیں،",
     "   علامہ جوادی": "لہذا تم نصیحت کرتے رہو کہ تم صرف نصیحت کرنے والے ہو",
      " محمد جوناگڑھی":  "پس آپ نصیحت کر دیا کریں (کیونکہ) آپ صرف نصیحت کرنے والے ہیں",
      " محمد حسین نجفی ": "پس(اے رسول(ص)) آپ(ص) نصیحت کیجئے (اور سمجھائیے) کہ آپ(ص) نصیحت کرنے (اور سمجھانے) والے ہیں۔",
      "مفتی تقی عثمانی": "اب ( اے پیغمبر ) تم نصیحت کیے جاؤ ۔ تم تو بس نصیحت کرنے والے ہو ۔"
     },
     {
      "Aya": " ﴾‏لَّسْتَ عَلَيْهِم بِمُصَيْطِرٍ ﴿٢٢  ‎‏",
       "ابوالاعلی مودودی ": "کچھ ان پر جبر کرنے والے نہیں ہو",
       "  احمد رضا خان ": "تم کچھ ان پر کڑ وڑا (ضامن) نہیں",
     "احمد علی ": "آپ ان پر کوئی داروغہ نہیں ہیں",
      "  جالندہری ": "تم ان پر داروغہ نہیں ہو",
      "  طاہر القادری": "آپ ان پر جابر و قاہر (کے طور پر) مسلط نہیں ہیں،",
     "   علامہ جوادی": "تم ان پر مسلط اور ان کے ذمہ دار نہیں ہو",
      " محمد جوناگڑھی":  "آپ کچھ ان پر داروغہ نہیں ہیں",
      " محمد حسین نجفی ": "آپ(ص) ان پر داروغہ نہیں ہیں۔",
      "مفتی تقی عثمانی": "آپ کو ان پر زبردستی کرنے کے لیے مسلط نہیں کیا گیا ۔ "
     },
     {
      "Aya": " ﴾‏إِلَّا مَن تَوَلَّىٰ وَكَفَرَ ﴿٢٣‎‏",
       "ابوالاعلی مودودی ": "البتہ جو شخص منہ موڑے گا اور انکار کرے گا",
       "  احمد رضا خان ": "ہاں جو منہ پھیرے اور کفر کرے",
     "احمد علی ": "مگر جس نے منہ موڑا اورانکار کیا",
      "  جالندہری ": "ہاں جس نے منہ پھیرا اور نہ مانا",
      "  طاہر القادری": "مگر جو رُوگردانی کرے اور کفر کرے،",
     "   علامہ جوادی": "مگر جو منھ پھیر لے اور کافر ہوجائے",
      " محمد جوناگڑھی":  "ہاں! جو شخص روگردانی کرے اور کفر کرے",
      " محمد حسین نجفی ": "ہاں البتہ جو شخص رُوگردانی کرے گا اور کفر کرے گا۔",
      "مفتی تقی عثمانی": "ہاں مگر جو کوئی منہ موڑے گا ، اور کفر اختیار کرے گا ۔"
     },
     {
      "Aya": " ﴾‏فَيُعَذِّبُهُ اللَّهُ الْعَذَابَ الْأَكْبَرَ ﴿٢٤‎‏",
       "ابوالاعلی مودودی ": "تو اللہ اس کو بھاری سزا دے گا",
       "  احمد رضا خان ": "تو اسے اللہ بڑا عذاب دے گا",
     "احمد علی ": "سو اسے الله بہت بڑا عذاب دے گا",
      "  جالندہری ": "تو خدا اس کو بڑا عذاب دے گا",
      "  طاہر القادری": "تو اسے اﷲ سب سے بڑا عذاب دے گا،",
     "   علامہ جوادی": "تو خدا اسے بہت بڑے عذاب میں مبتلا کرے گا",
      " محمد جوناگڑھی":  "اسے اللہ تعالیٰ بہت بڑا عذاب دے گا",
      " محمد حسین نجفی ": "تو اللہ اس کو بڑا عذاب دے گا۔",
      "مفتی تقی عثمانی": "تو اللہ اس کو بڑا زبردست عذاب دے گا ۔"
     },
     {
      "Aya": " ﴾‏إِنَّ إِلَيْنَا إِيَابَهُمْ ﴿٢٥‎‏",
       "ابوالاعلی مودودی ": "اِن لوگوں کو پلٹنا ہماری طرف ہی ہے",
       "  احمد رضا خان ": "بیشک ہماری ہی طرف ان کا پھرنا",
     "احمد علی ": "بےشک ہماری طرف ہی ان کو لوٹ کر آنا ہے",
      "  جالندہری ": "بےشک ان کو ہمارے پاس لوٹ کر آنا ہے",
      "  طاہر القادری": "بیشک (بالآخر) ہماری ہی طرف ان کا پلٹنا ہے،",
     "   علامہ جوادی": "پھر ہماری ہی طرف ان سب کی بازگشت ہے",
      " محمد جوناگڑھی":  "بیشک ہماری طرف ان کا لوٹنا ہے",
      " محمد حسین نجفی ": "یقیناً ان کی بازگشت ہماری طرف ہے۔",
      "مفتی تقی عثمانی": "یقین جانو ان سب کو ہمارے پاس ہی لوٹ کر آنا ہے ۔"
     },
     {
      "Aya": " ﴾‏ثُمَّ إِنَّ عَلَيْنَا حِسَابَهُم﴿٢٦‏",
       "ابوالاعلی مودودی ": "پھر اِن کا حساب لینا ہمارے ہی ذمہ ہے",
       "  احمد رضا خان ": "پھر بیشک ہماری ہی طرف ان کا حساب ہے،",
     "احمد علی ": "پھر ہمارےہی ذمہ ان کا حساب لینا ہے",
      "  جالندہری ": "پھر ہم ہی کو ان سے حساب لینا ہے",
      "  طاہر القادری": "پھر یقیناً ہمارے ہی ذمہ ان کا حساب (لینا) ہے،",
     "   علامہ جوادی": "اور ہمارے ہی ذمہ ان سب کا حساب ہے",
      " محمد جوناگڑھی":  "پھر بیشک ہمارے ذمہ ہے ان سے حساب لینا",
      " محمد حسین نجفی ": "پھر بیشک ان کا حساب کتاب ہمارے ذمہ ہے۔",
      "مفتی تقی عثمانی": "پھر یقینا ان کا حساب لینا ہمارے ذمے ہے ۔"
     }
    ]
 