[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
       "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
       " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى ﴿١‎‏",
     "ابوالاعلی مودودی ": "اے نبیؐ اپنے رب برتر کے نام کی تسبیح کرو",
       "  احمد رضا خان ":  "اپنے رب کے نام کی پاکی بولو جب سے بلند ہے",
      "احمد علی ": "اپنے رب کے نام کی تسبیح کیا کر جو سب سے اعلیٰ ہے",
     "  جالندہری ": "اے پیغمبر اپنے پروردگار جلیل الشان کے نام کی تسبیح کرو",
      "  طاہر القادری": "اپنے رب کے نام کی تسبیح کریں جو سب سے بلند ہے،",
       "   علامہ جوادی": "اپنے بلند ترین رب کے نام کی تسبیح کرو",
      " محمد جوناگڑھی": "اپنے بہت ہی بلند اللہ کے نام کی پاکیزگی بیان کر",
       " محمد حسین نجفی ": "اے نبی(ص) اپنے بلند و برتر پروردگار کے نام کی تسبیح کیجئے۔",
      "مفتی تقی عثمانی": "اپنے پروردگار کے نام کی تسبیح کرو جس کی شان سب سے اونچی ہے ۔"
     },
     {
      "Aya": "﴾‏الَّذِي خَلَقَ فَسَوَّىٰ ﴿٢‎",
     "ابوالاعلی مودودی ": "جس نے پیدا کیا اور تناسب قائم کیا",
       "  احمد رضا خان ":  "جس نے بناکر ٹھیک کیا",
      "احمد علی ": "وہ جس نے پیدا کیا پھر ٹھیک بنایا",
     "  جالندہری ": "جس نے (انسان کو) بنایا پھر (اس کے اعضاء کو) درست کیا",
      "  طاہر القادری": "جس نے (کائنات کی ہر چیز کو) پیدا کیا پھر اسے (جملہ تقاضوں کی تکمیل کے ساتھ) درست توازن دیا،",
       "   علامہ جوادی": "جس نے پیدا کیا ہے اور درست بنایا ہے",
      " محمد جوناگڑھی": "جس نے پیدا کیا اور صحیح سالم بنایا",
       " محمد حسین نجفی ": "جس نے (ہر چیزکو) پیدا کیا پھر درست کیا (تناسب قائم کیا)۔",
      "مفتی تقی عثمانی": "جس نے سب کچھ پیدا کیا اور ٹھیک ٹھیک بنایا ۔"
     },
     {
      "Aya": "﴾‏وَالَّذِي قَدَّرَ فَهَدَىٰ ﴿٣‎‏ ",
     "ابوالاعلی مودودی ": "جس نے تقدیر بنائی پھر راہ دکھائی",
       "  احمد رضا خان ":  "اور جس نے اندازہ پر رکھ کر راہ دی",
      "احمد علی ": "اور جس نے اندازہ ٹھہرایا پھر راہ دکھائی",
     "  جالندہری ": "اور جس نے (اس کا) اندازہ ٹہرایا (پھر اس کو) رستہ بتایا",
      "  طاہر القادری": "اور جس نے (ہر ہر چیز کے لئے) قانون مقرر کیا پھر (اسے اپنے اپنے نظام کے مطابق رہنے اور چلنے کا) راستہ بتایا،",
       "   علامہ جوادی": "جس نے تقدیر معین کی ہے اور پھر ہدایت دی ہے",
      " محمد جوناگڑھی": "اور جس نے (ٹھیک ٹھاک) اندازه کیا اور پھر راه دکھائی",
       " محمد حسین نجفی ": "جس نے تقدیر مقرر کی (ہر چیز کا اندازہ مقرر کیا) اور (سیدھی) راہ دکھائی۔",
      "مفتی تقی عثمانی": "اور جس نے ہر چیز کو ایک خاص انداز دیا ، پھر راستہ بتایا "
     },
     {
      "Aya": "﴾‏وَالَّذِي أَخْرَجَ الْمَرْعَىٰ ﴿٤",
     "ابوالاعلی مودودی ": "جس نے نباتات اگائیں",
       "  احمد رضا خان ":  "اور جس نے چارہ نکالا،",
      "احمد علی ": "اور وہ جس نے چارہ نکالا",
     "  جالندہری ": "اور جس نے چارہ اگایا",
      "  طاہر القادری": "اور جس نے (زمین سے) چارہ نکالا،",
       "   علامہ جوادی": "جس نے چارہ بنایا ہے",
      " محمد جوناگڑھی": "اور جس نے تازه گھاس پیدا کی",
       " محمد حسین نجفی ": "اس نے (جانوروں کیلئے) زمین سے چارہ نکالا۔",
      "مفتی تقی عثمانی": "اور جس نے سبز چارہ ( زمین سے ) نکالا ۔"
     },
     {
      "Aya": " ﴾‏فَجَعَلَهُ غُثَاءً أَحْوَىٰ ﴿٥  ‎‏ ",
     "ابوالاعلی مودودی ": "پھر اُن کو سیاہ کوڑا کرکٹ بنا دیا",
       "  احمد رضا خان ":  "پھر اسے خشک سیاہ کردیا،",
      "احمد علی ": "پھر اس کو خشک چورا سیاہ کر دیا",
     "  جالندہری ": "پھر اس کو سیاہ رنگ کا کوڑا کر دیا",
      "  طاہر القادری": "پھر اسے سیاہی مائل خشک کردیا،",
       "   علامہ جوادی": "پھر اسے خشک کرکے سیاہ رنگ کا کوڑا بنادیاہے",
      " محمد جوناگڑھی": "پھر اس نے اس کو (سکھا کر) سیاه کوڑا کر دیا",
       " محمد حسین نجفی ": "پھر اسے (خشک کرکے) سیاہی مائل کوڑا بنا دیا۔",
      "مفتی تقی عثمانی": "پھر اسے کالے رنگ کا کوڑا بنا دیا ۔"
     },
     {
      "Aya": "﴾‏سَنُقْرِئُكَ فَلَا تَنسَىٰ ﴿٦‎‏",
     "ابوالاعلی مودودی ": "ہم تمہیں پڑھوا دیں گے، پھر تم نہیں بھولو گے",
       "  احمد رضا خان ":  "اب ہم تمہیں پڑھائیں گے کہ تم نہ بھولو گے",
      "احمد علی ": "البتہ ہم آپ کو پڑھائیں گے پھر آپ نہ بھولیں گے",
     "  جالندہری ": "ہم تمہیں پڑھا دیں گے کہ تم فراموش نہ کرو گے",
      "  طاہر القادری": "اے حبیبِ مکرّم! ہم آپ کو خود (ایسا) پڑھائیں گے کہ آپ (کبھی) نہیں بھولیں گے،",
       "   علامہ جوادی": "ہم عنقریب تمہیں اس طرح پڑھائیں گے کہ بھول نہ سکوگے",
      " محمد جوناگڑھی": "ہم تجھے پڑھائیں گے پھر تو نہ بھولے گا",
       " محمد حسین نجفی ": "ہم آپ(ص) کو (ایسا) پڑھائیں گے کہ پھر آپ(ص) نہیں بھولیں گے۔",
      "مفتی تقی عثمانی": " اے پیغمبر  ہم تمہیں پڑھائیں گے پھر تم بھولو گے نہیں ۔"
     },
     {
      "Aya": "﴾‏إِلَّا مَا شَاءَ اللَّهُ ۚ إِنَّهُ يَعْلَمُ الْجَهْرَ وَمَا يَخْفَىٰ ﴿٧‎‏ ",
     "ابوالاعلی مودودی ": "سوائے اُس کے جو اللہ چاہے، وہ ظاہر کو بھی جانتا ہے اور جو کچھ پوشیدہ ہے اُس کو بھی",
       "  احمد رضا خان ":  "مگر جو اللہ چاہے بیشک وہ جانتا ہے ہر کھلے اور چھپے کو،",
      "احمد علی ": "مگر جو الله چاہے بے شک وہ ہرظاہر اور چھپی بات کو جانتا ہے",
     "  جالندہری ": "مگر جو خدا چاہے۔ وہ کھلی بات کو بھی جانتا ہے اور چھپی کو بھی",
      "  طاہر القادری": "مگر جو اﷲ چاہے، بیشک وہ جہر اور خفی (یعنی ظاہر و پوشیدہ اور بلند و آہستہ) سب باتوں کو جانتا ہے،",
       "   علامہ جوادی": "مگر یہ کہ خدا ہی چاہے کہ وہ ہر ظاہر اور مخفی رہنے والی چیز کو جانتا ہے",
      " محمد جوناگڑھی": "مگر جو کچھ اللہ چاہے۔ وه ﻇاہر اور پوشیده کو جانتا ہے",
       " محمد حسین نجفی ": "مگر جو اللہ چاہے (بھلا دے) بےشک وہ ظاہر کو بھی جانتا ہے اور اس کو بھی جو چھپا ہوا ہے۔",
      "مفتی تقی عثمانی": "سوائے اس کے جسے اللہ چاہے  یقین رکھو وہ کھلی ہوئی چیزوں کو بھی جانتا ہے اور ان چیزوں کو بھی جو چھپی ہوئی ہیں ۔"
     },
     {
      "Aya": "﴾‏وَنُيَسِّرُكَ لِلْيُسْرَىٰ ﴿٨‎‏",
     "ابوالاعلی مودودی ": "اور ہم تمہیں آسان طریقے کی سہولت دیتے ہیں",
       "  احمد رضا خان ":  "اور ہم تمہارے لیے آسانی کا سامان کردیں گے",
      "احمد علی ": "اور ہم آپ کو آسان شریعت کے سمجھنے کی توفیق دیں گے",
     "  جالندہری ": "ہم تم کو آسان طریقے کی توفیق دیں گے",
      "  طاہر القادری": "اور ہم آپ کو اس آسان (شریعت پر عمل پیرا ہونے) کے لئے (بھی) سہولت فراہم فرمائیں گے،",
       "   علامہ جوادی": "اور ہم تم کو آسان راستہ کی توفیق دیں گے",
      " محمد جوناگڑھی": "ہم آپ کے لئے آسانی پیدا کر دیں گے",
       " محمد حسین نجفی ": "اور ہم آپ(ص) کو آسان (شریعت) کی سہولت دیں گے۔",
      "مفتی تقی عثمانی": "اور ہم تمہیں آسان شریعت ( پر چلنے کے لیے ) سہولت دیں گے"
     },
     {
      "Aya": "﴾‏فَذَكِّرْ إِن نَّفَعَتِ الذِّكْرَىٰ ﴿٩‎‏ ",
     "ابوالاعلی مودودی ": "لہٰذا تم نصیحت کرو اگر نصیحت نافع ہو",
       "  احمد رضا خان ":  "تو تم نصیحت فرماؤ اگر نصیحت کام دے",
      "احمد علی ": "پس آپ نصیحت کیجیئے اگر نصیحت فائدہ دے",
     "  جالندہری ": "سو جہاں تک نصیحت (کے) نافع (ہونے کی امید) ہو نصیحت کرتے رہو",
      "  طاہر القادری": "پس آپ نصیحت فرماتے رہیے بشرطیکہ نصیحت (سننے والوں کو) فائدہ دے",
       "   علامہ جوادی": "لہذا لوگوں کوسمجھاؤ اگر سمجھانے کا فائدہ ہو",
      " محمد جوناگڑھی": "تو آپ نصیحت کرتے رہیں اگر نصیحت کچھ فائده دے",
       " محمد حسین نجفی ": "پس آپ(ص) نصیحت کیجئے اگر نصیحت کچھ فائدہ پہنچائے۔",
      "مفتی تقی عثمانی": "لہذا تم نصیحت کیے جاؤ ، اگر نصیحت کا فائدہ ہو ۔"
     },
     {
      "Aya": " ﴾‏سَيَذَّكَّرُ مَن يَخْشَىٰ ﴿١٠   ‎‏",
     "ابوالاعلی مودودی ": "جو شخص ڈرتا ہے وہ نصیحت قبول کر لے گا",
       "  احمد رضا خان ":  "عنقریب نصیحت مانے گا جو ڈرتا ہے",
      "احمد علی ": "جو الله سے ڈرتا ہے وہ جلدی سمجھ جائے گا",
     "  جالندہری ": "جو خوف رکھتا ہے وہ تو نصیحت پکڑے گا",
      "  طاہر القادری": "البتہ وہی نصیحت قبول کرے گا جو اﷲ سے ڈرتا ہوگا،",
       "   علامہ جوادی": "عنقریب خوف خدا رکھنے والا سمجھ جائے گا",
      " محمد جوناگڑھی": "ڈرنے واﻻ تو نصیحت لے گا",
       " محمد حسین نجفی ": "وہ شخص نصیحت قبول کرے گا جو (خدا و آخرت سے) ڈرتا ہوگا۔",
      "مفتی تقی عثمانی": "جس کے دل میں اللہ کا خوف ہوگا ، وہ نصیحت مانے گا ۔"
     },
     {
      "Aya": " ﴾‏وَيَتَجَنَّبُهَا الْأَشْقَى ﴿ ١١   ‎‏",
     "ابوالاعلی مودودی ": "اور اس سے گریز کریگا وہ انتہائی بد بخت",
       "  احمد رضا خان ":  "اور اس سے وہ بڑا بدبخت دور رہے گا،",
      "احمد علی ": "اور اس سے بڑا بدنصیب الگ رہے گا",
     "  جالندہری ": "اور (بےخوف) بدبخت پہلو تہی کرے گا",
      "  طاہر القادری": "اور بدبخت اس (نصیحت) سے پہلو تہی کرے گا،",
       "   علامہ جوادی": "اور بدبخت اس سے کنارہ کشی کرے گا",
      " محمد جوناگڑھی": "بد بخت اس سے گریز کرے گا",
       " محمد حسین نجفی ": "اور جو بدبخت ہے وہ اس سے گریز کرے گا۔",
      "مفتی تقی عثمانی": "اور اس سے دور وہ رہے گا جو بڑا بدبخت ہوگا ۔"
     },
     {
      "Aya":  " ﴾‏الَّذِي يَصْلَى النَّارَ الْكُبْرَىٰ ﴿١٢ ‎",
     "ابوالاعلی مودودی ": "جو بڑی آگ میں جائے گا",
       "  احمد رضا خان ":  "جو سب سے بڑی آگ میں جائے گا",
      "احمد علی ": "جو سخت آگ میں داخل ہوگا",
     "  جالندہری ": "جو (قیامت کو) بڑی (تیز) آگ میں داخل ہو گا",
      "  طاہر القادری": "جو (قیامت کے دن) سب سے بڑی آگ میں داخل ہوگا،",
       "   علامہ جوادی": "جو بہت بڑی آگ میں جلنے والا ہے",
      " محمد جوناگڑھی": "جو بڑی آگ میں جائے گا",
       " محمد حسین نجفی ": "جو بڑی آگ میں داخل ہوگا۔",
      "مفتی تقی عثمانی": "جو سب سے بڑی آگ میں داخل ہوگا ۔"
     },
     {
      "Aya": "﴾‏ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ ﴿١٣‎",
     "ابوالاعلی مودودی ": "پھر نہ اس میں مرے گا نہ جیے گا",
       "  احمد رضا خان ":  "پھر نہ اس میں مرے اور نہ جیے",
      "احمد علی ": "پھر اس میں نہ تو مرے گا اور نہ جیئے گا",
     "  جالندہری ": "پھر وہاں نہ مرے گا اور نہ جئے گا",
      "  طاہر القادری": "پھر وہ اس میں نہ مرے گا اور نہ جیئے گا،",
       "   علامہ جوادی": "پھر نہ اس میں زندگی ہے نہ موت",
      " محمد جوناگڑھی": "جہاں پھر نہ وه مرے گا نہ جیے گا، (بلکہ حالت نزع میں پڑا رہے گا)",
       " محمد حسین نجفی ": "پھر وہ اس میں نہ مرے گا نہ جئے گا۔",
      "مفتی تقی عثمانی": "پھر اس آگ میں نہ مرے گا اور نہ جیے گا "
     },
     {
      "Aya": "﴾‏قَدْ أَفْلَحَ مَن تَزَكَّىٰ ﴿١٤‎‏ ",
     "ابوالاعلی مودودی ": "فلاح پا گیا وہ جس نے پاکیزگی اختیار کی",
       "  احمد رضا خان ":  "بیشک مراد کو پہنچا جو ستھرا ہوا",
      "احمد علی ": "بے شک وہ کامیاب ہوا جو پاک ہو گیا",
     "  جالندہری ": "بے شک وہ مراد کو پہنچ گیا جو پاک ہوا",
      "  طاہر القادری": "بیشک وہی بامراد ہوا جو (نفس کی آفتوں اور گناہ کی آلودگیوں سے) پاک ہوگیا،",
       "   علامہ جوادی": "بے شک پاکیزہ رہنے والا کامیاب ہوگیا",
      " محمد جوناگڑھی": "بیشک اس نے فلاح پالی جو پاک ہوگیا",
       " محمد حسین نجفی ": "وہ شخص فائز المرام ہوا جس نے اپنے آپ کو (بداعتقادی و بدعملی سے) پاک کیا۔",
      "مفتی تقی عثمانی": "فلاح اس نے پائی ہے جس نے پاکیزگی اختیار کی ۔"
     },
     {
      "Aya": " ﴾‏وَذَكَرَ اسْمَ رَبِّهِ فَصَلَّىٰ ﴿١٥ ‎‏",
     "ابوالاعلی مودودی ": "اور اپنے رب کا نام یاد کیا پھر نماز پڑھی",
       "  احمد رضا خان ":  "اور اپنے رب کا نام لے کر نماز پڑھی",
      "احمد علی ": "اور اپنے رب کا نام یاد کیا پھر نماز پڑھی",
     "  جالندہری ": "اور اپنے پروردگار کے نام کا ذکر کرتا رہا اور نماز پڑھتا رہا",
      "  طاہر القادری": "اور وہ اپنے رب کے نام کا ذکر کرتا رہا اور (کثرت و پابندی سے) نماز پڑھتا رہا،",
       "   علامہ جوادی": "جس نے اپنے رب کے نام کی تسبیح کی اور پھر نماز پڑھی",
      " محمد جوناگڑھی": "اور جس نے اپنے رب کا نام یاد رکھا اور نماز پڑھتا رہا",
       " محمد حسین نجفی ": "اور اپنے پروردگار کا نام یاد کیا اور نماز پڑھی۔",
      "مفتی تقی عثمانی": "اور اپنے پروردگار کا نام لیا ، اور نماز پڑھی "
     },
     {
      "Aya": " ﴾‏بَلْ تُؤْثِرُونَ الْحَيَاةَ الدُّنْيَا ﴿١٦ ‎‏ ",
     "ابوالاعلی مودودی ": "مگر تم لوگ دنیا کی زندگی کو ترجیح دیتے ہو",
       "  احمد رضا خان ":  "بلکہ تم جیتی دنیا کو ترجیح دیتے ہو",
      "احمد علی ": "بلکہ تم تودنیا کی زندگی کو ترجیح دیتے ہو",
     "  جالندہری ": "مگر تم لوگ تو دنیا کی زندگی کو اختیار کرتے ہو",
      "  طاہر القادری": "بلکہ تم (اﷲ کی طرف رجوع کرنے کی بجائے) دنیاوی زندگی (کی لذتوں) کو اختیار کرتے ہو،",
       "   علامہ جوادی": "لیکن تم لوگ زندگانی دنیا کو مقدم رکھتے ہو",
      " محمد جوناگڑھی": "لیکن تم تو دنیا کی زندگی کو ترجیح دیتے ہو",
       " محمد حسین نجفی ": "مگر تم لوگ دنیا کی زندگی کو (آخرت پر) ترجیح دیتے ہو",
      "مفتی تقی عثمانی": "لیکن تم لوگ دنیوی زندگی کو مقدم رکھتے ہو "
     },
     {
      "Aya": " ﴾‏وَالْآخِرَةُ خَيْرٌ وَأَبْقَىٰ ﴿١٧‎‏",
     "ابوالاعلی مودودی ": "حالانکہ آخرت بہتر ہے اور باقی رہنے والی ہے",
       "  احمد رضا خان ":  "اور آخرت بہتر اور باقی رہنے والی،",
      "احمد علی ": "حالانکہ آخرت بہتر اور زیادہ پائدار ہے",
     "  جالندہری ": "حالانکہ آخرت بہت بہتر اور پائندہ تر ہے",
      "  طاہر القادری": "حالانکہ آخرت (کی لذت و راحت) بہتر اور ہمیشہ باقی رہنے والی ہے،",
       "   علامہ جوادی": "جب کہ آخرت بہتر اور ہمیشہ رہنے والی ہے",
      " محمد جوناگڑھی": "اور آخرت بہت بہتر اور بہت بقا والی ہے",
       " محمد حسین نجفی ": "حالانکہ آخرت بہتر ہے اور پائیدار ہے۔",
      "مفتی تقی عثمانی": "حالانکہ آخرت کہیں زیادہ بہتر اور کہیں زیادہ پائیدار ہے ۔"
     },
     {
      "Aya": " ﴾‏إِنَّ هَٰذَا لَفِي الصُّحُفِ الْأُولَىٰ ﴿١٨  ‎",
     "ابوالاعلی مودودی ": "یہی بات پہلے آئے ہوئے صحیفوں میں بھی کہی گئی تھی",
       "  احمد رضا خان ":  "بیشک یہ اگلے صحیفوں میں ہے",
      "احمد علی ": "بے شک یہی پہلے صحیفوں میں ہے",
     "  جالندہری ": "یہ بات پہلے صحیفوں میں (مرقوم) ہے",
      "  طاہر القادری": "بیشک یہ (تعلیم) اگلے صحیفوں میں (بھی مذکور) ہے،",
       "   علامہ جوادی": "یہ بات تمام پہلے صحیفوں میں بھی موجود ہے",
      " محمد جوناگڑھی": "یہ باتیں پہلی کتابوں میں بھی ہیں",
       " محمد حسین نجفی ": "یقیناً یہ بات پہلے صحیفوں میں بھی ہے۔",
      "مفتی تقی عثمانی": "یہ بات یقینا پچھلے ( آسمانی ) صحیفوں میں بھی درج ہے ۔"
     },
     {
      "Aya": " ﴾‏صُحُفِ إِبْرَاهِيمَ وَمُوسَىٰ ﴿١٩  ‎‏",
     "ابوالاعلی مودودی ": "ابراہیمؑ اور موسیٰؑ کے صحیفوں میں",
       "  احمد رضا خان ":  "ابراہیم اور موسیٰ کے صحیفوں میں،",
      "احمد علی ": " ابراھیم اور موسیٰ کے صحیفوں میں",
     "  جالندہری ": "ابراہیم اور موسیٰ کے صحیفوں میں",
      "  طاہر القادری": " ابراہیم اور موسٰی (علیہما السلام) کے صحائف ہیں،",
       "   علامہ جوادی": "ابراہیم علیہ السّلام کے صحیفوں میں بھی اور موسٰی علیہ السّلام کے صحیفوں میں بھی",
      " محمد جوناگڑھی": "ابراہیم اور موسیٰ کی کتابوں میں",
       " محمد حسین نجفی ": "یعنی ابراہیم(ع) اور موسیٰ(ع) کے صحیفوں میں۔",
      "مفتی تقی عثمانی": "ابراہیم اور موسیٰ کے صحیفوں میں ۔"
     }
    ]