[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ":"شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":"عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾إِذَا السَّمَاءُ انشَقَّتْ ﴿١‎",
      "ابوالاعلی مودودی ": "جب آسمان پھٹ جائے گا",
       "  احمد رضا خان ": "جب آسمان شق ہو",
      "احمد علی ": "جب آسمان پھٹ جائے گا",
      "  جالندہری ":"جب آسمان پھٹ جائے گا",
      "  طاہر القادری": "جب (سب) آسمانی کرّے پھٹ جائیں گے",
      "   علامہ جوادی":"جب آسمان پھٹ جائے گا",
      " محمد جوناگڑھی": "جب آسمان پھٹ جائے گا",
      " محمد حسین نجفی ": "اور جب آسمان پھٹ جائے گا۔",
      "مفتی تقی عثمانی": "جب آسمان پھٹ پڑے گا ۔"
     },
     {
      "Aya": "﴾وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ﴿٢‎",
      "ابوالاعلی مودودی ": "اور اپنے رب کے فرمان کی تعمیل کرے گا اور اُس کے لیے حق یہی ہے (کہ اپنے رب کا حکم مانے)",
       "  احمد رضا خان ": "اور اپنے رب کا حکم سنے اور اسے سزاوار ہی یہ ہے،",
      "احمد علی ": "اور اپنے رب کا حکم سن لے گا اور وہ اسی لائق ہے",
      "  جالندہری ":"اور اپنے پروردگار کا فرمان بجا لائے گا اور اسے واجب بھی یہ ہی ہے",
      "  طاہر القادری": "اور اپنے رب کا حکمِ (اِنشقاق) بجا لائیں گے اور (یہی تعمیلِ اَمر) اُس کے لائق ہے،",
      "   علامہ جوادی":"اور اپنے پروردگار کا حکم بجا لائے گا اور یہ ضروری بھی ہے",
      " محمد جوناگڑھی": "اور اپنے رب کے حکم پر کان لگائے گا اور اسی کے ﻻئق وه ہے",
      " محمد حسین نجفی ": "اور وہ اپنے پروردگار کا حکم سن لے گا (اور اس کی تعمیل کرے گا) اور اس پر لازم بھی یہی ہے۔",
      "مفتی تقی عثمانی": "اور وہ اپنے پروردگار کا حکم سن کر مان لے گا ، اور اس پر لازم ہےکہ یہی کرے ۔"
     },
     {
      "Aya": " ﴾وَإِذَا الْأَرْضُ مُدَّتْ ﴿٣  ‎‏",
      "ابوالاعلی مودودی ": "اور جب زمین پھیلا دی جائے گی",
       "  احمد رضا خان ": "اور جب زمین دراز کی جائے",
      "احمد علی ": "اور جب زمین پھیلا دی جائے گی",
      "  جالندہری ":"اور جب زمین ہموار کر دی جائے گی",
      "  طاہر القادری": "اور جب زمین (ریزہ ریزہ کر کے) پھیلا دی جائے گی،",
      "   علامہ جوادی":"اور جب زمین برابر کرکے پھیلا دی جائے گی",
      " محمد جوناگڑھی": "اور جب زمین (کھینچ کر) پھیلا دی جائے گی",
      " محمد حسین نجفی ": "اور جب زمین پھیلا دی جائے گی",
      "مفتی تقی عثمانی": "اور جب زمین کو کھینچ دیا جائے گا"
     },
     {
      "Aya": "﴾وَأَلْقَتْ مَا فِيهَا وَتَخَلَّتْ ﴿٤‎",
      "ابوالاعلی مودودی ": "اور جو کچھ اس کے اندر ہے اُسے باہر پھینک کر خالی ہو جائے گی",
       "  احمد رضا خان ": "اور جو کچھ اس میں ہے ڈال دے اور خالی ہوجائے،",
      "احمد علی ": "اور جو کچھ اس میں ہے ڈال دے گی اور خالی ہو جائے گی",
      "  جالندہری ":"جو کچھ اس میں ہے اسے نکال کر باہر ڈال دے گی اور (بالکل) خالی ہو جائے گی",
      "  طاہر القادری": "اور جو کچھ اس کے اندر ہے وہ اسے نکال باہر پھینکے گی اور خالی ہو جائے گی،",
      "   علامہ جوادی":"اور وہ اپنے ذخیرے پھینک کر خالی ہوجائے گی",
      " محمد جوناگڑھی": "اور اس میں جو ہے اسے وه اگل دے گی اور خالی ہو جائے گی",
      " محمد حسین نجفی ": "اور جو کچھ اس کے اندر ہے وہ اسے باہر پھینک دے گی اور خالی ہو جائے گی۔",
      "مفتی تقی عثمانی": "اور اس کے ا ندر جو کچھ ہے وہ اسے باہر پھینک دے گی اور خالی ہوجائے گی"
     },
     {
      "Aya": "  ﴾وَأَذِنَتْ لِرَبِّهَا وَحُقَّتْ ﴿٥    ‏",
      "ابوالاعلی مودودی ": "اور اپنے رب کے حکم کی تعمیل کرے گی اور اُس کے لیے حق یہی ہے (کہ اس کی تعمیل کرے)",
       "  احمد رضا خان ": "اور اپنے رب کا حکم سنے اور اسے سزاوار ہی یہ ہے",
      "احمد علی ": "اور اپنے رب کا حکم سن لے گی اور وہ اسی لائق ہے",
      "  جالندہری ":"اور اپنے پروردگار کے ارشاد کی تعمیل کرے گی اور اس کو لازم بھی یہی ہے (تو قیامت قائم ہو جائے گی)",
      "  طاہر القادری": "اور (وہ بھی) اپنے رب کا حکمِ (اِنشقاق) بجا لائے گی اور (یہی اِطاعت) اُس کے لائق ہے",
      "   علامہ جوادی":"اور اپنے پروردگار کا حکم بجا لائے گی اور یہ ضروری بھی ہے",
      " محمد جوناگڑھی": "اور اپنے رب کے حکم پر کان لگائے گی اور اسی کے ﻻئق وه ہے",
      " محمد حسین نجفی ": "اور اپنے پروردگار کا حکم سنے گی اور (اس کی تعمیل کرے گی) اور اس پر لازم بھی یہی ہے",
      "مفتی تقی عثمانی": "اور وہ اپنے پروردگار کا حکم سن کر مان لے گی ، اور اس پر لازم ہے کہ یہی کرے ( اس وقت انسان کو اپنا انجام معلوم ہوجائے گا )"
     },
     {
      "Aya": "﴾يَا أَيُّهَا الْإِنسَانُ إِنَّكَ كَادِحٌ إِلَىٰ رَبِّكَ كَدْحًا فَمُلَاقِيهِ ﴿٦‎‏",
      "ابوالاعلی مودودی ": "اے انسان، تو کشاں کشاں اپنے رب کی طرف چلا جا رہا ہے، اور اُس سے ملنے والا ہے",
       "  احمد رضا خان ": "اے آدمی! بیشک تجھے اپنے رب کی طرف ضرور دوڑنا ہے پھر اس سے ملنا",
      "احمد علی ": "اے انسان تو اپنے رب کے پاس پہنچنے تک کام میں کوشش کر رہا ہے پھر اس سے جا ملے گا",
      "  جالندہری ":"اے انسان! تو اپنے پروردگار کی طرف (پہنچنے میں) خوب کوشِش کرتا ہے سو اس سے جا ملے گا",
      "  طاہر القادری": "اے انسان! تو اپنے رب تک پہنچنے میں سخت مشقتیں برداشت کرتا ہے بالآخر تجھے اسی سے جا ملنا ہے،",
      "   علامہ جوادی":"اے انسان تو اپنے پروردگار کی طرف جانے کی کوشش کررہا ہے تو ایک دن اس کا سامنا کرے گا",
      " محمد جوناگڑھی": "اے انسان! تو اپنے رب سے ملنے تک یہ کوشش اور تمام کام اور محنتیں کرکے اس سے ملاقات کرنے واﻻ ہے",
      " محمد حسین نجفی ": "اے انسان! تو کشاں کشاں اپنے پروردگار کی طرف (کھنچا چلا) جا رہا ہے اور اس کی بارگاہ میں حاضر ہو نے والا ہے۔",
      "مفتی تقی عثمانی": "اے انسان ! تو اپنے پروردگار کے پاس پہنچنے تک مسلسل کسی محنت میں لگا رہے گا ، یہاں تک کہ اس سے جا ملے گا ۔"
     },
     {
      "Aya": "﴾فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ ﴿٧‎‏",
      "ابوالاعلی مودودی ": "پھر جس کا نامہ اعمال اُس کے سیدھے ہاتھ میں دیا گیا",
       "  احمد رضا خان ": "تو وہ وہ اپنا نامہٴ اعمال دہنے ہاتھ میں دیا جائے",
      "احمد علی ": "پھر جس کا اعمال نامہ اس کے دائیں ہاتھ میں دیا گیا",
      "  جالندہری ":"تو جس کا نامہٴ (اعمال) اس کے داہنے ہاتھ میں دیا جائے گا",
      "  طاہر القادری": "پس جس شخص کا نامۂ اعمال اس کے داہنے ہاتھ میں دیا جائے گا،",
      "   علامہ جوادی":"پھر جس کو نامہ اعمال داہنے ہاتھ میں دیا جائے گا",
      " محمد جوناگڑھی": "تو (اس وقت) جس شخص کے داہنے ہاتھ میں اعمال نامہ دیا جائے گا",
      " محمد حسین نجفی ": "پس جس کا نامۂ اعمال اس کے دائیں ہاتھ میں دیا جائے گا۔",
      "مفتی تقی عثمانی": "پھر جس شخص کو اس کا اعمال نامہ اس کے دائیں ہاتھ میں دیا جائے گا"
     },
     {
      "Aya": "﴾فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا ﴿٨ ‎‎",
      "ابوالاعلی مودودی ": "اُس سے ہلکا حساب لیا جائے گا",
       "  احمد رضا خان ": "اس سے عنقریب سہل حساب لیا جائے گا",
      "احمد علی ": "تو اس سے آسانی کے ساتھ حساب لیا جائے گا",
      "  جالندہری ":"اس سے حساب آسان لیا جائے گا",
      "  طاہر القادری": "تو عنقریب اس سے آسان سا حساب لیا جائے گا،",
      "   علامہ جوادی":"اس کا حساب آسان ہوگا",
      " محمد جوناگڑھی": "اس کا حساب تو بڑی آسانی سے لیا جائے گا",
      " محمد حسین نجفی ": "و اس سے آسان حساب لیا جائے گا۔",
      "مفتی تقی عثمانی": "اس سے تو آسان حساب لیا جائے گا ۔"
     },
     {
      "Aya": "﴾وَيَنقَلِبُ إِلَىٰ أَهْلِهِ مَسْرُورًا ﴿٩‎",
      "ابوالاعلی مودودی ": "اور وہ اپنے لوگوں کی طرف خوش خوش پلٹے گا",
       "  احمد رضا خان ": "اور اپنے گھر والوں کی طرف شاد شاد پلٹے گا",
      "احمد علی ": "اور وہ اپنے اہل و عیال میں خوش واپس آئے گا",
      "  جالندہری ":"اور وہ اپنے گھر والوں میں خوش خوش آئے گا",
      "  طاہر القادری": "اور وہ اپنے اہلِ خانہ کی طرف مسرور و شاداں پلٹے گا،",
      "   علامہ جوادی":"اور وہ اپنے اہل کی طرف خوشی خوشی واپس آئے گا",
      " محمد جوناگڑھی": "اور وه اپنے اہل کی طرف ہنسی خوشی لوٹ آئے گا",
      " محمد حسین نجفی ": "اور وہ اپنے لوگوں کی طرف خوش و خرم لوٹے گا۔",
      "مفتی تقی عثمانی": "اور وہ اپنے گھر والوں کے پاس خوشی مناتا ہوا واپس آئے گا ۔"
     },
     {
      "Aya": " ﴾وَأَمَّا مَنْ أُوتِيَ كِتَابَهُ وَرَاءَ ظَهْرِهِ ﴿١٠   ‎‏ ",
      "ابوالاعلی مودودی ": "رہا وہ شخص جس کا نامہ اعمال اُس کی پیٹھ کے پیچھے دیا جائے گا",
       "  احمد رضا خان ": "اور وہ جس کا نامہٴ اعمال اس کی پیٹھ کے پیچھے دیا جائے",
      "احمد علی ": "اور لیکن جس کو نامہٴ اعمال پیٹھ پیچھے سے دیا گیا",
      "  جالندہری ":"اور جس کا نامہٴ (اعمال) اس کی پیٹھ کے پیچھے سے دیا جائے گا",
      "  طاہر القادری": "اور البتہ وہ شخص جس کا نامۂ اعمال اس کی پیٹھ کے پیچھے سے دیا جائے گا،",
      "   علامہ جوادی":"اور جس کو نامہ اعمال پشت کی طرف سے دیا جائے گا",
      " محمد جوناگڑھی": "ہاں جس شخص کا اعمال نامہ اس کی پیٹھ کے پیچھے سے دیا جائے گا",
      " محمد حسین نجفی ": "اور جس کا نامۂ اعمال اس کے پس پشت دیا جائے گا۔",
      "مفتی تقی عثمانی": "لیکن وہ شخص جس کو اس کا اعمال نامہ اس کی پشت کے پیچھے سے دیا جائے گا "
     },
     {
      "Aya": " ﴾فَسَوْفَ يَدْعُو ثُبُورًا ﴿١١‎‏ ",
      "ابوالاعلی مودودی ": "تو وہ موت کو پکارے گا",
       "  احمد رضا خان ": "وہ عنقریب موت مانگے گا",
      "احمد علی ": "تو وہ موت کو پکارے گا",
      "  جالندہری ":"وہ موت کو پکارے گا",
      "  طاہر القادری": "تو وہ عنقریب موت کو پکارے گا،",
      "   علامہ جوادی":"وہ عنقریب موت کی دعا کرے گا",
      " محمد جوناگڑھی": "تو وه موت کو بلانے لگے گا",
      " محمد حسین نجفی ": "تو وہ موت (اور تباہی) کو پکارے گا",
      "مفتی تقی عثمانی": "وہ موت کو پکارے گا"
     },
     {
      "Aya": "﴾وَيَصْلَىٰ سَعِيرًا ﴿١٢‎",
      "ابوالاعلی مودودی ": "اور بھڑکتی ہوئی آگ میں جا پڑے گا",
       "  احمد رضا خان ": "اور بھڑکتی ا ٓ گ میں جائے گا،",
      "احمد علی ": "اور دوزخ میں داخل ہوگا",
      "  جالندہری ":"اور وہ دوزخ میں داخل ہو گا",
      "  طاہر القادری": "اور وہ دوزخ کی بھڑکتی ہوئی آگ میں داخل ہوگا،",
      "   علامہ جوادی":"اور جہنمّ کی آگ میں داخل ہوگا",
      " محمد جوناگڑھی": "اور بھڑکتی ہوئی جہنم میں داخل ہوگا",
      " محمد حسین نجفی ": "اور (دوزخ کی) بھڑکتی ہوئی آگ میں داخل ہوگا۔",
      "مفتی تقی عثمانی": "اور بھڑکتی ہوئی آگ میں داخل ہوگا ۔"
     },
     {
      "Aya": "﴾إِنَّهُ كَانَ فِي أَهْلِهِ مَسْرُورًا ﴿١٣‎‏ ",
      "ابوالاعلی مودودی ": "وہ اپنے گھر والوں میں مگن تھا",
       "  احمد رضا خان ": "بیشک وہ اپنے گھر میں خوش تھا",
      "احمد علی ": "بے شک وہ اپنے اہل و عیال میں بڑا خوش و خرم تھا",
      "  جالندہری ":"یہ اپنے اہل (و عیال) میں مست رہتا تھا",
      "  طاہر القادری": "بیشک وہ (دنیا میں) اپنے اہلِ خانہ میں خوش و خرم رہتا تھا،",
      "   علامہ جوادی":"یہ پہلے اپنے اہل و عیال میں بہت خوش تھا",
      " محمد جوناگڑھی": "یہ شخص اپنے متعلقین میں (دنیا میں) خوش تھا",
      " محمد حسین نجفی ": "یہ شخص (دنیا میں) اپنے لوگوں میں خوش خوش رہتا تھا۔",
      "مفتی تقی عثمانی": "پہلے وہ اپنے گھر والوں کے درمیان بہت خوش رہتا تھا ۔"
     },
     {
      "Aya": " ﴾إِنَّهُ ظَنَّ أَن لَّن يَحُورَ ﴿١٤  ‎",
      "ابوالاعلی مودودی ": "اُس نے سمجھا تھا کہ اسے کبھی پلٹنا نہیں ہے",
       "  احمد رضا خان ": "وہ سمجھا کہ اسے پھرنا نہیں",
      "احمد علی ": "بے شک اس نے سمجھ لیا تھا کہ ہر گز نہ لوٹ کر جائے گا",
      "  جالندہری ":"اور خیال کرتا تھا کہ (خدا کی طرف) پھر کر نہ جائے گا",
      "  طاہر القادری": "بیشک اس نے یہ گمان کر لیا تھا کہ وہ حساب کے لئے (اللہ کے پاس) ہرگز لوٹ کر نہ جائے گا،",
      "   علامہ جوادی":"اور اس کا خیال تھا کہ پلٹ کر خدا کی طرف نہیں جائے گا",
      " محمد جوناگڑھی": "اس کا خیال تھا کہ اللہ کی طرف لوٹ کر ہی نہ جائے گا",
      " محمد حسین نجفی ": "اس کا خیال تھا کہ وہ کبھی (اپنے خدا کے پاس) لوٹ کر نہیں جائے گا۔",
      "مفتی تقی عثمانی": "اس نے یہ سمجھ رکھا تھا کہ وہ کبھی پلٹ کر ( اللہ کے سامنے ) نہیں جائے گا ۔"
     },
     {
      "Aya": " ﴾بَلَىٰ إِنَّ رَبَّهُ كَانَ بِهِ بَصِيرًا ﴿١٥  ‎‏ ",
      "ابوالاعلی مودودی ": "پلٹنا کیسے نہ تھا، اُس کا رب اُس کے کرتوت دیکھ رہا تھا",
       "  احمد رضا خان ": "ہاں کیوں نہیں بیشک اس کا رب اسے دیکھ رہا ہے،",
      "احمد علی ": "کیوں نہیں بے شک اس کا رب تو اس کو دیکھ رہا تھا",
      "  جالندہری ":"ہاں ہاں۔ اس کا پروردگار اس کو دیکھ رہا تھا",
      "  طاہر القادری": "کیوں نہیں! بیشک اس کا رب اس کو خوب دیکھنے والا ہے،",
      "   علامہ جوادی":"ہاں اس کا پروردگار خوب دیکھنے والا ہے",
      " محمد جوناگڑھی": "کیوں نہیں، حاﻻنکہ اس کا رب اسے بخوبی دیکھ رہا تھا",
      " محمد حسین نجفی ": "کیوں نہیں! بےشک اس کا پروردگار اسے خوب دیکھ رہا تھا۔",
      "مفتی تقی عثمانی": "بھلا کیوں نہیں؟ اس کا پروردگار اسے یقینی طور پر دیکھ رہا تھا ۔"
     },
     {
      "Aya": " ﴾فَلَا أُقْسِمُ بِالشَّفَقِ ﴿١٦‎",
      "ابوالاعلی مودودی ": "پس نہیں، میں قسم کھاتا ہوں شفق کی",
       "  احمد رضا خان ": "تو مجھے قسم ہے شام کے اجالے کی",
      "احمد علی ": "پس شام کی سرخی کی قسم ہے",
      "  جالندہری ":"ہمیں شام کی سرخی کی قسم",
      "  طاہر القادری": "سو مجھے قَسم ہے شفق (یعنی شام کی سرخی یا اس کے بعد کے اُجالے) کی،",
      "   علامہ جوادی":"میں شفق کی قسم کھا کر کہتا ہوں",
      " محمد جوناگڑھی": "مجھے شفق کی قسم! اور رات کی!",
      " محمد حسین نجفی ": "پس نہیں! میں قَسم کھاتا ہوں شفق کی۔",
      "مفتی تقی عثمانی": "اب میں قسم کھاتا ہوں شفق کی ۔"
     },
     {
      "Aya": "  ﴾وَاللَّيْلِ وَمَا وَسَقَ ﴿١٧   ‎‏",
      "ابوالاعلی مودودی ": "اور رات کی اور جو کچھ وہ سمیٹ لیتی ہے",
       "  احمد رضا خان ": "اور رات کی اور جو چیزیں اس میں جمع ہوتی ہیں",
      "احمد علی ": "اور رات کی اور جو کچھ اس نے سمیٹا",
      "  جالندہری ":"اور رات کی اور جن چیزوں کو وہ اکٹھا کر لیتی ہے ان کی",
      "  طاہر القادری": "اور رات کی اور ان چیزوں کی جنہیں وہ (اپنے دامن میں) سمیٹ لیتی ہے،",
      "   علامہ جوادی":"اور رات اورجن چیزوں کو وہ ڈھانک لیتی ہے ان کی قسم",
      " محمد جوناگڑھی": "اور اس کی جمع کرده چیزوں کی قسم",
      " محمد حسین نجفی ": "اور رات کی اور ان چیزوں کی (قَسم کھاتا ہوں) جن کو وہ (رات) سمیٹ لیتی ہے۔",
      "مفتی تقی عثمانی": "اور رات کی اور ان تمام چیزوں کی جنہیں وہ سمیٹ لے"
     },
     {
      "Aya": " ﴾وَالْقَمَرِ إِذَا اتَّسَقَ ﴿١٨‎‏",
      "ابوالاعلی مودودی ": "اور چاند کی جب کہ وہ ماہ کامل ہو جاتا ہے",
       "  احمد رضا خان ": "اور چاند کی جب پورا ہو",
      "احمد علی ": "اور چاند کی جب کہ وہ پورا ہوجائے",
      "  جالندہری ":"اور چاند کی جب کامل ہو جائے",
      "  طاہر القادری": "اور چاند کی جب وہ پورا دکھائی دیتا ہے،",
      "   علامہ جوادی":"اور چاند کی قسم جب وہ پورا ہوجائے",
      " محمد جوناگڑھی": "اور چاند کی جب کہ وه کامل ہو جاتا ہے",
      " محمد حسین نجفی ": "اور چاند کی (قَسم کھاتا ہوں) جب وہ پورا ہو جائے۔",
      "مفتی تقی عثمانی": "اور چاند کی جب وہ بھر کو پورا ہوجائے "
     },
     {
      "Aya": " ﴾لَتَرْكَبُنَّ طَبَقًا عَن طَبَقٍ ﴿١٩‎",
      "ابوالاعلی مودودی ": "تم کو ضرور درجہ بدرجہ ایک حالت سے دوسری حالت کی طرف گزرتے چلے جانا ہے",
       "  احمد رضا خان ": "ضرور تم منزل بہ منزل چڑھو گے",
      "احمد علی ": "کہ تمہیں ایک منزل سے دوسری منزل پر چڑھنا ہوگا",
      "  جالندہری ":"کہ تم درجہ بدرجہ (رتبہٴ اعلیٰ پر) چڑھو گے",
      "  طاہر القادری": "تم یقیناً طبق در طبق ضرور سواری کرتے ہوئے جاؤ گے،",
      "   علامہ جوادی":"کہ تم ایک مصیبت کے بعد دوسری مصیبت میں مبتلا ہوگے",
      " محمد جوناگڑھی": "یقیناً تم ایک حالت سے دوسری حالت پر پہنچو گے",
      " محمد حسین نجفی ": "تمہیں یونہی (تدریجاً) زینہ بہ زینہ چڑھنا ہے (اور ایک ایک منزل طے کرنی ہے)۔",
      "مفتی تقی عثمانی": "کہ تم سب ایک منزل سے دوسری منزل کی طرف چڑھتے جاؤ گے ۔"
     },
     {
      "Aya": " ﴾فَمَا لَهُمْ لَا يُؤْمِنُونَ ﴿٢٠ ‎",
      "ابوالاعلی مودودی ": "پھر اِن لوگوں کو کیا ہو گیا ہے کہ یہ ایمان نہیں لاتے",
       "  احمد رضا خان ": "تو کیا ہوا انہیں ایمان نہیں لاتے",
      "احمد علی ": "پھر انہیں کیا ہو گیا کہ ایمان نہیں لاتے",
      "  جالندہری ":"تو ان لوگوں کو کیا ہوا ہے کہ ایمان نہیں لاتے",
      "  طاہر القادری": "تو انہیں کیا ہو گیا ہے کہ (قرآنی پیشین گوئی کی صداقت دیکھ کر بھی) ایمان نہیں لاتے،",
      "   علامہ جوادی":"پھر انہیں کیا ہوگیا ہے کہ ایمان نہیں لے آتے ہیں",
      " محمد جوناگڑھی": "انہیں کیا ہو گیا کہ ایمان نہیں ﻻتے",
      " محمد حسین نجفی ": "تو انہیں کیا ہوگیا ہے کہ ایمان نہیں لاتے؟",
      "مفتی تقی عثمانی": "ھر ان لوگوں کو کیا ہوگیا ہے کہ وہ ایمان نہیں لاتے؟"
     },
     {
      "Aya": "﴾وَإِذَا قُرِئَ عَلَيْهِمُ الْقُرْآنُ لَا يَسْجُدُونَ ۩ ﴿٢١‎‏",
      "ابوالاعلی مودودی ": "اور جب قرآن اِن کے سامنے پڑھا جاتا ہے تو سجدہ نہیں کرتے؟",
       "  احمد رضا خان ": "اور جب قرآن پڑھا جائے سجدہ نہیں کرتے السجدة ۔۱۳",
      "احمد علی ": "اور جب ان پر قرآن پڑھا جائے تو سجدہ نہیں کرتے",
      "  جالندہری ":"اور جب ان کے سامنے قرآن پڑھا جاتا ہے تو سجدہ نہیں کرتے",
      "  طاہر القادری": "اور جب ان پر قرآن پڑھا جاتا ہے تو (اللہ کے حضور) سجدہ ریز نہیں ہوتے،",
      "   علامہ جوادی":"اور جب ان کے سامنے قرآن پڑھا جاتا ہے تو سجدہ نہیں کرتے ہیں",
      " محمد جوناگڑھی": "اور جب ان کے پاس قرآن پڑھا جاتا ہے تو سجده نہیں کرتے",
      " محمد حسین نجفی ": "اور جب ان کے سامنے قرآن پڑھا جاتا ہے تویہ سجدہ نہیں کرتے؟",
      "مفتی تقی عثمانی": "اور جب ان کے سامنے قرآن پڑھا جاتا ہے تو وہ سجدہ نہیں کرتے؟"
     },
     {
      "Aya": "﴾بَلِ الَّذِينَ كَفَرُوا يُكَذِّبُونَ ﴿٢٢‎‏ ",
      "ابوالاعلی مودودی ": "بلکہ یہ منکرین تو الٹا جھٹلاتے ہیں",
       "  احمد رضا خان ": "بلکہ کافر جھٹلا رہے ہیں",
      "احمد علی ": "بلکہ جو لوگ منکر ہیں جھٹلاتے ہیں",
      "  جالندہری ":"بلکہ کافر جھٹلاتے ہیں",
      "  طاہر القادری": "بلکہ کافر لوگ (اسے مزید) جھٹلا رہے ہیں،",
      "   علامہ جوادی":"بلکہ کفاّر تو تکذیب بھی کرتے ہیں",
      " محمد جوناگڑھی": "بلکہ جنہوں نے کفر کیا وه جھٹلا رہے ہیں",
      " محمد حسین نجفی ": "بلکہ کافر لوگ تو الٹا (اسے) جھٹلاتے ہیں۔",
      "مفتی تقی عثمانی": "بلکہ یہ کافر لوگ حق کو جھٹلاتے ہیں ۔"
     },
     {
      "Aya": " ﴾وَاللَّهُ أَعْلَمُ بِمَا يُوعُونَ ﴿٢٣  ‎‏ ",
      "ابوالاعلی مودودی ": "حالانکہ جو کچھ یہ (اپنے نامہ اعمال میں) جمع کر رہے ہیں اللہ اُسے خوب جانتا ہے",
       "  احمد رضا خان ": "اور اللہ خوب جانتا ہے جو اپنے جی میں رکھتے ہیں",
      "احمد علی ": "اور الله خوب جانتا ہے وہ جو (دل میں) محفوظ رکھتے ہیں",
      "  جالندہری ":"اور خدا ان باتوں کو جو یہ اپنے دلوں میں چھپاتے ہیں خوب جانتا ہے",
      "  طاہر القادری": "اور اللہ (کفر و عداوت کے اس سامان کو) خوب جانتا ہے جو وہ جمع کر رہے ہیں،",
      "   علامہ جوادی":"اور اللہ خوب جانتا ہے جو یہ اپنے دلوں میں چھپائے ہوئے ہیں",
      " محمد جوناگڑھی": "اور اللہ تعالیٰ خوب جانتا ہے جو کچھ یہ دلوں میں رکھتے ہیں",
      " محمد حسین نجفی ": "اور اللہ بہتر جانتا ہے جو کچھ وہ (اپنے دلوں میں) جمع کر رہے ہیں۔",
      "مفتی تقی عثمانی": "اور جو کچھ یہ جمع کر رہے ہیں ، اللہ کو خوب معلوم ہے ۔"
     },
     {
      "Aya": " ﴾فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ ﴿٢٤  ‎",
      "ابوالاعلی مودودی ": "لہٰذا اِن کو دردناک عذاب کی بشارت دے دو",
       "  احمد رضا خان ": "تو تم انہیں دردناک عذاب کی بشارت دو",
      "احمد علی ": "پس انہیں دردناک عذاب کی خوشخبری دے دو",
      "  جالندہری ":"تو ان کو دکھ دینے والے عذاب کی خبر سنا دو",
      "  طاہر القادری": "سو آپ انہیں دردناک عذاب کی بشارت دے دیں،",
      "   علامہ جوادی":"اب آپ انہیں دردناک عذاب کی بشارت دے دیں",
      " محمد جوناگڑھی": "انہیں المناک عذابوں کی خوشخبری سنا دو",
      " محمد حسین نجفی ": "آپ(ص) انہیں دردناک عذاب کی خبر دے دیجئے۔",
      "مفتی تقی عثمانی": "اب تم انہیں ایک دردناک عذاب کی خوشخبری سنا دو ۔"
     },
     {
      "Aya": "﴾لَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ﴿٢٥‎‏",
      "ابوالاعلی مودودی ": "البتہ جو لوگ ایمان لے آئے ہیں اور جنہوں نے نیک عمل کیے ہیں ان کے لیے کبھی ختم نہ ہونے والا اجر ہے",
       "  احمد رضا خان ": "مگر جو ایمان لائے اور اچھے کام کیے ان کے لیے وہ ثواب ہے جو کبھی ختم نہ ہوگا،",
      "احمد علی ": "مگر جو لوگ ایمان لائے اورانہوں نے نیک عمل کیے ان کے لیے بے انتہا اجر ہے",
      "  جالندہری ":"ہاں جو لوگ ایمان لائے اور نیک عمل کرتے رہے ان کے لیے بےانتہا اجر ہے",
      "  طاہر القادری": "مگر جو لوگ ایمان لائے اور نیک عمل کرتے ہیں ان کے لئے غیر منقطع (دائمی) ثواب ہے،",
      "   علامہ جوادی":"علاوہ صاحبانِ ایمان و عمل صالح کے کہ ان کے لئے نہ ختم ہونے والا اجر و ثواب ہے",
      " محمد جوناگڑھی": "ہاں ایمان والوں اور نیک اعمال والوں کو بے شمار اور نہ ختم ہونے واﻻ اجر ہے",
      " محمد حسین نجفی ": "ہاں البتہ جو لوگ ایمان لائے اور نیک اعمال کئے ان کیلئے کبھی ختم نہ ہو نے والا اجر و ثواب ہے۔",
      "مفتی تقی عثمانی": "البتہ جو لوگ ایمان لے آئے ہیں اور انہوں نے نیک عمل کیے ہیں ، ان کو ایسا ثواب ملے گا جو کبھی ختم نہیں ہوگا ۔"
     }
    ]