[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾١‎﴿إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ ",
       "ابوالاعلی مودودی ":  "جب اللہ کی مدد آ جائے اور فتح نصیب ہو جائے",
     "  احمد رضا خان ": "جب اللہ کی مدد اور فتح آئے",
     "احمد علی ": "جب الله کی مدد اور فتح آ چکی",
      "  جالندہری ": "جب خدا کی مدد آ پہنچی اور فتح (حاصل ہو گئی)",
      "  طاہر القادری": "جب اﷲ کی مدد اور فتح آپہنچے،",
       "   علامہ جوادی": "جب خدا کی مدد اور فتح کی منزل آجائے گی",
      " محمد جوناگڑھی": "جب اللہ کی مدد اور فتح آجائے",
       " محمد حسین نجفی ": "جب اللہ کی مدد اور اس کی فتح و فیروزی آجائے۔",
      "مفتی تقی عثمانی": "جب اللہ کی مدد اور فتح آجائے"
     },
     {
      "Aya": " ﴾٢‎﴿وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا ",
       "ابوالاعلی مودودی ": "اور (اے نبیؐ) تم دیکھ لو کہ لوگ فوج در فوج اللہ کے دین میں داخل ہو رہے ہیں",
     "  احمد رضا خان ": "اور لوگوں کو تم دیکھو کہ اللہ کے دین میں فوج فوج داخل ہوتے ہیں",
     "احمد علی ": "اورآپ نے لوگوں کو الله کے دین میں جوق در جوق داخل ہوتے دیکھ لیا",
      "  جالندہری ": "اور تم نے دیکھ لیا کہ لوگ غول کے غول خدا کے دین میں داخل ہو رہے ہیں",
      "  طاہر القادری": "اور آپ لوگوں کو دیکھ لیں (کہ) وہ اﷲ کے دین میں جوق دَر جوق داخل ہو رہے ہیں،",
       "   علامہ جوادی": "اور آپ دیکھیں گے کہ لوگ دین خدا میں فوج در فوج داخل ہورہے ہیں",
      " محمد جوناگڑھی": "اور تو لوگوں کو اللہ کے دین میں جوق در جوق آتا دیکھ لے",
       " محمد حسین نجفی ": "اور آپ دیکھ لیں کہ لوگ فوج در فوج اللہ کے دین میں داخل ہو رہے ہیں۔",
      "مفتی تقی عثمانی": "اور تم لوگوں کو دیکھ لو کہ وہ فوج در فوج اللہ کے دین میں داخل ہورہے ہیں ۔"
     },
     {
      "Aya": "﴾٣‎﴿ فَسَبِّح بِحَمدِ رَبِّكَ وَاستَغفِرهُ ۚ إِنَّهُ كانَ تَوّابًا ",
       "ابوالاعلی مودودی ": "تو اپنے رب کی حمد کے ساتھ اُس کی تسبیح کرو، اور اُس سے مغفرت کی دعا مانگو، بے شک وہ بڑا توبہ قبول کرنے والا ہے",
     "  احمد رضا خان ": "تو اپنے رب کی ثناء کرتے ہوئے اس کی پاکی بولو اور اس سے بخشش چاہو بیشک وہ بہت توبہ قبول کرنے والا ہے",
     "احمد علی ": "تو اپنے رب کی حمد کے ساتھ تسبیح کیجیئے اور اس سے معافی مانگیئے بےشک وہ بڑا توبہ قبول کرنے والا ہے",
      "  جالندہری ": "تو اپنے پروردگار کی تعریف کے ساتھ تسبیح کرو اور اس سے مغفرت مانگو، بے شک وہ معاف کرنے والا ہے",
      "  طاہر القادری": "تو آپ (تشکراً) اپنے رب کی حمد کے ساتھ تسبیح فرمائیں اور (تواضعاً) اس سے استغفار کریں، بیشک وہ بڑا ہی توبہ قبول فرمانے والا (اور مزید رحمت کے ساتھ رجوع فرمانے والا) ہے،",
       "   علامہ جوادی": "تو اپنے رب کی حمد کی تسبیح کریں او راس سے استغفار کریں کہ وہ بہت زیادہ توبہ قبول کرنے والا ہے",
      " محمد جوناگڑھی": "تو اپنے رب کی تسبیح کرنے لگ حمد کے ساتھ اور اس سے مغفرت کی دعا مانگ، بیشک وه بڑا ہی توبہ قبول کرنے واﻻ ہے",
       " محمد حسین نجفی ": "تو (اس وقت) اپنے پروردگار کی حمد کے ساتھ اس کی تسبیح کریں اور اس سے مغفرت طلب کیجئے۔ بیشک وہ بڑا توبہ قبول کرنے والا ہے۔",
      "مفتی تقی عثمانی": "تو اپنے پروردگار کی حمد کے ساتھ اس کی تسبیح کرو ، اور اس سے مغفرت مانگو ۔ یقین جانو وہ بہت معاف کرنے والا ہے ۔"
     }
    ]
  