[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
       " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی":  "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾‏اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ﴿١ ‎‏ ",
      "ابوالاعلی مودودی ": "پڑھو (اے نبیؐ) اپنے رب کے نام کے ساتھ جس نے پیدا کیا",
      "  احمد رضا خان ": "پڑھو اپنے رب کے نام سے جس نے پیدا کیا",
       "احمد علی ": "اپنے رب کے نام سے پڑھیئے جس نے سب کو پیدا کیا",
      "  جالندہری ": "پڑھو (اے نبیؐ) اپنے رب کے نام کے ساتھ جس نے پیدا کیا",
      "  طاہر القادری": "اے حبیب! اپنے رب کے نام سے (آغاز کرتے ہوئے) پڑھئے جس نے (ہر چیز کو) پیدا فرمایا،",
      "   علامہ جوادی": "اس خدا کا نام لے کر پڑھو جس نے پیدا کیا ہے",
      " محمد جوناگڑھی": "پڑھ اپنے رب کے نام سے جس نے پیدا کیا",
       " محمد حسین نجفی ": "اے رسول(ص) اپنے پروردگار کے نام سے پڑھیے جس نے (سب کائنات کو) پیدا کیا۔",
      "مفتی تقی عثمانی":  "پڑھو اپنے پروردگار کا نام لے کر جس نے سب کچھ پیدا کی"
     },
     {
      "Aya": " ﴾‏خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ ﴿٢ ‎",
      "ابوالاعلی مودودی ": "جمے ہوئے خون کے ایک لوتھڑے سے انسان کی تخلیق کی",
      "  احمد رضا خان ": "آدمی کو خون کی پھٹک سے بنایا، پڑھو",
       "احمد علی ": "انسان کو خون بستہ سے پیدا کیا",
      "  جالندہری ": "جمے ہوئے خون کے ایک لوتھڑے سے انسان کی تخلیق کی",
      "  طاہر القادری": "اس نے انسان کو (رحمِ مادر میں) جونک کی طرح معلّق وجود سے پیدا کیا،",
      "   علامہ جوادی": "اس نے انسان کو جمے ہوئے خون سے پیدا کیا ہے",
      " محمد جوناگڑھی": "جس نے انسان کو خون کے لوتھڑے سے پیدا کیا",
       " محمد حسین نجفی ": "بالخصوص انسان کو جمے ہوئے خون کے ایک لوتھڑے سے پیدا کیا۔",
      "مفتی تقی عثمانی":  "اس نے انسان کو جمے ہوئے خون سے پیدا کیا ہے ۔"
     },
     {
      "Aya": " ﴾‏اقْرَأْ وَرَبُّكَ الْأَكْرَمُ ﴿٣ ‎",
      "ابوالاعلی مودودی ": "پڑھو، اور تمہارا رب بڑا کریم ہے",
      "  احمد رضا خان ": "اور تمہارا رب ہی سب سے بڑا کریم،",
       "احمد علی ": "پڑھیئے اور آپ کا رب سب سے بڑھ کر کرم والا ہے",
      "  جالندہری ": "پڑھو، اور تمہارا رب بڑا کریم ہے",
      "  طاہر القادری": "پڑھیئے اور آپ کا رب بڑا ہی کریم ہے،",
      "   علامہ جوادی": "پڑھو اور تمہارا پروردگار بڑا کریم ہے",
      " محمد جوناگڑھی": "تو پڑھتا ره تیرا رب بڑے کرم واﻻ ہے",
       " محمد حسین نجفی ": "پڑھئیے! اور آپ کا پروردگار بڑا کریم ہے۔",
      "مفتی تقی عثمانی":  "پڑھو ، اور تمہارا پروردگار سب سے زیادہ کرم والا ہے ۔"
     },
     {
      "Aya": " ﴾‏الَّذِي عَلَّمَ بِالْقَلَمِ ﴿٤ ‎",
      "ابوالاعلی مودودی ": "جس نے قلم کے ذریعہ سے علم سکھایا",
      "  احمد رضا خان ": "جس نے قلم سے لکھنا سکھایا",
       "احمد علی ": "جس نے قلم سے سکھایا",
      "  جالندہری ": "جس نے قلم کے ذریعہ سے علم سکھایا",
      "  طاہر القادری": "جس نے قلم کے ذریعے (لکھنے پڑھنے کا) علم سکھایا،",
      "   علامہ جوادی": "جس نے قلم کے ذریعے تعلیم دی ہے",
      " محمد جوناگڑھی": "جس نے قلم کے ذریعے (علم) سکھایا",
       " محمد حسین نجفی ": "جس نے قَلم کے ذریعہ سے علم سکھایا۔",
      "مفتی تقی عثمانی":  "جس نے قلم سے تعلیم دی ۔"
     },
     {
      "Aya": "  ﴾‏الْإِنسَانَ مَا لَمْ يَعْلَمْ ﴿٥  ‎",
      "ابوالاعلی مودودی ": "انسان کو وہ علم دیا جسے وہ نہ جانتا تھا",
      "  احمد رضا خان ": "آدمی کو سکھایا جو نہ جانتا تھا",
       "احمد علی ": "انسان کو سکھایا جو وہ نہ جانتا تھا",
      "  جالندہری ": "انسان کو وہ علم دیا جسے وہ نہ جانتا تھا",
      "  طاہر القادری": "جس نے انسان کو (اس کے علاوہ بھی) وہ (کچھ) سکھا دیا جو وہ نہیں جانتا تھا۔ (یا- جس نے (سب سے بلند رتبہ) انسان (محمد مصطفی صلی اللہ علیہ وآلہ وسلم) کو (بغیر ذریعۂ قلم کے) وہ سارا علم عطا فرما دیا جو وہ پہلے نہ جانتے تھے،",
      "   علامہ جوادی": "اور انسان کو وہ سب کچھ بتادیا ہے جو اسے نہیں معلوم تھا",
      " محمد جوناگڑھی": "جس نے انسان کو وه سکھایا جسے وه نہیں جانتا تھا",
       " محمد حسین نجفی ": "اور انسان کو وہ کچھ پڑھایا جو وہ نہیں جانتا تھا۔",
      "مفتی تقی عثمانی":  "انسان کو اس بات کی تعلیم دی جو وہ نہیں جانتا تھا "
     },
     {
      "Aya": " ﴾‏كَلَّا إِنَّ الْإِنسَانَ لَيَطْغَىٰ ﴿٦  ‎",
      "ابوالاعلی مودودی ": "ہرگز نہیں، انسان سرکشی کرتا ہے",
      "  احمد رضا خان ": "ہاں ہاں بیشک آدمی سرکشی کرتا ہے،",
       "احمد علی ": "ہرگز نہیں بے شک آدمی سرکش ہو جاتا ہے",
      "  جالندہری ": "ہرگز نہیں، انسان سرکشی کرتا ہے",
      "  طاہر القادری": "مگر حقیقت یہ ہے کہ (نافرمان) انسان سر کشی کرتا ہے،",
      "   علامہ جوادی": "بے شک انسان سرکشی کرتا ہے",
      " محمد جوناگڑھی": "سچ مچ انسان تو آپے سے باہر ہو جاتا ہے",
       " محمد حسین نجفی ": "ہرگز نہیں! انسان (اس وقت) سرکشی کرنے لگتا ہے",
      "مفتی تقی عثمانی":  "حقیقت یہ ہے کہ انسان کھلی سرکشی کر رہا ہے ۔"
     },
     {
      "Aya": " ﴾‏٧﴿‏أَن رَّآهُ اسْتَغْنَىٰ ",
      "ابوالاعلی مودودی ": "اِس بنا پر کہ وہ اپنے آپ کو بے نیاز دیکھتا ہے",
      "  احمد رضا خان ": "اس پر کہ اپنے آپ کو غنی سمجھ لیا",
       "احمد علی ": "جب کہ اپنے آپ کو غنی پاتا ہے",
      "  جالندہری ": "اِس بنا پر کہ وہ اپنے آپ کو بے نیاز دیکھتا ہے",
      "  طاہر القادری": "اس بنا پر کہ وہ اپنے آپ کو (دنیا میں ظاہراً) بے نیاز دیکھتا ہے،",
      "   علامہ جوادی": "کہ اپنے کو بے نیاز خیال کرتا ہے",
      " محمد جوناگڑھی": "اس لئے کہ وه اپنے آپ کو بے پروا (یا تونگر) سمجھتا ہے",
       " محمد حسین نجفی ": "جب وہ سمجھتا ہے کہ وہ (غنی) بےنیاز ہے",
      "مفتی تقی عثمانی":  "کیونکہ اس نے اپنے آپ کو بے نیاز سمجھ لیا ہے ۔ "
     },
     {
      "Aya": " ﴾‏إِنَّ إِلَىٰ رَبِّكَ الرُّجْعَىٰ ﴿٨  ‎‏ ",
      "ابوالاعلی مودودی ": "پلٹنا یقیناً تیرے رب ہی کی طرف ہے",
      "  احمد رضا خان ": "بیشک تمہارے رب ہی کی طرف پھرنا ہے",
       "احمد علی ": "بے شک آپ کے رب ہی کی طرف لوٹ کر جانا ہے",
      "  جالندہری ": "پلٹنا یقیناً تیرے رب ہی کی طرف ہے",
      "  طاہر القادری": "بیشک (ہر انسان کو) آپ کے رب ہی کی طرف لوٹنا ہے،",
      "   علامہ جوادی": "بے شک آپ کے رب کی طرف واپسی ہے",
      " محمد جوناگڑھی": "یقیناً لوٹنا تیرے رب کی طرف ہے",
       " محمد حسین نجفی ": "بےشک آپ(ص) کے پروردگار کی طرف ہی (سب کی) بازگشت ہے۔",
      "مفتی تقی عثمانی":  "سچ تو یہ ہے کہ تمہارے پروردگار ہی کی طرف سب کو لوٹنا ہے ۔"
     },
     {
      "Aya": " ﴾‏أَرَأَيْتَ الَّذِي يَنْهَىٰ ﴿٩   ‎‏",
      "ابوالاعلی مودودی ": "تم نے دیکھا اُس شخص کو",
      "  احمد رضا خان ": "بھلا دیکھو تو جو منع کرتا ہے،",
       "احمد علی ": "کیا آپ نے اس کو دیکھا جو منع کرتا ہے",
      "  جالندہری ": "تم نے دیکھا اُس شخص کو",
      "  طاہر القادری": "کیا آپ نے اس شخص کو دیکھا جو منع کرتا ہے،",
      "   علامہ جوادی": "کیا تم نے اس شخص کو دیکھا ہے جو منع کرتا ہے",
      " محمد جوناگڑھی": "بھلا اسے بھی تو نے دیکھا جو بندے کو روکتا ہے",
       " محمد حسین نجفی ": "کیا آپ(ص) نے اس شخص کو دیکھا ہے جو منع کرتا ہے۔",
      "مفتی تقی عثمانی":  "بھلا تم نے اس شخص کو بھی دیکھا جو ایک بندے کو منع کرتا ہے"
     },
     {
      "Aya": " ﴾‏عَبْدًا إِذَا صَلَّىٰ ﴿١٠  ‎",
      "ابوالاعلی مودودی ": "جو ایک بندے کو منع کرتا ہے جبکہ وہ نماز پڑھتا ہو؟",
      "  احمد رضا خان ": "بندے کو جب وہ نماز پڑھے",
       "احمد علی ": "ایک بندے کو جب کہ وہ نماز پڑھتا ہے",
      "  جالندہری ": "جو ایک بندے کو منع کرتا ہے جبکہ وہ نماز پڑھتا ہو؟",
      "  طاہر القادری": "اﷲ کے بندے کو جب وہ نماز پڑھتا ہے۔ (یا:- (اللہ کے محبوب و برگزیدہ) بندے (محمد مصطفی صلی اللہ علیہ وآلہ وسلم) کو جب وہ نماز پڑھتے ہیں)،",
      "   علامہ جوادی": "بندئہ خدا کو جب وہ نماز پڑھتا ہے",
      " محمد جوناگڑھی": "جبکہ وه بنده نماز ادا کرتا ہے",
       " محمد حسین نجفی ": "ایک بندہ (خاص) کو جب وہ نماز پڑھتا ہے",
      "مفتی تقی عثمانی":  "جب وہ نماز پڑھتا ہے؟"
     },
     {
      "Aya": " ﴾‏أَرَأَيْتَ إِن كَانَ عَلَى الْهُدَىٰ ﴿١١   ‎‏",
      "ابوالاعلی مودودی ": "تمہارا کیا خیال ہے اگر (وہ بندہ) راہ راست پر ہو",
      "  احمد رضا خان ": "بھلا دیکھو تو اگر وہ ہدایت پر ہوتا،",
       "احمد علی ": "بھلا دیکھو تو سہی اگر وہ راہ پر ہوتا",
      "  جالندہری ": "تمہارا کیا خیال ہے اگر (وہ بندہ) راہ راست پر ہو",
      "  طاہر القادری": "بھلا دیکھئے تو اگر وہ ہدایت پر ہوتا،",
      "   علامہ جوادی": "کیا تم نے دیکھا کہ اگر وہ بندہ ہدایت پر ہو",
      " محمد جوناگڑھی": "بھلا بتلا تو اگر وه ہدایت پر ہو",
       " محمد حسین نجفی ": "بھلا دیکھئے تو! اگر وہ (بندۂ خاص) ہدایت پر ہے؟",
      "مفتی تقی عثمانی":  "بھلا بتلاؤ کہ اگر وہ ( نماز پڑھنے والا ) ہدایت پر ہو ۔"
     },
     {
      "Aya": " ﴾‏أَوْ أَمَرَ بِالتَّقْوَىٰ ﴿١٢   ‎",
      "ابوالاعلی مودودی ": "یا پرہیزگاری کی تلقین کرتا ہو؟",
      "  احمد رضا خان ": "یا پرہیزگاری بتاتا تو کیا خوب تھا،",
       "احمد علی ": "یا پرہیز گاری سکھاتا",
      "  جالندہری ": "یا پرہیزگاری کی تلقین کرتا ہو؟",
      "  طاہر القادری": "یا وہ (لوگوں کو) پرہیزگاری کا حکم دیتا (تو کیا خوب ہوتا)،",
      "   علامہ جوادی": "یا تقویٰ کا حکم دے تو روکنا کیسا ہے",
      " محمد جوناگڑھی": "یا پرہیز گاری کا حکم دیتا ہو",
       " محمد حسین نجفی ": "یا وہ پرہیزگاری کا حکم دیتا ہے؟",
      "مفتی تقی عثمانی":  "یا تقوی کا حکم دیتا ہو ( تو کیا اسے روکنا گمراہی نہیں؟ )"
     },
     {
      "Aya": " ﴾‏أَرَأَيْتَ إِن كَذَّبَ وَتَوَلَّىٰ ﴿١٣  ‎‏",
      "ابوالاعلی مودودی ": "تمہارا کیا خیال ہے اگر (یہ منع کرنے والا شخص حق کو) جھٹلاتا اور منہ موڑتا ہو؟",
      "  احمد رضا خان ": "بھلا دیکھو تو اگر جھٹلایا اور منہ پھیرا",
       "احمد علی ": "بھلا دیکھو تو سہی اگر اس نے جھٹلایا اور منہ موڑ لیا",
      "  جالندہری ": "تمہارا کیا خیال ہے اگر (یہ منع کرنے والا شخص حق کو) جھٹلاتا اور منہ موڑتا ہو؟",
      "  طاہر القادری": "اب بتائیے! اگر اس نے (دینِ حق کو) جھٹلایا ہے اور (آپ سے) منہ پھیر لیا ہے (تو اس کا کیا حشر ہوگا)،",
      "   علامہ جوادی": "کیا تم نے دیکھا کہ اگر اس کافر نے جھٹلایا اور منھ پھیر لیا",
      " محمد جوناگڑھی": "بھلا دیکھو تو اگر یہ جھٹلاتا ہو اور منھ پھیرتا ہو تو",
       " محمد حسین نجفی ": "کیا آپ نے غور کیا ہے کہ اگر یہ شخص (حق کو) جھٹلاتا ہے اور (اس سے) رُوگردانی کرتا ہے توانجام کیا ہوگا؟",
      "مفتی تقی عثمانی":  "بھلا بتلاؤ کہ اگر وہ ( روکنے والا ) حق کو جھٹلاتا ہو ، اور منہ موڑتا ہو ۔"
     },
     {
      "Aya": " ﴾‏أَلَمْ يَعْلَم بِأَنَّ اللَّهَ يَرَىٰ ﴿١٤",
      "ابوالاعلی مودودی ": "کیا وہ نہیں جانتا کہ اللہ دیکھ رہا ہے؟",
      "  احمد رضا خان ": "تو کیا حال ہوگا کیا نہ جانا کہ اللہ دیکھ رہا ہے",
       "احمد علی ": "تو کیا وہ نہیں جانتا کہ الله دیکھ رہا ہے",
      "  جالندہری ": "کیا وہ نہیں جانتا کہ اللہ دیکھ رہا ہے؟",
      "  طاہر القادری": "کیا وہ نہیں جانتا کہ اﷲ (اس کے سارے کردار کو) دیکھ رہا ہے،",
      "   علامہ جوادی": "تو کیا تمہیں نہیں معلوم کہ اللہ دیکھ رہا ہے",
      " محمد جوناگڑھی": "کیا اس نے نہیں جانا کہ اللہ تعالیٰ اسے خوب دیکھ رہا ہے",
       " محمد حسین نجفی ": "کیا وہ نہیں جانتا کہ اللہ (سب کچھ) دیکھ رہا ہے؟",
      "مفتی تقی عثمانی":  "کیا اسے یہ معلوم نہیں ہے کہ اللہ دیکھ رہا ہے ؟"
     },
     {
      "Aya": " ﴾‏كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًا بِالنَّاصِيَةِ ﴿١٥‎‏",
      "ابوالاعلی مودودی ": "ہرگز نہیں، اگر وہ باز نہ آیا تو ہم اس کی پیشانی کے بال پکڑ کر اسے کھینچیں گے",
      "  احمد رضا خان ": "ہاں ہاں اگر باز نہ آیا تو ضرور ہم پیشانی کے بال پکڑ کر کھینچیں گے",
       "احمد علی ": "ہرگزایسا نہیں چاہیئے اگر وہ باز نہ آیا تو ہم پیشانی کے بال پکڑ کر گھسیٹیں گے",
      "  جالندہری ": "ہرگز نہیں، اگر وہ باز نہ آیا تو ہم اس کی پیشانی کے بال پکڑ کر اسے کھینچیں گے",
      "  طاہر القادری": "خبر دار! اگر وہ (گستاخئ رسالت اور دینِ حق کی عداوت سے) باز نہ آیا تو ہم ضرور (اسے) پیشانی کے بالوں سے پکڑ کر گھسیٹیں گے،",
      "   علامہ جوادی": "یاد رکھو اگر وہ روکنے سے باز نہ آیا تو ہم پیشانی کے بال پکڑ کر گھسیٹیں گے",
      " محمد جوناگڑھی": "یقیناً اگر یہ باز نہ رہا تو ہم اس کی پیشانی کے بال پکڑ کر گھسیٹیں گے",
       " محمد حسین نجفی ": "ہرگز نہیں اگر وہ (اس سے) باز نہ آیا تو ہم اس کی پیشانی کے بال پکڑ کر کھینچیں گے۔",
      "مفتی تقی عثمانی":  "خبردار ! اگر وہ باز نہ آیا تو ہم ( اسے ) پیشانی کے بال پکڑ کر گھسیٹیں گے ۔"
     },
     {
      "Aya": "﴾‏نَاصِيَةٍ كَاذِبَةٍ خَاطِئَةٍ ﴿١٦‎‏ ",
      "ابوالاعلی مودودی ": "اُس پیشانی کو جو جھوٹی اور سخت خطا کار ہے",
      "  احمد رضا خان ": "کیسی پیشانی جھوٹی خطاکار،",
       "احمد علی ": "پیشانی جھوٹی خطا کار",
      "  جالندہری ": "اُس پیشانی کو جو جھوٹی اور سخت خطا کار ہے",
      "  طاہر القادری": "وہ پیشانی جو جھوٹی (اور) خطا کار ہے،",
      "   علامہ جوادی": "جھوٹے اور خطا کار کی پیشانی کے بال",
      " محمد جوناگڑھی": "ایسی پیشانی جو جھوٹی خطا کار ہے",
       " محمد حسین نجفی ": "وہ پیشانی جو جھوٹی ہے اور گنہگار؟",
      "مفتی تقی عثمانی":  "اس پیشانی کے بال جو جھوٹی ہے ، گنہگار ہے"
     },
     {
      "Aya": "﴾‏فَلْيَدْعُ نَادِيَهُ ﴿١٧‎",
      "ابوالاعلی مودودی ": "وہ بلا لے اپنے حامیوں کی ٹولی کو",
      "  احمد رضا خان ": "اب پکارے اپنی مجلس کو",
       "احمد علی ": "پس وہ اپنے مجلس والوں کو بلا لے",
      "  جالندہری ": "وہ بلا لے اپنے حامیوں کی ٹولی کو",
      "  طاہر القادری": "پس وہ اپنے ہم نشینوں کو (مدد کے لئے) بلا لے،",
      "   علامہ جوادی": "پھر وہ اپنے ہم نشینوں کو بلائے",
      " محمد جوناگڑھی": "یہ اپنی مجلس والوں کو بلالے",
       " محمد حسین نجفی ": "پس وہ بلائے اپنے ہم نشینوں کو۔",
      "مفتی تقی عثمانی":  "اب وہ بلالے اپنی مجلس والوں کو ۔"
     },
     {
      "Aya": "  ﴾‏سَنَدْعُ الزَّبَانِيَةَ ﴿١٨   ‎‏",
      "ابوالاعلی مودودی ": "ہم بھی عذاب کے فرشتوں کو بلا لیں گے",
      "  احمد رضا خان ": "ابھی ہم سپاہیوں کو بلاتے ہیں",
       "احمد علی ": "ہم بھی مؤکلین دوزخ کو بلا لیں گے",
      "  جالندہری ": "ہم بھی عذاب کے فرشتوں کو بلا لیں گے",
      "  طاہر القادری": "ہم بھی عنقریب (اپنے) سپاہیوں (یعنی دوزخ کے عذاب پر مقرر فرشتوں) کو بلا لیں گے،",
      "   علامہ جوادی": "ہم بھی اپنے جلاد فرشتوں کوبلاتے ہیں",
      " محمد جوناگڑھی": "ہم بھی (دوزخ کے) پیادوں کو بلالیں گے",
       " محمد حسین نجفی ": "ہم بھی دوزخ کے ہرکاروں (فرشتوں) کو بلائیں گے۔",
      "مفتی تقی عثمانی":  "ہم دوزخ کے فرشتوں کو بلا لیں گے "
     },
     {
      "Aya": "﴾ كَلَّا لَا تُطِعْهُ وَاسْجُدْ وَاقْتَرِب ۩ ﴿١٩",
      "ابوالاعلی مودودی ": "ہرگز نہیں، اُس کی بات نہ مانو اور سجدہ کرو اور (اپنے رب کا) قرب حاصل کرو",
      "  احمد رضا خان ": "ہاں ہاں، اس کی نہ سنو اور سجدہ کرو اور ہم سے قریب ہوجاؤ، (السجدة ۔۱۴)",
       "احمد علی ": "ہر گز ایسا نہیں چاہیئے آپ اس کا کہانہ مانیے اور سجدہ کیجیئے اور قرب حاصل کیجیئے",
      "  جالندہری ": "ہرگز نہیں، اُس کی بات نہ مانو اور سجدہ کرو اور (اپنے رب کا) قرب حاصل کرو",
      "  طاہر القادری": "ہرگز نہیں! آپ اس کے کئے کی پرواہ نہ کیجئے، اور (اے حبیبِ مکرّم!) آپ سر بسجود رہئے اور (ہم سے مزید) قریب ہوتے جائیے،",
      "   علامہ جوادی": "دیکھو تم ہرگز اس کی اطاعت نہ کرنا اور سجدہ کرکے قرب خدا حاصل کرو",
      " محمد جوناگڑھی": "خبردار! اس کا کہنا ہرگز نہ ماننا اور سجده کر اور قریب ہو جا",
       " محمد حسین نجفی ": "ہرگز نہیں! اس کی بات نہ مانیے اورسجدہ کیجئے اور (اپنے پروردگار کا) قرب حاصل کیجئے۔",
      "مفتی تقی عثمانی":  "ہرگز نہیں ! اس کی بات نہ مانو ، اور سجدہ کرو ، اور قریب آجاؤ ۔"
     }
    ]
    