[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
    "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":  "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ":  "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya": "﴾وَالْفَجْرِ ﴿١‎",
     "ابوالاعلی مودودی   ": "قسم ہے فجر کی",
     "  احمد رضا خان ": "اس صبح کی قسم",
    "احمد علی ": "فجر کی قسم ہے",
     "  جالندہری ": "فجر کی قسم",
     "  طاہر القادری": "اس صبح کی قَسم (جس سے ظلمتِ شب چھٹ گئی)٭، ٭ مراد ہر روز کی صبح یا نمازِ فجر ہے یا بطورِ خاص ماہ ذی الحجہ کی پہلی صبح یا یکم محرم کی صبح ہے یا عید الاضحٰی کی صبح۔ اس سے مراد سیدنا محمد مصطفی صلی اللہ علیہ وآلہ وسلم کی ذاتِ گرامی بھی ہے جن کی بعثت سے شبِ ظلمت کا خاتمہ ہوا اور صبحِ ایمان پھوٹی۔",
      "   علامہ جوادی":  "قسم ہے فجر کی",
     " محمد جوناگڑھی": "قسم ہے فجر کی!",
      " محمد حسین نجفی ":  "قَسم ہے صبح کی۔",
     "مفتی تقی عثمانی": "قسم ہے فجر کے وقت کی ۔"
    },
    {
     "Aya": " ﴾وَلَيَالٍ عَشْرٍ ﴿٢  ‎‏ ",
     "ابوالاعلی مودودی   ": "اور دس راتوں کی",
     "  احمد رضا خان ": "اور دس راتوں کی",
    "احمد علی ": "اور دس راتوں کی",
     "  جالندہری ": "اور دس راتوں کی",
     "  طاہر القادری": "اور دس (مبارک) راتوں کی قَسم٭، ٭ مراد ماہِ رمضان کے آخری عشرہ کی راتیں یا پہلے عشرۂ محرّم کی راتیں ہیں یا اوّل عشرۂ ذی الحجہ کی راتیں ہیں جو برکات و درجات سے معمور ہیں۔",
      "   علامہ جوادی":  "اور دس راتوں کی",
     " محمد جوناگڑھی": "اور دس راتوں کی!",
      " محمد حسین نجفی ":  "اور دس (مقدس) راتوں کی۔",
     "مفتی تقی عثمانی": "اور دس راتوں کی"
    },
    {
     "Aya": " ﴾وَالشَّفْعِ وَالْوَتْرِ ﴿٣  ‎‏ ",
     "ابوالاعلی مودودی   ": "اور جفت اور طاق کی",
     "  احمد رضا خان ": "اور جفت اور طاق کی",
    "احمد علی ": "اور جفت اور طاق کی",
     "  جالندہری ": "اور جفت اور طاق کی",
     "  طاہر القادری": "اور جفت کی قَسم اور طاق کی قَسم٭، ٭ جفت (جوڑا) سے مراد کل مخلوق ہے جو جوڑوں کی صورت میں پیدا کی گئی ہے، اور طاق (فرد و تنہا) سے مراد خالق ہے جو وحدہ لا شریک ہے۔ یا شَفع یومِ نحر (قربانی) اور وَتر یومِ عرفہ (حج) ہے، یا شَفع سے مراد دنیا کے شب و روز ہیں اور وَتر سے مراد یومِ قیامت ہے جس کی کوئی شب نہ ہوگی۔ یا شَفع سے مراد سال بھر کی عام جفت راتیں ہیں اور وَتر سے مراد سال بھر کی برکت والی طاق راتیں ہیں، مثلاً شبِ معراج، شبِ برات اور شبِ قدر وغیرہ جو پے در پے رجب، شعبان اور رمضان میں آتی ہیں۔ یا شَفع سے مراد حضرت آدم علیہ السلام اور حضرت حواء علیہا السلام کا پہلا جوڑا ہے اور وَتر سے مراد تنہا حضرت آدم علیہ السلام، جن سے تخلیقِ انسانیت کی ابتداء ہوئی۔",
      "   علامہ جوادی":  "اور جفت و طاق کی",
     " محمد جوناگڑھی": "اور جفت اور طاق کی!",
      " محمد حسین نجفی ":  "اورجُفت اور طاق کی۔",
     "مفتی تقی عثمانی": "اور جفت کی اور طاق کی"
    },
    {
     "Aya": "﴾اللَّيْلِ إِذَا يَسْرِ ﴿٤‎",
     "ابوالاعلی مودودی   ": "اور رات کی جبکہ وہ رخصت ہو رہی ہو",
     "  احمد رضا خان ": "اور رات کی جب چل دے",
    "احمد علی ": "اور رات کی جب وہ گزر جائے",
     "  جالندہری ": "اور رات کی جب جانے لگے",
     "  طاہر القادری": "اور رات کی قسم جب گزر چلے (مراد ہر شب ہے یا بطورِ خاص شبِ مزدلفہ یا شبِ قدر)،",
      "   علامہ جوادی":  "اور رات کی جب وہ جانے لگے",
     " محمد جوناگڑھی": "اور رات کی جب وه چلنے لگے",
      " محمد حسین نجفی ":  "اور رات کی جبکہ (جانے کیلئے) چلنے لگے۔",
     "مفتی تقی عثمانی": "اور رات کی جب وہ چل کھڑی ہو ۔  ( کہ آخرت میں جزا و سزا ضرور ہوگی )"
    },
    {
     "Aya": "﴾هَلْ فِي ذَٰلِكَ قَسَمٌ لِّذِي حِجْرٍ ﴿٥‎",
     "ابوالاعلی مودودی   ": "کیا اِس میں کسی صاحب عقل کے لیے کوئی قسم ہے؟",
     "  احمد رضا خان ": "کیوں اس میں عقلمند کے لیے قسم ہوئی",
    "احمد علی ": "ان چیزو ں کی قسم عقلمندوں کے واسطے معتبر ہے",
     "  جالندہری ": "اور بے شک یہ چیزیں عقلمندوں کے نزدیک قسم کھانے کے لائق ہیں کہ (کافروں کو ضرور عذاب ہو گا)",
     "  طاہر القادری": "بیشک ان میں عقل مند کے لئے بڑی قسم ہے،",
      "   علامہ جوادی":  "بے شک ان چیزوں میں قسم ہے صاحبِ عقل کے لئے",
     " محمد جوناگڑھی": "کیا ان میں عقلمند کے واسطے کافی قسم ہے",
      " محمد حسین نجفی ":  "کیا اس میں صاحبِ عقل کیلئے کوئی قسم ہے؟ (یعنی یقیناً ہے)۔",
     "مفتی تقی عثمانی": "ایک عقل والے ( کو یقین دلانے ) کے لیے یہ قسمیں کافی ہیں کہ نہیں؟"
    },
    {
     "Aya": " أَلَم تَرَ كَيفَ فَعَلَ رَبُّكَ بِعادٍ ‎﴿٦﴾",
     "ابوالاعلی مودودی   ": "تم نے دیکھا نہیں کہ تمہارے رب نے کیا برتاؤ کیا",
     "  احمد رضا خان ": "کیا تم نے نہ دیکھا تمہارے رب نے عاد کے ساتھ کیسا کیا،",
    "احمد علی ": "کیا آپ نے نہیں دیکھا کہ آپ کے رب نے عاد کے ساتھ کیا سلوک کیا",
     "  جالندہری ": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے عاد کے ساتھ کیا کیا",
     "  طاہر القادری": "کیا آپ نے نہیں دیکھا کہ آپ کے رب نے (قومِ) عاد کے ساتھ کیسا (سلوک) کیا؟،",
      "   علامہ جوادی":  "کیا تم نے نہیں دیکھا کہ تمہارے رب نے قوم عاد کے ساتھ کیا کیا ہے",
     " محمد جوناگڑھی": "کیا آپ نے نہیں دیکھا کہ آپ کے رب نے عادیوں کے ساتھ کیا کیا",
      " محمد حسین نجفی ":  "کیا آپ(ص) نے نہیں دیکھا کہ آپ(ص) کے پروردگار نے قومِ عاد کے ساتھ کیا کیا؟",
     "مفتی تقی عثمانی": "کیا تم نے دیکھا نہیں کہ تمہارے پروردگار نے عاد کے ساتھ کیا سلوک کیا ۔"
    },
    {
     "Aya": "﴾إِرَمَ ذَاتِ الْعِمَادِ ﴿٧‎",
     "ابوالاعلی مودودی   ": "اونچے ستونوں والے عاد ارم کے ساتھ",
     "  احمد رضا خان ": "وہ اِرم حد سے زیادہ طول والے",
    "احمد علی ": "جو نسل ارم سے ستونوں والے تھے",
     "  جالندہری ": "جو ارم (کہلاتے تھے اتنے) دراز قد",
     "  طاہر القادری": "جو اہلِ اِرم تھے (اور) بڑے بڑے ستونوں (کی طرح دراز قد اور اونچے محلات) والے تھے،",
      "   علامہ جوادی":  "ستون والے ارم والے",
     " محمد جوناگڑھی": "ستونوں والے ارم کے ساتھ",
      " محمد حسین نجفی ":  "یعنی اونچے ستونوں والے ارم کے ساتھ۔",
     "مفتی تقی عثمانی": "اس اونچے ستونوں والی قوم ارم کے ساتھ"
    },
    {
     "Aya": "﴾الَّتِي لَمْ يُخْلَقْ مِثْلُهَا فِي الْبِلَادِ ﴿٨‎‏ ",
     "ابوالاعلی مودودی   ": "جن کے مانند کوئی قوم دنیا کے ملکوں میں پیدا نہیں کی گئی تھی؟",
     "  احمد رضا خان ": "کہ اس جیسا شہروں میں پیدا نہ ہوا",
    "احمد علی ": "کہ ان جیسا شہرو ں میں پیدا نہیں کیا گیا",
     "  جالندہری ": "کہ تمام ملک میں ایسے پیدا نہیں ہوئے تھے",
     "  طاہر القادری": "جن کا مثل (دنیا کے) ملکوں میں (کوئی بھی) پیدا نہیں کیا گیا،",
      "   علامہ جوادی":  "جس کا مثل دوسرے شہروں میں نہیں پیدا ہوا ہے",
     " محمد جوناگڑھی": "جس کی مانند (کوئی قوم) ملکوں میں پیدا نہیں کی گئی",
      " محمد حسین نجفی ":  "جن کامثل (دنیا کے) شہروں میں پیدا نہیں کیا گیا۔",
     "مفتی تقی عثمانی": "جس کے برابر دنیا کے ملکوں میں کوئی اور قوم پیدا نہیں کی گئی ؟"
    },
    {
     "Aya": " ﴾وَثَمُودَ الَّذِينَ جَابُوا الصَّخْرَ بِالْوَادِ ﴿٩  ‎‏ ",
     "ابوالاعلی مودودی   ": "اور ثمود کے ساتھ جنہوں نے وادی میں چٹانیں تراشی تھیں؟",
     "  احمد رضا خان ": "اور ثمود جنہوں نے وادی میں پتھر کی چٹانیں کاٹیں",
    "احمد علی ": "اور ثمود کے ساتھ جنہوں نے پتھروں کو وادی میں تراشا تھا",
     "  جالندہری ": "اور ثمود کے ساتھ (کیا کیا) جو وادئِ (قریٰ) میں پتھر تراشتے تھے (اور گھر بناتے) تھے",
     "  طاہر القادری": "اور ثمود (کے ساتھ کیا سلوک ہوا) جنہوں نے وادئ (قری) میں چٹانوں کو کاٹ (کر پتھروں سے سینکڑوں شہروں کو تعمیر کر) ڈالا تھا،",
      "   علامہ جوادی":  "اور ثمود کے ساتھ جو وادی میں پتھر تراش کر مکان بناتے تھے",
     " محمد جوناگڑھی": "اور ﺛمودیوں کے ساتھ جنہوں نے وادی میں بڑے بڑے پتھر تراشے تھے",
      " محمد حسین نجفی ":  "اور قومِ ثمود کے ساتھ (کیا کیا؟) جنہوں نے وادی میں چٹانیں تراشی تھیں (اور عمارتیں بنائی تھیں)۔",
     "مفتی تقی عثمانی": "اور ثمود کی اس قوم کے ساتھ کیا کیا جس نے و ادی میں پتھر کی چٹانوں کو تراش رکھا تھا؟ "
    },
    {
     "Aya": " ﴾وَفِرْعَوْنَ ذِي الْأَوْتَادِ ﴿١٠‎",
     "ابوالاعلی مودودی   ": "اور میخوں والے فرعون کے ساتھ؟",
     "  احمد رضا خان ": "اور فرعون کہ چومیخا کرتا (سخت سزائیں دیتا)",
    "احمد علی ": "اور فرعون میخوں والوں کے ساتھ",
     "  جالندہری ": "اور فرعون کے ساتھ (کیا کیا) جو خیمے اور میخیں رکھتا تھا",
     "  طاہر القادری": "اور فرعون (کا کیا حشر ہوا) جو بڑے لشکروں والا (یا لوگوں کو میخوں سے سزا دینے والا) تھا،",
      "   علامہ جوادی":  "اور میخوں والے فرعون کے ساتھ",
     " محمد جوناگڑھی": "اور فرعون کے ساتھ جو میخوں واﻻ تھا",
      " محمد حسین نجفی ":  "اور فرعون میخوں والے کے ساتھ (کیا کیا؟)۔",
     "مفتی تقی عثمانی": "اور میخوں والے فرعون کے ساتھ کیا کیا؟"
    },
    {
     "Aya": " ﴾الَّذِينَ طَغَوْا فِي الْبِلَادِ ﴿١١‎",
     "ابوالاعلی مودودی   ": "یہ وہ لوگ تھے جنہوں نے دنیا کے ملکوں میں بڑی سرکشی کی تھی",
     "  احمد رضا خان ": "جنہوں نے شہروں میں سرکشی کی",
    "احمد علی ": "ان سب نے ملک میں سرکشی کی",
     "  جالندہری ": "یہ لوگ ملکوں میں سرکش ہو رہے تھے",
     "  طاہر القادری": "یہ وہ لوگ (تھے) جنہوں نے (اپنے اپنے) ملکوں میں سرکشی کی تھی،",
      "   علامہ جوادی":  "جن لوگوں نے شہروں میں سرکشی پھیلائی",
     " محمد جوناگڑھی": "ان سبھوں نے شہروں میں سر اٹھا رکھا تھا",
      " محمد حسین نجفی ":  "ان لوگوں نے شہروں میں سرکشی کی تھی۔",
     "مفتی تقی عثمانی": "یہ وہ لوگ تھے جنہوں نے دنیا کے ملکوں میں سرکشی اختیار کرلی تھی ۔"
    },
    {
     "Aya": " ﴾فَأَكْثَرُوا فِيهَا الْفَسَادَ ﴿١٢‎‏",
     "ابوالاعلی مودودی   ": "اور ان میں بہت فساد پھیلایا تھا",
     "  احمد رضا خان ": "پھر ان میں بہت فساد پھیلایا",
    "احمد علی ": "پھر انہوں نے بہت فساد پھیلایا",
     "  جالندہری ": "اور ان میں بہت سی خرابیاں کرتے تھے",
     "  طاہر القادری": "پھر ان میں بڑی فساد انگیزی کی تھی،",
      "   علامہ جوادی":  "اور خوب فساد کیا",
     " محمد جوناگڑھی": "اور بہت فساد مچا رکھا تھا",
      " محمد حسین نجفی ":  "اوران میں بہت فساد پھیلایا تھا۔",
     "مفتی تقی عثمانی": "اور ان میں بہت فساد مچایا تھا ۔"
    },
    {
     "Aya": " ﴾فَصَبَّ عَلَيْهِمْ رَبُّكَ سَوْطَ عَذَابٍ ﴿١٣‎‏",
     "ابوالاعلی مودودی   ": "آخرکار تمہارے رب نے ان پر عذاب کا کوڑا برسا دیا",
     "  احمد رضا خان ": "تو ان پر تمہارے رب نے عذاب کا کوڑا بقوت مارا،",
    "احمد علی ": "پھر ان پر تیرے رب نے عذاب کا کوڑا پھینکا",
     "  جالندہری ": "تو تمہارے پروردگار نے ان پر عذاب کا کوڑا نازل کیا",
     "  طاہر القادری": "تو آپ کے رب نے ان پر عذاب کا کوڑا برسایا،",
      "   علامہ جوادی":  "تو پھر خدا نے ان پر عذاب کے کوڑے برسادیئے",
     " محمد جوناگڑھی": "آخر تیرے رب نے ان سب پر عذاب کا کوڑا برسایا",
      " محمد حسین نجفی ":  "تو آپ کے پروردگار نے ان پر عذاب کا کَوڑا برسایا۔",
     "مفتی تقی عثمانی": "چنانچہ تمہارے پروردگار نے ان پر عذاب کا کوڑا برسا دیا ۔"
    },
    {
     "Aya": " ﴾إِنَّ رَبَّكَ لَبِالْمِرْصَادِ ﴿ ١٤   ‎",
     "ابوالاعلی مودودی   ": "حقیقت یہ ہے کہ تمہارا رب گھات لگائے ہوئے ہے",
     "  احمد رضا خان ": "بیشک تمہارے رب کی نظر سے کچھ غائب نہیں،",
    "احمد علی ": "بے شک آپ کا رب تاک میں ہے",
     "  جالندہری ": "بے شک تمہارا پروردگار تاک میں ہے",
     "  طاہر القادری": "بیشک آپ کا رب (سرکشوں اور نافرمانوں کی) خوب تاک میں ہے،",
      "   علامہ جوادی":  "بے شک تمہارا پروردگار ظالموں کی تاک میں ہے",
     " محمد جوناگڑھی": "یقیناً تیرا رب گھات میں ہے",
      " محمد حسین نجفی ":  "بےشک آپ(ص) کا پروردگار (ایسے لوگوں کی) تاک میں ہے۔",
     "مفتی تقی عثمانی": "یقین رکھو تمہارا پروردگار سب کو نظر میں رکھے ہوئے ہے ۔"
    },
    {
     "Aya": " ﴾فَأَمَّا الْإِنسَانُ إِذَا مَا ابْتَلَاهُ رَبُّهُ فَأَكْرَمَهُ وَنَعَّمَهُ فَيَقُولُ رَبِّي أَكْرَمَنِ ﴿١٥‎",
     "ابوالاعلی مودودی   ": "مگر انسان کا حال یہ ہے کہ اس کا رب جب اُس کو آزمائش میں ڈالتا ہے اور اُسے عزت اور نعمت دیتا ہے تو وہ کہتا ہے کہ میرے رب نے مجھے عزت دار بنا دیا",
     "  احمد رضا خان ": "لیکن آدمی تو جب اسے اس کا رب آزمائے کہ اس کو جاہ اور نعمت دے، جب تو کہتا ہے میرے رب نے مجھے عزت دی",
    "احمد علی ": "لیکن انسان تو ایسا ہے کہ جب اسے اس کا رب آزماتا ہے پھر اسے عزت اور نعمت دیتا ہے تو کہتا ہے کہ میرے رب نے مجھے عزت بخشی ہے",
     "  جالندہری ": "مگر انسان (عجیب مخلوق ہے کہ) جب اس کا پروردگار اس کو آزماتا ہے تو اسے عزت دیتا اور نعمت بخشتا ہے۔ تو کہتا ہے کہ (آہا) میرے پروردگار نے مجھے عزت بخشی",
     "  طاہر القادری": "مگر انسان (ایسا ہے) کہ جب اس کا رب اسے (راحت و آسائش دے کر) آزماتا ہے اور اسے عزت سے نوازتا ہے اور اسے نعمتیں بخشتا ہے تو وہ کہتا ہے: میرے رب نے مجھ پر کرم فرمایا،",
      "   علامہ جوادی":  "لیکن انسان کا حال یہ ہے کہ جب خدا نے اس کو اس طرح آزمایا کہ عزّت اور نعمت دے دی تو کہنے لگا کہ میرے رب نے مجھے باعزّت بنایا ہے",
     " محمد جوناگڑھی": "انسان (کا یہ حال ہے کہ) جب اسے اس کا رب آزماتا ہے اور عزت ونعمت دیتا ہے تو وه کہنے لگتا ہے کہ میرے رب نے مجھے عزت دار بنایا",
      " محمد حسین نجفی ":  "لیکن انسان (کا حال یہ ہے کہ) جب اس کا پروردگار اسے آزماتا ہے اور اسے عزت و نعمت دیتا ہے تو وہ کہتا ہے کہ میرے پروردگار نے میری عزت افزائی کی۔",
     "مفتی تقی عثمانی": "لیکن انسان کا حال یہ ہے کہ جب اس کا پروردگار اسے آزماتا ہے اور انعام و اکرام سے نوازتا ہے تو وہ کہتا ہے کہ : میرے پروردگار نے میری عزت کی ہے ۔"
    },
    {
     "Aya": " ﴾وَأَمَّا إِذَا مَا ابْتَلَاهُ فَقَدَرَ عَلَيْهِ رِزْقَهُ فَيَقُولُ رَبِّي أَهَانَنِ  ﴿١٦  ‎‏",
     "ابوالاعلی مودودی   ": "اور جب وہ اُس کو آزمائش میں ڈالتا ہے اور اُس کا رزق اُس پر تنگ کر دیتا ہے تو وہ کہتا ہے کہ میرے رب نے مجھے ذلیل کر دیا",
     "  احمد رضا خان ": "اور اگر آزمائے اور اس کا رزق اس پر تنگ کرے، تو کہتا ہے میرے رب نے مجھے خوار کیا،",
    "احمد علی ": "لیکن جب اسے آزماتا ہے پھر اس پر اس کی روزی تنگ کر تا ہے تو کہتا ہے میرے رب نے مجھے ذلیل کر دیا",
     "  جالندہری ": "اور جب (دوسری طرح) آزماتا ہے کہ اس پر روزی تنگ کر دیتا ہے تو کہتا ہے کہ (ہائے) میرے پروردگار نے مجھے ذلیل کیا",
     "  طاہر القادری": "لیکن جب وہ اسے (تکلیف و مصیبت دے کر) آزماتا ہے اور اس پر اس کا رزق تنگ کرتا ہے تو وہ کہتا ہے: میرے رب نے مجھے ذلیل کر دیا،",
      "   علامہ جوادی":  "اور جب آزمائش کے لئے روزی کو تنگ کردیا تو کہنے لگا کہ میرے پروردگار نے میری توہین کی ہے",
     " محمد جوناگڑھی": "اور جب وه اس کو آزماتا ہے اس کی روزی تنگ کر دیتا ہے تو وه کہنے لگتا ہے کہ میرے رب نے میری اہانت کی (اور ذلیل کیا)",
      " محمد حسین نجفی ":  "اور جب وہ (خدا) اسے اس طرح آزماتا ہے کہ اس کا رزق اس پر تنگ کر دیتا ہے تو وہ کہتا ہے کہ میرے پروردگار نے مجھے ذلیل کر دیا۔",
     "مفتی تقی عثمانی": "اور دوسری طرف جب اسے آزماتا ہے اور اس کے رزق میں تنگی کردیتا ہے تو کہتا ہے کہ : میرے پروردگار نے میری توہین کی ہے ۔"
    },
    {
     "Aya": " ﴾كَلَّا ۖ بَل لَّا تُكْرِمُونَ الْيَتِيمَ ﴿١٧ ‎",
     "ابوالاعلی مودودی   ": "ہرگز نہیں، بلکہ تم یتیم سے عزت کا سلوک نہیں کرتے",
     "  احمد رضا خان ": "یوں نہیں بلکہ تم یتیم کی عزت نہیں کرتے",
    "احمد علی ": "ہرگز نہیں بلکہ تم یتیم کی عزت نہیں کرتے",
     "  جالندہری ": "نہیں بلکہ تم لوگ یتیم کی خاطر نہیں کرتے",
     "  طاہر القادری": "یہ بات نہیں بلکہ (حقیقت یہ ہے کہ عزت اور مال و دولت کے ملنے پر) تم یتیموں کی قدر و اِکرام نہیں کرتے،",
      "   علامہ جوادی":  "ایسا ہرگز نہیں ہے بلکہ تم یتیموں کا احترام نہیں کرتے ہو",
     " محمد جوناگڑھی": "ایسا ہرگز نہیں بلکہ (بات یہ ہے) کہ تم (ہی) لوگ یتیموں کی عزت نہیں کرتے",
      " محمد حسین نجفی ":  "ہرگز نہیں! بلکہ تم لوگ یتیم کی عزت نہیں کرتے۔",
     "مفتی تقی عثمانی": "ہرگز ایسا نہیں چاہیے ۔  صرف یہی نہیں بلکہ تم یتیم کی عزت نہیں کرتے ۔"
    },
    {
     "Aya": "  ﴾وَلَا تَحَاضُّونَ عَلَىٰ طَعَامِ الْمِسْكِينِ ﴿١٨  ‎",
     "ابوالاعلی مودودی   ": "اور مسکین کو کھانا کھلانے پر ایک دوسرے کو نہیں اکساتے",
     "  احمد رضا خان ": "اور آپس میں ایک دوسرے کو مسکین کے کھلانے کی رغبت نہیں دیتے،",
    "احمد علی ": "اور نہ مسکین کو کھانا کھلانے کی ترغیب دیتے ہو",
     "  جالندہری ": "اور نہ مسکین کو کھانا کھلانے کی ترغیب دیتے ہو",
     "  طاہر القادری": "اور نہ ہی تم مسکینوں (یعنی غریبوں اور محتاجوں) کو کھانا کھلانے کی (معاشرے میں) ایک دوسرے کو ترغیب دیتے ہو،",
      "   علامہ جوادی":  "اور لوگوں کو م مسکینوں کے کھانے پر آمادہ نہیں کرتے ہو",
     " محمد جوناگڑھی": "اور مسکینوں کے کھلانے کی ایک دوسرے کو ترغیب نہیں دیتے",
      " محمد حسین نجفی ":  "اور مسکین کو کھانا کھلانے پر ایک دوسرے کو آمادہ نہیں کرتے۔",
     "مفتی تقی عثمانی": "اور مسکینوں کو کھانا کھلانے کی ایک دوسرے کو ترغیب نہیں دیتے ۔"
    },
    {
     "Aya": " ﴾وَتَأْكُلُونَ التُّرَاثَ أَكْلًا لَّمًّا ﴿١٩  ‎‏",
     "ابوالاعلی مودودی   ": "اور میراث کا سارا مال سمیٹ کر کھا جاتے ہو",
     "  احمد رضا خان ": "اور میراث کا مال ہپ ہپ کھاتے ہو",
    "احمد علی ": "اور میت کا ترکہ سب سمیٹ کر کھا جاتے ہو",
     "  جالندہری ": "اور میراث کے مال سمیٹ کر کھا جاتے ہو",
     "  طاہر القادری": "اور وراثت کا سارا مال سمیٹ کر (خود ہی) کھا جاتے ہو (اس میں سے افلاس زدہ لوگوں کا حق نہیں نکالتے)،",
      "   علامہ جوادی":  "اور میراث کے مال کو اکٹھا کرکے حلال و حرام سب کھا جاتے ہو",
     " محمد جوناگڑھی": "اور (مردوں کی) میراث سمیٹ سمیٹ کر کھاتے ہو",
      " محمد حسین نجفی ":  "اور وراثت کا سارا مال (حلال و حرام) سمیٹ کر کھا جاتے ہو۔",
     "مفتی تقی عثمانی": "اور میراث کا مال سمیٹ سمیٹ کر کھا جاتے ہو "
    },
    {
     "Aya": "﴾وَتُحِبُّونَ الْمَالَ حُبًّا جَمًّا ﴿٢٠    ‎",
     "ابوالاعلی مودودی   ": "اور مال کی محبت میں بری طرح گرفتار ہو",
     "  احمد رضا خان ": "اور مال کی نہایت محبت رکھتے ہو",
    "احمد علی ": "اور مال سے بہت زیادہ محبت رکھتے ہو",
     "  جالندہری ": "اور مال کو بہت ہی عزیز رکھتے ہو",
     "  طاہر القادری": "اور تم مال و دولت سے حد درجہ محبت رکھتے ہو،",
      "   علامہ جوادی":  "اور مال دنیا کو بہت دوست رکھتے ہو",
     " محمد جوناگڑھی": "اور مال کو جی بھر کر عزیز رکھتے ہو",
      " محمد حسین نجفی ":  "اورتم مال و منال سے بہت زیادہ محبت کرتے ہو۔",
     "مفتی تقی عثمانی": "اور مال سے بے حد محبت کرتے ہو ۔"
    },
    {
     "Aya": "﴾كَلَّا إِذَا دُكَّتِ الْأَرْضُ دَكًّا دَكًّا ﴿٢١‎‏ ",
     "ابوالاعلی مودودی   ": "ہرگز نہیں، جب زمین پے در پے کوٹ کوٹ کر ریگ زار بنا دی جائے گی",
     "  احمد رضا خان ": "ہاں ہاں جب زمین ٹکرا کر پاش پاش کردی جائے",
    "احمد علی ": "ہرگز نہیں جب زمین کوٹ کوٹ کر ریزہ ریزہ کر دی جائے گی",
     "  جالندہری ": "تو جب زمین کی بلندی کوٹ کوٹ کو پست کر دی جائے گی",
     "  طاہر القادری": "یقیناً جب زمین پاش پاش کر کے ریزہ ریزہ کر دی جائے گی،",
      "   علامہ جوادی":  "یاد رکھو کہ جب زمین کو ریزہ ریزہ کردیا جائے گا",
     " محمد جوناگڑھی": "یقیناً جس وقت زمین کوٹ کوٹ کر برابر کر دی جائے گی",
      " محمد حسین نجفی ":  "ہرگز نہیں! وہ وقت یاد کرو جب زمین کو توڑ کر ریزہ ریزہ کر دیا جائے گا۔",
     "مفتی تقی عثمانی": "ہرگز ایسا نہیں چاہیے ۔ جب زمین کو کوٹ کوٹ کر ریزہ ریزہ کردیا جائے گا ۔"
    },
    {
     "Aya": "﴾وَجَاءَ رَبُّكَ وَالْمَلَكُ صَفًّا صَفًّا ﴿٢٢‎‏",
     "ابوالاعلی مودودی   ": "اور تمہارا رب جلوہ فرما ہوگا اِس حال میں کہ فرشتے صف در صف کھڑے ہوں گے",
     "  احمد رضا خان ": "اور تمہارے رب کا حکم آئے اور فرشتے قطار قطار،",
    "احمد علی ": "اور آپ کے رب کا (تخت) آجائے گا اور فرشتے بھی صف بستہ چلے آئيں گے",
     "  جالندہری ": "اور تمہارا پروردگار (جلوہ فرما ہو گا) اور فرشتے قطار باندھ باندھ کر آ موجود ہوں گے",
     "  طاہر القادری": "اور آپ کا رب جلوہ فرما ہوگا اور فرشتے قطار در قطار (اس کے حضور) حاضر ہوں گے،",
      "   علامہ جوادی":  "اور تمہارے پروردگار کا حکم اور فرشتے صف در صف آجائیں گے",
     " محمد جوناگڑھی": "اور تیرا رب (خود) آجائے گا اور فرشتے صفیں باندھ کر (آ جائیں گے)",
      " محمد حسین نجفی ":  "اور تمہارا پروردگار (یعنی اس کا حکم) آجائے گا اور فرشتے قطار اندر قطار آئیں گے۔",
     "مفتی تقی عثمانی": "اور تمہارا پروردگار اور قطاریں باندھے ہوئے فرشتے ( میدان حشر میں ) آئیں گے "
    },
    {
     "Aya": " ﴾وَجِيءَ يَوْمَئِذٍ بِجَهَنَّمَ ۚ يَوْمَئِذٍ يَتَذَكَّرُ الْإِنسَانُ وَأَنَّىٰ لَهُ الذِّكْرَىٰ ﴿٢٣  ‎‏",
     "ابوالاعلی مودودی   ": "اور جہنم اُس روز سامنے لے آئی جائے گی، اُس دن انسان کو سمجھ آئے گی اور اس وقت اُس کے سمجھنے کا کیا حاصل؟",
     "  احمد رضا خان ": "اور اس دن جہنم لائے جائے اس دن آدمی سوچے گا اور اب اسے سوچنے کا وقت کہاں",
    "احمد علی ": "اوراس دن دوزخ لائی جائے گی اس دن انسان سمجھے گا اور اس وقت اس کو سمجھنا کیا فائدہ دے گا",
     "  جالندہری ": "اور دوزخ اس دن حاضر کی جائے گی تو انسان اس دن متنبہ ہو گا مگر تنبہ (سے) اسے (فائدہ) کہاں (مل سکے گا)",
     "  طاہر القادری": "اور اس دن دوزخ پیش کی جائے گی، اس دن انسان کو سمجھ آجائے گی مگر (اب) اسے نصیحت کہاں (فائدہ مند) ہوگی،",
      "   علامہ جوادی":  "اور جہنمّ کو اس دن سامنے لایا جائے گا تو انسان کو ہوش آجائے گا لیکن اس دن ہوش آنے کا کیا فائدہ",
     " محمد جوناگڑھی": "اور جس دن جہنم بھی ﻻئی جائے گی اس دن انسان کو سمجھ آئے گی مگر آج اس کے سمجھنے کا فائده کہاں؟",
      " محمد حسین نجفی ":  "اور اس دن جہنم (سامنے) لائی جائے گی اور اس دن انسان کو سمجھ آئے گی مگر اب سمجھ آنے کا کیا فائدہ؟",
     "مفتی تقی عثمانی": "اور اس دن جہنم کو سامنے لایا جائے گا ، تو اس دن انسان کو سمجھ آئے گی اور اس وقت سمجھ آنے کا موقع کہاں ہوگا؟ "
    },
    {
     "Aya": "﴾يَقُولُ يَا لَيْتَنِي قَدَّمْتُ لِحَيَاتِي ﴿ ٢٤   ‎",
     "ابوالاعلی مودودی   ": "وہ کہے گا کہ کاش میں نے اپنی اِس زندگی کے لیے کچھ پیشگی سامان کیا ہوتا!",
     "  احمد رضا خان ": "کہے گا ہائے کسی طرح میں نے جیتے جی نیکی آگے بھیجی ہوتی،",
    "احمد علی ": "کہے گا اے کاش میں اپنی زندگی کے لیے کچھ آگے بھیجتا",
     "  جالندہری ": "کہے گا کاش میں نے اپنی زندگی (جاودانی کے لیے) کچھ آگے بھیجا ہوتا",
     "  طاہر القادری": "وہ کہے گا: اے کاش! میں نے اپنی (اس اصل) زندگی کے لئے (کچھ) آگے بھیج دیا ہوتا (جو آج میرے کام آتا)،",
      "   علامہ جوادی":  "انسان کہے گا کہ کاش میں نے اپنی اس زندگی کے لئے کچھ پہلے بھیج دیا ہوتا",
     " محمد جوناگڑھی": "وه کہے گا کہ کاش کہ میں نے اپنی اس زندگی کے لئے کچھ پیشگی سامان کیا ہوتا",
      " محمد حسین نجفی ":  "وہ کہے گا کہ کاش! میں نے اپنی (اس) زندگی کیلئے کچھ آگے بھیجا ہوتا۔",
     "مفتی تقی عثمانی": "وہ کہے گا کہ : کاش ! میں نے اپنی اس زندگی کے لیے کچھ آگے بھیج دیا ہوتا ۔"
    },
    {
     "Aya": "﴾فَيَوْمَئِذٍ لَّا يُعَذِّبُ عَذَابَهُ أَحَدٌ ﴿٢٥",
     "ابوالاعلی مودودی   ": "پھر اُس دن اللہ جو عذاب دے گا ویسا عذاب دینے والا کوئی نہیں",
     "  احمد رضا خان ": "تو اس دن اس کا سا عذاب کوئی نہیں کرتا،",
    "احمد علی ": "پس اس دن اس کا ساعذاب کوئی بھی نہ دے گا",
     "  جالندہری ": "تو اس دن نہ کوئی خدا کے عذاب کی طرح کا (کسی کو) عذاب دے گا",
     "  طاہر القادری": "سو اس دن نہ اس کے عذاب کی طرح کوئی عذاب دے سکے گا،",
      "   علامہ جوادی":  "تو اس دن خدا ویسا عذاب کرے گا جو کسی نے نہ کیا ہوگا",
     " محمد جوناگڑھی": "پس آج اللہ کے عذاب جیسا عذاب کسی کا نہ ہوگا",
      " محمد حسین نجفی ":  "پس اس دن نہ تو خدا کی طرح کوئی عذاب دے گا۔",
     "مفتی تقی عثمانی": "پھر اس دن اللہ کے برابر کوئی عذاب دینے والا نہیں ہوگا ۔"
    },
    {
     "Aya": "﴾وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ ﴿ ٢٦    ‎",
     "ابوالاعلی مودودی   ": "اور اللہ جیسا باندھے گا ویسا باندھنے والا کوئی نہیں",
     "  احمد رضا خان ": "اور اس کا سا باندھنا کوئی نہیں باندھتا،",
    "احمد علی ": "اور نہ اس کے جکڑنے کے برابر کوئی جکڑنے والا ہو گا",
     "  جالندہری ": "اور نہ کوئی ویسا جکڑنا جکڑے گا",
     "  طاہر القادری": "اور نہ اس کے جکڑنے کی طرح کوئی جکڑ سکے گا،",
      "   علامہ جوادی":  "اور نہ اس طرح کسی نے گرفتار کیا ہوگا",
     " محمد جوناگڑھی": "نہ اسکی قید وبند جیسی کسی کی قید وبند ہوگی",
      " محمد حسین نجفی ":  "اور نہ اس کے باندھنے کی طرح کوئی باندھ سکے گا۔",
     "مفتی تقی عثمانی": "اور نہ اس کے جکڑنے کی طرح کوئی جکڑنے والا ہوگا ۔"
    },
    {
     "Aya": " ﴾يَا أَيَّتُهَا النَّفْسُ الْمُطْمَئِنَّةُ ﴿٢٧‎‏",
     "ابوالاعلی مودودی   ": "دوسری طرف ارشاد ہوگا اے نفس مطمئن!",
     "  احمد رضا خان ": "اے اطمینان والی جان",
    "احمد علی ": "ارشاد ہوگا اے اطمینان والی روح",
     "  جالندہری ": "اے اطمینان پانے والی روح!",
     "  طاہر القادری": "اے اطمینان پا جانے والے نفس،",
      "   علامہ جوادی":  "اے نفس مطمئن",
     " محمد جوناگڑھی": "اے اطمینان والی روح",
      " محمد حسین نجفی ":  "ارشاد ہوگا اے نفسِ مطمئن۔",
     "مفتی تقی عثمانی": " البتہ نیک لوگوں سے کہا جائے گا کہ اے وہ جان جو ( اللہ کی اطاعت میں ) چین پاچکی ہے"
    },
    {
     "Aya": "﴾ارْجِعِي إِلَىٰ رَبِّكِ رَاضِيَةً مَّرْضِيَّةً ﴿ ٢٨   ‎",
     "ابوالاعلی مودودی   ": "چل اپنے رب کی طرف، اِس حال میں کہ تو (اپنے انجام نیک سے) خوش (اور اپنے رب کے نزدیک) پسندیدہ ہے",
     "  احمد رضا خان ": "اپنے رب کی طرف واپس ہو یوں کہ تو اس سے راضی وہ تجھ سے راضی،",
    "احمد علی ": "اپنے رب کی طرف لوٹ چل تو اس سے راضی وہ تجھ سے راضی",
     "  جالندہری ": "اپنے پروردگار کی طرف لوٹ چل۔ تو اس سے راضی وہ تجھ سے راضی",
     "  طاہر القادری": "تو اپنے رب کی طرف اس حال میں لوٹ آکہ تو اس کی رضا کا طالب بھی ہو اور اس کی رضا کا مطلوب بھی (گویا اس کی رضا تیری مطلوب ہو اور تیری رضا اس کی مطلوب)،",
      "   علامہ جوادی":  "اپنے رب کی طرف پلٹ آ اس عالم میں کہ تواس سے راضی ہے اور وہ تجھ سے راضی ہے",
     " محمد جوناگڑھی": "تو اپنے رب کی طرف لوٹ چل اس طرح کہ تو اس سے راضی وه تجھ سے خوش",
      " محمد حسین نجفی ":  "تو اس حالت میں اپنے پروردگار کی طرف چل کہ تواس سے راضی ہے اور وہ تجھ سے راضی ہے۔",
     "مفتی تقی عثمانی": "اپنے پروردگار کی طرف اس طرح لوٹ کر آجا کہ تو اس سے راضی ہو ، اور وہ تجھ سے راضی "
    },
    {
     "Aya": " ﴾فَادْخُلِي فِي عِبَادِي ﴿٢٩  ‎‏ ",
     "ابوالاعلی مودودی   ": "شامل ہو جا میرے (نیک) بندوں میں",
     "  احمد رضا خان ": "پھر میرے خاص بندوں میں داخل ہو،",
    "احمد علی ": "پس میرے بندو ں میں شامل ہو",
     "  جالندہری ": "تو میرے (ممتاز) بندوں میں شامل ہو جا",
     "  طاہر القادری": "پس تو میرے (کامل) بندوں میں شامل ہو جا،",
      "   علامہ جوادی":  "پھر میرے بندوں میں شامل ہوجا",
     " محمد جوناگڑھی": "پس میرے خاص بندوں میں داخل ہو جا",
      " محمد حسین نجفی ":  "پس تُو میرے (خاص) بندوں میں داخل ہو جا۔",
     "مفتی تقی عثمانی": "اپنے پروردگار کی طرف اس طرح لوٹ کر آجا کہ تو اس سے راضی ہو ، اور وہ تجھ سے راضی "
    },
    {
     "Aya": " ﴾وَادْخُلِي جَنَّتِي ﴿٣٠",
     "ابوالاعلی مودودی   ": "اور داخل ہو جا میری جنت میں",
     "  احمد رضا خان ": "اور میری جنت میں آ،",
    "احمد علی ": "اور میری جنت میں داخل ہو",
     "  جالندہری ": "اور میری بہشت میں داخل ہو جا",
     "  طاہر القادری": "اور میری جنتِ (قربت و دیدار) میں داخل ہو جا،",
      "   علامہ جوادی":  "اور میری جنت میں داخل ہوجا",
     " محمد جوناگڑھی": "اور میری جنت میں چلی جا",
      " محمد حسین نجفی ":  "اور میری جنت میں داخل ہو جا۔",
     "مفتی تقی عثمانی": "اور داخل ہوجا میری جنت میں ۔"
    }
   ]