[
 {
  "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
   "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
  "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
  "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
  "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
 "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
  "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
  " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
  " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
  "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
 },
 {
  "Aya": " ﴾‏لَا ٓ أُقْسِمُ بِهَٰذَا الْبَلَدِ ﴿١   ‎",
   "ابوالاعلی مودودی ":  "نہیں، میں قسم کھاتا ہوں اِس شہر کی",
  "  احمد رضا خان ":  "مجھے اس شہر کی قسم",
  "احمد علی ": "ا س شہر کی قسم ہے",
  "  جالندہری ": "ہمیں اس شہر (مکہ) کی قسم",
 "  طاہر القادری": "میں اس شہر (مکہ) کی قَسم کھاتا ہوں،",
  "   علامہ جوادی": "میں اس شہر کی قسم کھاتا ہوں",
  " محمد جوناگڑھی": "میں اس شہر کی قسم کھاتا ہوں",
  " محمد حسین نجفی ": "نہیں! میں قَسم کھاتا ہوں اس شہر کی۔",
  "مفتی تقی عثمانی": "میں قسم کھاتا ہوں اس شہر کی ۔"
 },
 {
  "Aya": " ﴾‏وَأَنتَ حِلٌّ بِهَٰذَا الْبَلَدِ ﴿٢‎‏",
   "ابوالاعلی مودودی ":  "اور حال یہ ہے کہ (اے نبیؐ) اِس شہر میں تم کو حلال کر لیا گیا ہے",
  "  احمد رضا خان ":  "کہ اے محبوب! تم اس شہر میں تشریف فرما ہو",
  "احمد علی ": "حالانکہ آپ اس شہر میں مقیم ہیں",
  "  جالندہری ": "اور تم اسی شہر میں تو رہتے ہو",
 "  طاہر القادری": "اے حبیبِ مکرّم! اس لئے کہ آپ اس شہر میں تشریف فرما ہیں٭، ٭ یہ ترجمہ ”لا زائدہ“ کے اعتبار سے ہے۔ لا ”نفئ صحیح“ کے لئے ہو تو ترجمہ یوں ہوگا: میں (اس وقت) اس شہر کی قَسم نہیں کھاؤں گا (اے حبیب!) جب آپ اس شہر سے رخصت ہو جائیں گے۔",
  "   علامہ جوادی": "اور تم اسی شہر میں تو رہتے ہو",
  " محمد جوناگڑھی": "اور آپ اس شہر میں مقیم ہیں",
  " محمد حسین نجفی ": "درآنحالیکہ آپ(ص) اس شہر میں قیام پذیر ہیں۔",
  "مفتی تقی عثمانی": "جبکہ ( اے پیغمبر ) تم اس شہر میں مقیم ہو "
 },
 {
  "Aya": "﴾‏وَوَالِدٍ وَمَا وَلَدَ ﴿٣‎",
   "ابوالاعلی مودودی ":  "اور قسم کھاتا ہوں باپ کی اور اس اولاد کی جو اس سے پیدا ہوئی",
  "  احمد رضا خان ":  "اور تمہارے باپ ابراہیم کی قسم اور اس کی اولاد کی کہ تم ہو",
  "احمد علی ": "اورباپ کی اور اس کی اولاد کی قسم ہے",
  "  جالندہری ": "اور باپ (یعنی آدم) اور اس کی اولاد کی قسم",
 "  طاہر القادری": "اے حبیبِ مکرّم! آپ کے والد (آدم یا ابراہیم علیہما السلام) کی قَسم اور (ان کی) قَسم جن کی ولادت ہوئی٭، ٭ یعنی آدم علیہ السلام کی ذریّتِ صالحہ یا آپ ہی کی ذات گرامی جن کے باعث یہ شہرِ مکہ بھی لائقِ قَسم ٹھہرا ہے۔",
  "   علامہ جوادی": "اور تمہارے باپ آدم علیھ السّلام اور ان کی اولاد کی قسم",
  " محمد جوناگڑھی": "اور (قسم ہے) انسانی باپ اور اوﻻد کی",
  " محمد حسین نجفی ": "اور قَسم کھاتا ہوں باپ (آدم(ع)) کی اوراس کی اولاد کی۔",
  "مفتی تقی عثمانی": "اور ( قسم کھاتا ہوں ) باپ کی اور اس کی اولاد کی"
 },
 {
  "Aya": "﴾‏لَقَدْ خَلَقْنَا الْإِنسَانَ فِي كَبَدٍ ﴿٤‎‏ ",
   "ابوالاعلی مودودی ":  "درحقیقت ہم نے انسان کو مشقت میں پیدا کیا ہے",
  "  احمد رضا خان ":  "بیشک ہم نے آدمی کو مشقت میں رہتا پیدا کیا",
  "احمد علی ": "کہ بےشک ہم نے انسان کو مصیبت میں پیدا کیا ہے",
  "  جالندہری ": "کہ ہم نے انسان کو تکلیف (کی حالت) میں (رہنے والا) بنایا ہے",
 "  طاہر القادری": "بیشک ہم نے انسان کو مشقت میں (مبتلا رہنے والا) پیدا کیا ہے،",
  "   علامہ جوادی": "ہم نے انسان کو مشقت میں رہنے والا بنایا ہے",
  " محمد جوناگڑھی": "یقیناً ہم نے انسان کو (بڑی) مشقت میں پیدا کیا ہے",
  " محمد حسین نجفی ": "یقیناً ہم نے انسان کو محنت و مشقت کیلئے پیدا کیا ہے۔",
  "مفتی تقی عثمانی": "کہ ہم نے انسان کو مشقت میں پیدا کیا ہے "
 },
 {
  "Aya": "﴾‏‏ أَيَحْسَبُ أَن لَّن يَقْدِرَ عَلَيْهِ أَحَدٌ ﴿٥‎‏ ",
   "ابوالاعلی مودودی ":  "کیا اُس نے یہ سمجھ رکھا ہے کہ اُس پر کوئی قابو نہ پا سکے گا؟",
  "  احمد رضا خان ":  "کیا آدمی یہ سمجھتا ہے کہ ہرگز اس پر کوئی قدرت نہیں پائے گا",
  "احمد علی ": "کیا وہ خیال کرتا ہےکہ اس پر کوئی بھی ہرگز قابو نہ پا سکے گا",
  "  جالندہری ": "کیا وہ خیال رکھتا ہے کہ اس پر کوئی قابو نہ پائے گا",
 "  طاہر القادری": "کیا وہ یہ گمان کرتا ہے کہ اس پر ہرگز کوئی بھی قابو نہ پا سکے گا؟،",
  "   علامہ جوادی": "کیا اس کا خیال یہ ہے کہ اس پر کوئی قابو نہ پاسکے گا",
  " محمد جوناگڑھی": "کیا یہ گمان کرتا ہے کہ یہ کسی کے بس میں ہی نہیں؟",
  " محمد حسین نجفی ": "کیا وہ یہ خیال کرتا ہے کہ اس پر کوئی قابو نہ پاسکے گا۔",
  "مفتی تقی عثمانی": "کیا وہ یہ سمجھتا ہے کہ اس پر کسی کا بس نہیں چلے گا؟"
 },
 {
  "Aya": " ﴾‏يَقُولُ أَهْلَكْتُ مَالًا لُّبَدًا ﴿٦  ",
   "ابوالاعلی مودودی ":  "کہتا ہے کہ میں نے ڈھیروں مال اڑا دیا",
  "  احمد رضا خان ":  "کہتا ہے میں نے ڈھیروں مال فنا کردیا",
  "احمد علی ": "کہتا ہے کہ میں نے مال برباد کر ڈالا",
  "  جالندہری ": "کہتا ہے کہ میں نے بہت سا مال برباد کیا",
 "  طاہر القادری": "وہ (بڑے فخر سے) کہتا ہے کہ میں نے ڈھیروں مال خرچ کیا ہے،",
  "   علامہ جوادی": "کہ وہ کہتا ہے کہ میں نے بے تحاشہ صرف کیا ہے",
  " محمد جوناگڑھی": "کہتا (پھرتا) ہے کہ میں نے تو بہت کچھ مال خرچ کر ڈاﻻ",
  " محمد حسین نجفی ": "وہ کہتا ہے کہ میں نے بہت سا مال اڑادیا۔",
  "مفتی تقی عثمانی": "کہتا ہے کہ : میں نے ڈھیروں مال اڑا ڈالا ہے ۔"
 },
 {
  "Aya": "﴾‏أَيَحْسَبُ أَن لَّمْ يَرَهُ أَحَدٌ ﴿٧‎",
   "ابوالاعلی مودودی ":  "کیا وہ سمجھتا ہے کہ کسی نے اُس کو نہیں دیکھا؟",
  "  احمد رضا خان ":  "کیا آدمی یہ سمجھتا ہے کہ اسے کسی نے نہ دیکھا",
  "احمد علی ": "کیا وہ خیال کرتا ہے کہ اسے کسی نے بھی نہیں دیکھا",
  "  جالندہری ": "کیا اسے یہ گمان ہے کہ اس کو کسی نے دیکھا نہیں",
 "  طاہر القادری": "کیا وہ یہ خیال کرتا ہے کہ اسے (یہ فضول خرچیاں کرتے ہوئے) کسی نے نہیں دیکھا،",
  "   علامہ جوادی": "کیا اس کا خیال ہے کہ اس کو کسی نے نہیں دیکھا ہے",
  " محمد جوناگڑھی": "کیا (یوں) سمجھتا ہے کہ کسی نے اسے دیکھا (ہی) نہیں؟",
  " محمد حسین نجفی ": "کیا وہ خیال کرتا ہے کہ اسے کسی نے نہیں دیکھا۔",
  "مفتی تقی عثمانی": "کیا وہ یہ سمجھتا ہے کہ اس کو کسی نے دیکھا نہیں؟"
 },
 {
  "Aya": " ﴾‏لَمْ نَجْعَل لَّهُ عَيْنَيْنِ  ﴿٨  ‎‏",
   "ابوالاعلی مودودی ":  "کیا ہم نے اُسے دو آنکھیں",
  "  احمد رضا خان ":  "کیا ہم نے اس کی دو آنکھیں نہ بنائیں",
  "احمد علی ": "کیا ہم نے اس کے لیے دو آنکھیں نہیں بنائیں",
  "  جالندہری ": "بھلا ہم نےاس کو دو آنکھیں نہیں دیں؟",
 "  طاہر القادری": "کیا ہم نے اس کے لئے دو آنکھیں نہیں بنائیں،",
  "   علامہ جوادی": "کیا ہم نے اس کے لئے دو آنکھیں نہیں قرار دی ہیں",
  " محمد جوناگڑھی": "کیا ہم نے اس کی دو آنکھیں نہیں بنائیں",
  " محمد حسین نجفی ": "کیا ہم نے اس کیلئے دو آنکھیں نہیں بنائیں؟",
  "مفتی تقی عثمانی": "کیا ہم نے اسے دو آنکھیں نہیں دیں؟"
 },
 {
  "Aya": "﴾‏وَلِسَانًا وَشَفَتَيْنِ ﴿٩‎‏",
   "ابوالاعلی مودودی ":  "اور ایک زبان اور دو ہونٹ نہیں دیے؟",
  "  احمد رضا خان ":  "اور زبان اور دو ہونٹ",
  "احمد علی ": "اور زبان اور دو ہونٹ",
  "  جالندہری ": "اور زبان اور دو ہونٹ (نہیں دیئے)",
 "  طاہر القادری": "اور (اسے) ایک زبان اور دو ہونٹ (نہیں دئیے)،",
  "   علامہ جوادی": "اور زبان اور دو ہونٹ بھی",
  " محمد جوناگڑھی": "اور زبان اور ہونٹ (نہیں بنائے)",
  " محمد حسین نجفی ": "اور ایک زبان اور دو ہونٹ؟",
  "مفتی تقی عثمانی": "اور ایک زبان اور دو ہونٹ نہیں دیے؟"
 },
 {
  "Aya": " ﴾‏وَهَدَيْنَاهُ النَّجْدَيْنِ ﴿ ١٠ ‎",
   "ابوالاعلی مودودی ":  "اور دونوں نمایاں راستے اُسے (نہیں) دکھا دیے؟",
  "  احمد رضا خان ":  "اور اسے دو ابھری چیزوں کی راہ بتائی",
  "احمد علی ": "اور ہم نے اسے دونوں راستے دکھائے",
  "  جالندہری ": "یہ چیزیں بھی دیں اور اس کو (خیر و شر کے) دونوں رستے بھی دکھا دیئے",
 "  طاہر القادری": "اور ہم نے اسے (خیر و شر کے) دو نمایاں راستے (بھی) دکھا دیئے،",
  "   علامہ جوادی": "اور ہم نے اسے دونوں راستوں کی ہدایت دی ہے",
  " محمد جوناگڑھی": "ہم نے دکھا دیئے اس کو دونوں راستے",
  " محمد حسین نجفی ": "اور ہم نے اسے دونوں راستے دکھا دئیے ہیں۔",
  "مفتی تقی عثمانی": "اور ہم نے اس کو دونوں راستے بتا دیئے ہیں "
 },
 {
  "Aya": "﴾‏فَلَا اقْتَحَمَ الْعَقَبَةَ ﴿١١ ‎‏ ",
   "ابوالاعلی مودودی ":  "مگر اس نے دشوار گزار گھاٹی سے گزرنے کی ہمت نہ کی",
  "  احمد رضا خان ":  "پھر بے تامل گھاٹی میں نہ کودا",
  "احمد علی ": "پس وہ (دین کی) گھاٹی میں سے نہ ہو کر نکلا",
  "  جالندہری ": "مگر وہ گھاٹی پر سے ہو کر نہ گزرا",
 "  طاہر القادری": "وہ تو (دینِ حق اور عملِ خیر کی) دشوار گزار گھاٹی میں داخل ہی نہیں ہوا،",
  "   علامہ جوادی": "پھر وہ گھاٹی پر سے کیوں نہیں گزرا",
  " محمد جوناگڑھی": "سو اس سے نہ ہو سکا کہ گھاٹی میں داخل ہوتا",
  " محمد حسین نجفی ": "مگر وہ (نیکی کی) دشوار گزار گھاٹی سے نہیں گزرا۔",
  "مفتی تقی عثمانی": "پھر وہ اس گھاٹی میں داخل نہیں ہوسک"
 },
 {
  "Aya": "﴾‏‏ وَمَا أَدْرَاكَ مَا الْعَقَبَةُ ﴿١٢‎‏",
   "ابوالاعلی مودودی ":  "اور تم کیا جانو کہ کیا ہے وہ دشوار گزار گھاٹی؟",
  "  احمد رضا خان ":  "اور تو نے کیا جانا وہ گھاٹی کیا ہے",
  "احمد علی ": "اور آپ کو کیا معلوم کہ وہ گھاٹی کیا ہے",
  "  جالندہری ": "اور تم کیا سمجھے کہ گھاٹی کیا ہے؟",
 "  طاہر القادری": "اور آپ کیا سمجھے ہیں کہ وہ (دینِ حق کے مجاہدہ کی) گھاٹی کیا ہے،",
  "   علامہ جوادی": "اورتم کیا جانو یہ گھاٹی کیا ہے",
  " محمد جوناگڑھی": "اور کیا سمجھا کہ گھاٹی ہے کیا؟",
  " محمد حسین نجفی ": "اور تمہیں کیا معلوم کہ وہ دشوار گزار گھاٹی کیا ہے؟",
  "مفتی تقی عثمانی": "اور تمہیں کیا پتہ کہ وہ گھاٹی کیا ہے ؟"
 },
 {
  "Aya": " ﴾‏فَكُّ رَقَبَةٍ ﴿١٣  ‎",
   "ابوالاعلی مودودی ":  "کسی گردن کو غلامی سے چھڑانا",
  "  احمد رضا خان ":  "کسی بندے کی گردن چھڑانا",
  "احمد علی ": "گردن کا چھوڑانا",
  "  جالندہری ": "کسی (کی) گردن کا چھڑانا",
 "  طاہر القادری": "وہ (غلامی و محکومی کی زندگی سے) کسی گردن کا آزاد کرانا ہے،",
  "   علامہ جوادی": "کسی گردن کا آزاد کرانا",
  " محمد جوناگڑھی": "کسی گردن (غلام لونڈی) کو آزاد کرنا",
  " محمد حسین نجفی ": "وہ کسی گردن کو (غلامی یا قرض سے) چھڑانا۔",
  "مفتی تقی عثمانی": "کسی کی گردن ( غلامی سے ) چھڑا دینا ۔"
 },
 {
  "Aya":  "﴾‏أَوْ إِطْعَامٌ فِي يَوْمٍ ذِي مَسْغَبَةٍ ﴿١٤‎",
   "ابوالاعلی مودودی ":  "یا فاقے کے دن",
  "  احمد رضا خان ":  "یا بھوک کے دن کھانا دینا",
  "احمد علی ": "یا بھوک کے دن میں کھلانا",
  "  جالندہری ": "یا بھوک کے دن کھانا کھلانا",
 "  طاہر القادری": "یا بھوک والے دن (یعنی قحط و اَفلاس کے دور میں غریبوں اور محروم المعیشت لوگوں کو) کھانا کھلانا ہے (یعنی ان کے معاشی تعطل اور ابتلاء کو ختم کرنے کی جدّ و جہد کرنا ہے)،",
  "   علامہ جوادی": "یا بھوک کے دن میں کھانا کھلانا",
  " محمد جوناگڑھی": "یا بھوک والے دن کھانا کھلانا",
  " محمد حسین نجفی ": "یا بھوک کے دن۔",
  "مفتی تقی عثمانی": "یا پھر کسی بھوک والے دن میں کھانا کھلا دینا"
 },
 {
  "Aya": "﴾‏يَتِيمًا ذَا مَقْرَبَةٍ ﴿١٥‎‏",
   "ابوالاعلی مودودی ":  "کسی قریبی یتیم",
  "  احمد رضا خان ":  "رشتہ دار یتیم کو،",
  "احمد علی ": "کسی رشتہ دار یتیم کو",
  "  جالندہری ": "یتیم رشتہ دار کو",
 "  طاہر القادری": "قرابت دار یتیم کو،",
  "   علامہ جوادی": "کسی قرابتدار یتیم کو",
  " محمد جوناگڑھی": "کسی رشتہ دار یتیم کو",
  " محمد حسین نجفی ": "کسی یتیم رشتہ دار کو۔",
  "مفتی تقی عثمانی": "کسی رشتہ دار یتیم کو ۔"
 },
 {
  "Aya": " ﴾‏أَوْ مِسْكِينًا ذَا مَتْرَبَةٍ ﴿١٦‎‏ ",
   "ابوالاعلی مودودی ":  "یا خاک نشین مسکین کو کھانا کھلانا",
  "  احمد رضا خان ":  "یا خاک نشین مسکین کو",
  "احمد علی ": "یا کسی خاک نشین مسکین کو",
  "  جالندہری ": "یا فقیر خاکسار کو",
 "  طاہر القادری": "یا شدید غربت کے مارے ہوئے محتاج کو جو محض خاک نشین (اور بے گھر) ہے،",
  "   علامہ جوادی": "یا خاکسار مسکین کو",
  " محمد جوناگڑھی": "یا خاکسار مسکین کو",
  " محمد حسین نجفی ": "یاخاکسار مسکین کو کھانا کھلانا۔",
  "مفتی تقی عثمانی": "یا کسی مسکین کو جو مٹی میں رل رہا ہو ۔"
 },
 {
  "Aya": " ﴾‏ثُمَّ كَانَ مِنَ الَّذِينَ آمَنُوا وَتَوَاصَوْا بِالصَّبْرِ وَتَوَاصَوْا بِالْمَرْحَمَةِ ﴿١٧  ‎",
   "ابوالاعلی مودودی ":  "پھر (اس کے ساتھ یہ کہ) آدمی اُن لوگوں میں شامل ہو جو ایمان لائے اور جنہوں نے ایک دوسرے کو صبر اور (خلق خدا پر) رحم کی تلقین کی",
  "  احمد رضا خان ":  "پھر ہو ان سے جو ایمان لائے اور انہوں نے آپس میں صبر کی وصیتیں کیں اور آپس میں مہربانی کی وصیتیں کیں",
  "احمد علی ": "پھر وہ ان میں سے ہو جو ایمان لائے اور انہوں نے ایک دوسرے کو صبر کی وصیت کی اور رحم کرنے کی وصیت کی",
  "  جالندہری ": "پھر ان لوگوں میں بھی (داخل) ہو جو ایمان لائے اور صبر کی نصیحت اور (لوگوں پر) شفقت کرنے کی وصیت کرتے رہے",
 "  طاہر القادری": "پھر (شرط یہ ہے کہ ایسی جدّ و جہد کرنے والا) وہ شخص ان لوگوں میں سے ہو جو ایمان لائے ہیں اور ایک دوسرے کو صبر و تحمل کی نصیحت کرتے ہیں اور باہم رحمت و شفقت کی تاکید کرتے ہیں،",
  "   علامہ جوادی": "پھر وہ ان لوگوں میں شامل ہوجاتا جو ایمان لائے اور انہوں نے صبر اور مرحمت کی ایک دوسرے کو نصیحت کی",
  " محمد جوناگڑھی": "پھر ان لوگوں میں سے ہو جاتا جو ایمان ﻻتے اور ایک دوسرے کو صبر کی اور رحم کرنے کی وصیت کرتے ہیں",
  " محمد حسین نجفی ": "پھر وہ ان لوگوں میں سے بھی ہوتا جو ایمان لائے اور ایک دوسرے کو صبر کرنے اور رحم کرنے کی وصیت کی۔",
  "مفتی تقی عثمانی": "پھر وہ ان لوگوں میں بھی شامل نہ ہوا جو ایمان لائے ہیں ، اور جنہوں نے دیکد وسرے کو ثابت قدمی کی تاکید کی ہے ، اور ایک دوسرے کو رحم کھانے کی تاکید کی ہے"
 },
 {
  "Aya": " ﴾‏أُولَٰئِكَ أَصْحَابُ الْمَيْمَنَةِ ﴿١٨  ‎",
   "ابوالاعلی مودودی ":  "یہ لوگ ہیں دائیں بازو والے",
  "  احمد رضا خان ":  "یہ دہنی طرف والے ہیں",
  "احمد علی ": "یہی لوگ دائیں والے ہیں",
  "  جالندہری ": "یہی لوگ صاحب سعادت ہیں",
 "  طاہر القادری": "یہی لوگ دائیں طرف والے (یعنی اہلِ سعادت و مغفرت) ہیں،",
  "   علامہ جوادی": "یہی لوگ خو ش نصیبی والے ہیں",
  " محمد جوناگڑھی": "یہی لوگ ہیں دائیں بازو والے (خوش بختی والے)",
  " محمد حسین نجفی ": "یہی لوگ داہنے (ہاتھ) والے ہیں۔",
  "مفتی تقی عثمانی": "یہی وہ لوگ ہیں جو بڑے نصیب والے ہیں"
 },
 {
  "Aya": " ﴾‏وَالَّذِينَ كَفَرُوا بِآيَاتِنَا هُمْ أَصْحَابُ الْمَشْأَمَةِ ﴿١٩‎‏",
   "ابوالاعلی مودودی ":  "اور جنہوں نے ہماری آیات کو ماننے سے انکار کیا وہ بائیں بازو والے ہیں",
  "  احمد رضا خان ":  "اور جنہوں نے ہماری آیتوں سے کفر کیا وہ بائیں طرف والے",
  "احمد علی ": "اور جنہوں نے ہماری آیتوں سے انکار کیا وہی بائیں والے ہیں",
  "  جالندہری ": "اور جنہوں نے ہماری آیتوں کو نہ مانا وہ بدبخت ہیں",
 "  طاہر القادری": "اور جن لوگوں نے ہماری آیتوں کا انکار کیا وہ بائیں طرف والے ہیں (یعنی اہلِ شقاوت و عذاب) ہیں،",
  "   علامہ جوادی": "اور جن لوگوں نے ہماری آیات سے انکار کیا ہے وہ بد بختی والے ہیں",
  " محمد جوناگڑھی": "اور جن لوگوں نے ہماری آیتوں کے ساتھ کفر کیا یہ کم بختی والے ہیں",
  " محمد حسین نجفی ": "اور جن لوگوں نے ہماری آیتوں کا انکار کیا وہ بائیں (ہاتھ والے ہیں)۔",
  "مفتی تقی عثمانی": "اور جن لوگوں نے ہماری آیتوں کا انکار کیا ہے ، وہ نحوست والے لوگ ہیں ۔ "
 },
 {
  "Aya": " ﴾‏عَلَيْهِمْ نَارٌ مُّؤْصَدَةٌ ﴿٢٠  ‎‏",
   "ابوالاعلی مودودی ":  "ان پر آگ چھائی ہوئی ہوگی",
  "  احمد رضا خان ":  "ان پر آگ ہے کہ اس میں ڈال کر اوپر سے بند کردی گئی",
  "احمد علی ": "انہیں پر چاروں طرف سے بند کی ہوئی آگ ہے",
  "  جالندہری ": "یہ لوگ آگ میں بند کر دیئے جائیں گے",
 "  طاہر القادری": "ان پر (ہر طرف سے) بند کی ہوئی آگ (چھائی) ہوگی،",
  "   علامہ جوادی": "انہیں آگ میں ڈال کر اسے ہر طرف سے بند کردیا جائے گا",
  " محمد جوناگڑھی": "انہی پر آگ ہوگی جو چاروں طرف سے گھیری ہوئی ہوگی",
  " محمد حسین نجفی ": "ان پر چَو طرفہ بند کی ہوئی آگ محیط ہوگی۔",
  "مفتی تقی عثمانی": "ان پر ایسی آگ مسلط ہوگی جو جو ان پر بند کردی جائے گی "
 }
]
