[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
    "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏وَالسَّمَاءِ ذَاتِ الْبُرُوجِ ﴿١‎‏",
    "ابوالاعلی مودودی ": "قسم ہے مضبوط قلعوں والے آسمان کی",
      "  احمد رضا خان ": "قسم آسمان کی، جس میں برج ہیں",
       "احمد علی ": "آسمان کی قسم ہے جس میں برج ہیں",
      "  جالندہری ": "آسمان کی قسم جس میں برج ہیں",
      "  طاہر القادری": "برجوں (یعنی کہکشاؤں) والے آسمان کی قَسم،",
      "   علامہ جوادی": "برجوں والے آسمان کی قسم",
      " محمد جوناگڑھی": "برجوں والے آسمان کی قسم!",
      " محمد حسین نجفی ": "قَسم ہے بُرجوں (قلعوں) والے آسمان کی۔",
      "مفتی تقی عثمانی": "قسم ہے برجوں والے آسمان کی ۔"
     },
     {
      "Aya": "﴾‏وَالْيَوْمِ الْمَوْعُودِ ﴿٢‎‏ ",
    "ابوالاعلی مودودی ": "اور اُس دن کی جس کا وعدہ کیا گیا ہے",
      "  احمد رضا خان ": "اور اس دن کی جس کا وعدہ ہے",
       "احمد علی ": "اوراس دن کی جس کا وعدہ کیا گیا ہے",
      "  جالندہری ": "اور اس دن کی جس کا وعدہ ہے",
      "  طاہر القادری": "اور اس دن کی قَسم جس کا وعدہ کیا گیا ہے،",
      "   علامہ جوادی": "اور اس دن کی قسم جس کا وعدہ دیا گیا ہے",
      " محمد جوناگڑھی": "وعده کیے ہوئے دن کی قسم!",
      " محمد حسین نجفی ": "اور وعدہ کئے گئے دن (قیامت) کی۔",
      "مفتی تقی عثمانی": "اور اس دن کی جس کا وعدہ کیا گیا ہے"
     },
     {
      "Aya": "﴾‏وَشَاهِدٍ وَمَشْهُودٍ ﴿٣‎‏ ",
    "ابوالاعلی مودودی ": "اور دیکھنے والے کی اور دیکھی جانے والی چیز کی",
      "  احمد رضا خان ": "اور اس دن کی جو گواہ ہے اور اس دن کی جس میں حاضر ہوتے ہیں",
       "احمد علی ": "اور اس دن کی جو حاضر ہوتا ہے اور اس کی جس کے پاس حاضر ہوتے ہیں",
      "  جالندہری ": "اور حاضر ہونے والے کی اور جو اس کے پاس حاضر کیا جائے اسکی",
      "  طاہر القادری": "جو (اس دن) حاضر ہوگا اس کی قَسم اور جو کچھ حاضر کیا جائے گا اس کی قَسم،",
      "   علامہ جوادی": "اور گواہ اور جس کی گواہی دی جائے گی اس کی قسم",
      " محمد جوناگڑھی": "حاضر ہونے والے اور حاضر کئے گئے کی قسم!",
      " محمد حسین نجفی ": "اور گواہ کی قَسم اور اس چیز کی جس کی گواہی دی جائے گی۔",
      "مفتی تقی عثمانی": "اور حاضر ہونے والے کی اور اس کی جس کے پاس لوگ حاضر ہوں"
     },
     {
      "Aya": "  ﴾‏قُتِلَ أَصْحَابُ الْأُخْدُودِ ﴿٤   ‎",
    "ابوالاعلی مودودی ": "کہ مارے گئے گڑھے والے",
      "  احمد رضا خان ": "کھائی والوں پر لعنت ہو",
       "احمد علی ": "خندقوں والے ہلاک ہوئے",
      "  جالندہری ": "کہ خندقوں (کے کھودنے) والے ہلاک کر دیئے گئے",
      "  طاہر القادری": "خندقوں والے (لوگ) ہلاک کر دیے گئے،",
      "   علامہ جوادی": "اصحاب اخدود ہلاک کردیئے گئے",
      " محمد جوناگڑھی": " خندقوں والے ہلاک کیے گئے",
      " محمد حسین نجفی ": "غارت ہوئے خندق والے۔",
      "مفتی تقی عثمانی": "کہ خدا کی مار ہے ان خندق ( کھودنے ) والوں پر "
     },
     {
      "Aya": " ﴾‏النَّارِ ذَاتِ الْوَقُودِ ﴿٥ ‎‏",
    "ابوالاعلی مودودی ": "اُس گڑھے والے جس میں خوب بھڑکتے ہوئے ایندھن کی آگ تھی",
      "  احمد رضا خان ": "اس بھڑکتی آ گ والے،",
       "احمد علی ": "جس میں آگ تھی بہت ایندھن والی",
      "  جالندہری ": "یعنی آگ (کی خندقیں) جس میں ایندھن (جھونک رکھا) تھا",
      "  طاہر القادری": "یعنی اس بھڑکتی آگ (والے) جو بڑے ایندھن سے (جلائی گئی) تھی،",
      "   علامہ جوادی": "آگ سے بھری ہوئی خندقوں والے",
      " محمد جوناگڑھی": "وه ایک آگ تھی ایندھن والی",
      " محمد حسین نجفی ": "جس میں بھڑکتے ہوئے ایندھن والی آگ تھی",
      "مفتی تقی عثمانی": "اس آگ والوں پر جو ایندھن سے بھری ہوئی تھی "
     },
     {
      "Aya": " ﴾‏إِذْ هُمْ عَلَيْهَا قُعُودٌ ﴿٦  ‎",
    "ابوالاعلی مودودی ": "جبکہ وہ اُس گڑھے کے کنارے بیٹھے ہوئے تھے",
      "  احمد رضا خان ": "جب وہ اس کے کناروں پر بیٹھے تھے",
       "احمد علی ": "جب کہ وہ اس کے کنارو ں پر بیٹھے ہوئے تھے",
      "  جالندہری ": "جب کہ وہ ان (کے کناروں) پر بیٹھے ہوئے تھے",
      "  طاہر القادری": "جب وہ اس کے کناروں پر بیٹھے تھے،",
      "   علامہ جوادی": "جن میں آگ بھرے بیٹھے ہوئے تھے",
      " محمد جوناگڑھی": "جب کہ وه لوگ اس کے آس پاس بیٹھے تھے",
      " محمد حسین نجفی ": "جب کہ وہ اس (خندق) کے کنارے پر بیٹھے ہوئے تھے۔",
      "مفتی تقی عثمانی": "جب وہ اس کے پاس بیٹھے تھے "
     },
     {
      "Aya": " ﴾‏وَهُمْ عَلَىٰ مَا يَفْعَلُونَ بِالْمُؤْمِنِينَ شُهُودٌ ﴿٧  ‎‏",
    "ابوالاعلی مودودی ": "اور جو کچھ وہ ایمان لانے والوں کے ساتھ کر رہے تھے اُسے دیکھ رہے تھے",
      "  احمد رضا خان ": "اور وه خد گواه ہیں جو کہ مسلما نوں کے ساتھ کر رہے تھے",
       "احمد علی ": "اور وہ ایمانداروں سے جو کچھ کر رہے تھے اس کو دیکھ رہے تھے",
      "  جالندہری ": "اور جو (سختیاں) اہل ایمان پر کر رہے تھے ان کو سامنے دیکھ رہے تھے",
      "  طاہر القادری": "اور وہ خود گواہ ہیں جو کچھ وہ اہلِ ایمان کے ساتھ کر رہے تھے (یعنی انہیں آگ میں پھینک پھینک کر جلا رہے تھے)،",
      "   علامہ جوادی": "اور وہ مومنین کے ساتھ جو سلوک کررہے تھے خود ہی اس کے گواہ بھی ہیں",
      " محمد جوناگڑھی": "اور مسلمانوں کے ساتھ جو کر رہے تھے اس کو اپنے سامنے دیکھ رہے تھے",
      " محمد حسین نجفی ": "اور وہ جو کچھ اہلِ ایمان کے ساتھ کر رہے تھے اس کو دیکھ رہے تھے۔",
      "مفتی تقی عثمانی": "اور وہ ایمان والوں کے ساتھ جو کچھ کر رہے تھے ، اس کا نظارہ کرتے جاتے تھے "
     },
     {
      "Aya": " ﴾‏وَمَا نَقَمُوا مِنْهُمْ إِلَّا أَن يُؤْمِنُوا بِاللَّهِ الْعَزِيزِ الْحَمِيدِ ﴿٨   ‎",
    "ابوالاعلی مودودی ": "اور اُن اہل ایمان سے اُن کی دشمنی اِس کے سوا کسی وجہ سے نہ تھی کہ وہ اُس خدا پر ایمان لے آئے تھے جو زبردست اور اپنی ذات میں آپ محمود ہے",
      "  احمد رضا خان ": "اور انھیں مسلمانوں کا کیا برا لگا یہی نہ کے وہ ایمان لا ئے اللہ والے سب خو بیوں سرا ہے پر،",
       "احمد علی ": "اور ان سے اسی کا توبدلہ لے رہے تھے کہ وہ الله زبردست خوبیوں والے پر ایمان لائے تھے",
      "  جالندہری ": "ان کو مومنوں کی یہی بات بری لگتی تھی کہ وہ خدا پر ایمان لائے ہوئے تھے جو غالب (اور) قابل ستائش ہے",
      "  طاہر القادری": "اور انہیں ان (مومنوں) کی طرف سے اور کچھ (بھی) ناگوار نہ تھا سوائے اس کے کہ وہ اللہ پر ایمان لے آئے تھے جو غالب (اور) لائقِ حمد و ثنا ہے،",
      "   علامہ جوادی": "اور انہوں نے ان سے صرف اس بات کا بدلہ لیا ہے کہ وہ خدائے عزیز و حمید پر ایمان لائے تھے",
      " محمد جوناگڑھی": "یہ لوگ ان مسلمانوں (کے کسی اور گناه کا) بدلہ نہیں لے رہے تھے، سوائے اس کے کہ وه اللہ غالب ﻻئق حمد کی ذات پر ایمان ﻻئے تھے",
      " محمد حسین نجفی ": "اورانہوں نے اہلِ ایمان کی کسی چیز کو ناپسند نہیں کیا (اور ان میں کوئی عیب نظر نہیں آیا) سوائے اس کے کہ وہ اللہ پر ایمان لائے جو غالب ہے (اور) سزاوارِ ستائش ہے۔",
      "مفتی تقی عثمانی": "اور وہ ایمان والوں کو کسی اور بات کی نہیں ، صرف اس بات کی سزا دے رہے تھے کہ وہ اس اللہ پر ایمان لے آئے تھے جو بڑے اقتدار والا ، بہت قابل تعریف ہے ۔"
     },
     {
      "Aya": "﴾‏الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ ﴿٩‎",
    "ابوالاعلی مودودی ": "جو آسمانوں اور زمین کی سلطنت کا مالک ہے، اور وہ خدا سب کچھ دیکھ رہا ہے",
      "  احمد رضا خان ": "کے اس کے لئے آسمانوں اور زمین کی سلطنت ہے اور اللہ ہر چیز پر گواه ہے،",
       "احمد علی ": "وہ کہ جس کے قبضہ میں آسمان اور زمین ہیں اور الله ہر چیز پر شاہد ہے",
      "  جالندہری ": "وہی جس کی آسمانوں اور زمین میں بادشاہت ہے۔ اور خدا ہر چیز سے واقف ہے",
      "  طاہر القادری": "جس کے لئے آسمانوں اور زمین کی (ساری) بادشاہت ہے، اور اللہ ہر چیز پر گواہ ہے،",
      "   علامہ جوادی": "وہ خدا جس کے اختیار میں آسمان و زمین کا سارا ملک ہے اور وہ ہر شے کا گواہ اور نگراں بھی ہے",
      " محمد جوناگڑھی": "جس کے لئے آسمان وزمین کا ملک ہے۔ اور اللہ تعالیٰ کے سامنے ہے ہر چیز",
      " محمد حسین نجفی ": "وہ جس کی آسمانوں اور زمین میں بادشاہی ہے اور ہر چیز پر گواہ ہے۔",
      "مفتی تقی عثمانی": "جس کے قبضے میں سارے آسمانوں اور زمین کی سلطنت ہے ۔ اور اللہ ہر چیز کو دیکھ رہا ہے ۔"
     },
     {
      "Aya": " ﴾‏إِنَّ الَّذِينَ فَتَنُوا الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ثُمَّ لَمْ يَتُوبُوا فَلَهُمْ عَذَابُ جَهَنَّمَ وَلَهُمْ عَذَابُ الْحَرِيقِ ﴿١٠ ‎",
    "ابوالاعلی مودودی ": "جن لوگوں نے مومن مردوں اور عورتوں پر ظلم و ستم توڑا اور پھر اس سے تائب نہ ہوئے، یقیناً اُن کے لیے جہنم کا عذاب ہے اور ان کے لیے جلائے جانے کی سزا ہے",
      "  احمد رضا خان ": "بے شک جنھو ں نے ایذا دی مسلمان مردوں اور مسلمان عورتوں کو پھر تو بہ نہ کی ان کے لئے جہنم کا عذاب ہے اور ان کے لئے آگ کا عذاب",
       "احمد علی ": "بے شک جنہوں نے ایمان دار مردوں اور ایمان دار عورتوں کو ستایا پھر توبہ نہ کی تو ان کے لیے جہنم کا عذاب ہے اور ان کے لیے جلانے والا عذاب ہے",
      "  جالندہری ": "جن لوگوں نے مومن مردوں اور مومن عورتوں کو تکلیفیں دیں اور توبہ نہ کی ان کو دوزخ کا (اور) عذاب بھی ہوگا اور جلنے کا عذاب بھی ہوگا",
      "  طاہر القادری": "بیشک جن لوگوں نے مومن مردوں اور مومن عورتوں کو اذیت دی پھر توبہ (بھی) نہ کی تو ان کے لئے عذابِ جہنم ہے اور ان کے لئے (بالخصوص) آگ میں جلنے کا عذاب ہے،",
      "   علامہ جوادی": "بے شک جن لوگوں نے ایماندار مردوں اور عورتوں کو ستایا اور پھر توبہ نہ کی ان کے لئے جہنمّ کا عذاب ہے اور ان کے لئے جلنے کا عذاب بھی ہے",
      " محمد جوناگڑھی": "بیشک جن لوگوں نے مسلمان مردوں اور عورتوں کو ستایا پھر توبہ (بھی) نہ کی تو ان کے لئے جہنم کا عذاب ہے اور جلنے کا عذاب ہے",
      " محمد حسین نجفی ": "جن لوگوں نے مؤمن مردوں اور مؤمن عورتوں پر ظلم و ستم کیا اور پھر توبہ بھی نہ کی تو ان کیلئے جہنم کا عذاب ہے اور آگ سے جلنے کی سزا ہے۔",
      "مفتی تقی عثمانی": "یقین ‌ركھو ‌جن ‌لوگوں ‌نے ‌مومن ‌مردوں ‌اور ‌مومن ‌عورتوں ‌كو ‌ظلم ‌كا ‌نشانہ ‌بنایا ‌ہے ، ‌پھر ‌توبہ ‌نہیں ‌كی ‌ہے ، ‌ان ‌كے ‌لیے ‌جہنم ‌كا ‌عذاب ‌ہے ، ‌اور ‌ان ‌كو ‌آگ ‌میں ‌جلنے ‌كی ‌سزا ‌دی ‌جائے ‌گی ‌"
     },
     {
      "Aya":  "﴾‏إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۚ ذَٰلِكَ الْفَوْزُ الْكَبِيرُ ﴿١١    ‎‏",
    "ابوالاعلی مودودی ": "جو لوگ ایمان لائے اور جنہوں نے نیک عمل کیے، یقیناً اُن کے لیے جنت کے باغ ہیں جن کے نیچے نہریں بہتی ہوں گی، یہ ہے بڑی کامیابی",
      "  احمد رضا خان ": "بے شک جو ایما ن لائے اور اچھے کام کئے ان کے لئے باغ ہیں جن کے نیچے نہریں رواں یہی بڑی کامیابی ہے،",
       "احمد علی ": "بے شک جو لوگ ایمان لائے اور انہوں نے نیک کام بھی کیے ان کے لیے باغ ہیں جن کے نیچے نہریں بہتی ہوں گی یہی بڑی کامیابی ہے",
      "  جالندہری ": " جو لوگ ایمان لائے اور نیک کام کرتے رہے ان کے لیے باغات ہیں جن کے نیچے نہریں بہہ رہی ہیں۔ یہ ہی بڑی کامیابی ہے",
      "  طاہر القادری": "بیشک جو لوگ ایمان لائے اور نیک عمل کرتے رہے ان کے لئے جنتیں ہیں جن کے نیچے سے نہریں جاری ہیں، یہی بڑی کامیابی ہے",
      "   علامہ جوادی": "بے شک جو لوگ ایمان لے آئے اور انہوں نے نیک اعمال کئے ان کے لئے وہ جنتیں ہیں جن کے نیچے نہریں جاری ہوں گی اور یہ بہت بڑی کامیابی ہے",
      " محمد جوناگڑھی": "بیشک ایمان قبول کرنے والوں اور نیک کام کرنے والوں کے لئے وه باغات ہیں۔ جن کے نیچے بہریں بہہ رہی ہیں۔ یہی بڑی کامیابی ہے",
      " محمد حسین نجفی ": "بےشک جو لوگ ایمان لائے اور نیک عمل کئے ان کیلئے (جنت کے) باغ ہیں جن کے نیچے نہریں جاری ہیں یہ بڑی کامیابی ہے۔",
      "مفتی تقی عثمانی": "جو لوگ ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں ، ان کے لیے بیشک ( جنت کے ) ایسے باغات ہیں جن کے نیچے نہریں بہتی ہیں ۔ یہ ہے بڑی کامیابی ۔"
     },
     {
      "Aya": " ﴾‏إِنَّ بَطْشَ رَبِّكَ لَشَدِيدٌ ﴿١٢  ‎‏",
    "ابوالاعلی مودودی ": "درحقیقت تمہارے رب کی پکڑ بڑی سخت ہے",
      "  احمد رضا خان ": "بے شک تیرے رب کی گرفت بہت سخت ہے",
       "احمد علی ": "بے شک تیرے رب کی پکڑ بھی سخت ہے",
      "  جالندہری ": "بےشک تمہارے پروردگار کی پکڑ بڑی سخت ہے",
      "  طاہر القادری": "بیشک آپ کے رب کی پکڑ بہت سخت ہے،",
      "   علامہ جوادی": "بے شک آپ کے پروردگار کی پکڑ بہت سخت ہوتی ہے",
      " محمد جوناگڑھی": "یقیناً تیرے رب کی پکڑ بڑی سخت ہے",
      " محمد حسین نجفی ": "بےشک تمہارے پروردگار کی گرفت بڑی سخت ہے۔",
      "مفتی تقی عثمانی": "حقیقت یہ ہے کہ تمہارے پروردگار کی پکڑ بہت سخت ہے"
     },
     {
      "Aya": "﴾‏إِنَّهُ هُوَ يُبْدِئُ وَيُعِيدُ ﴿١٣ ‎",
    "ابوالاعلی مودودی ": "وہی پہلی بار پیدا کرتا ہے اور وہی دوبارہ پیدا کرے گا",
      "  احمد رضا خان ": "بے شک وه پہلے اور پھر کرے",
       "احمد علی ": "بے شک وہی پہلے پیدا کرتا ہے اور دوبارہ پیدا کرے گا",
      "  جالندہری ": "وہی پہلی دفعہ پیدا کرتا ہے اور وہی دوبارہ (زندہ) کرے گا",
      "  طاہر القادری": "بیشک وہی پہلی بار پیدا فرماتا ہے اور وہی دوبارہ پیدا فرمائے گا،",
      "   علامہ جوادی": "وہی پیدا کرنے والا اور دوبارہ ایجاد کرنے والا ہے",
      " محمد جوناگڑھی": "وہی پہلی مرتبہ پیدا کرتا ہے اور وہی دوباره پیدا کرے گا",
      " محمد حسین نجفی ": "وہی پہلی بار پیدا کرنے والا ہے اور وہی دوبارہ پیدا کرے گا۔",
      "مفتی تقی عثمانی": "وہی پہلی مرتبہ پیدا کرتا ہے اور وہی دوبارہ پیدا کرے گا "
     },
     {
      "Aya": "﴾‏وَهُوَ الْغَفُورُ الْوَدُودُ ﴿١٤‎‏",
    "ابوالاعلی مودودی ": "اور وہ بخشنے والا ہے، محبت کرنے والا ہے",
      "  احمد رضا خان ": "اور وہی ہے بخشنے والا اپنے نیک بندوں پر پیارا،",
       "احمد علی ": "اور وہی ہے بخشنے والا محبت کرنے والا",
      "  جالندہری ": "اور وہ بخشنے والا اور محبت کرنے والا ہے",
      "  طاہر القادری": "اور وہ بڑا بخشنے والا بہت محبت فرمانے والا ہے،",
      "   علامہ جوادی": "وہی بہت بخشنے والا اور محبت کرنے والا ہے",
      " محمد جوناگڑھی": "وه بڑا بخشش کرنے واﻻ اور بہت محبت کرنے واﻻ ہے",
      " محمد حسین نجفی ": "وہ بڑا بخشنے والا (اور) بڑا محبت کرنے والا ہے۔",
      "مفتی تقی عثمانی": "اور وہ بہت بخشنے والا ، بہت محبت کرنے والا ہے ۔"
     },
     {
      "Aya": "  ﴾‏ذُو الْعَرْشِ الْمَجِيدُ ﴿١٥     ‎‏",
    "ابوالاعلی مودودی ": "عرش کا مالک ہے، بزرگ و برتر ہے",
      "  احمد رضا خان ": "عزت والے عرش کا مالک،",
       "احمد علی ": "عرش کا مالک بڑی شان والا",
      "  جالندہری ": "عرش کا مالک بڑی شان والا",
      "  طاہر القادری": "مالکِ عرش (یعنی پوری کائنات کے تختِ اقتدار کا مالک) بڑی شان والا ہے،",
      "   علامہ جوادی": "وہ صاحبِ عرش مجید ہے",
      " محمد جوناگڑھی": "عرش کا مالک عظمت واﻻ ہے",
      " محمد حسین نجفی ": "وہ عرش کامالک (اور) بڑی شان والا ہے۔",
      "مفتی تقی عثمانی": "عرش کا مالک ہے ، بزرگی والا ہے ۔"
     },
     {
      "Aya": "﴾‏فَعَّالٌ لِّمَا يُرِيدُ ﴿١٦‎‏",
    "ابوالاعلی مودودی ": "اور جو کچھ چاہے کر ڈالنے والا ہے",
      "  احمد رضا خان ": "ہمیشہ جو چاہے کہ لینے والا،",
       "احمد علی ": "جو چاہے کرنے والا",
      "  جالندہری ": "جو چاہتا ہے کر دیتا ہے",
      "  طاہر القادری": "وہ جو بھی ارادہ فرماتا ہے (اسے) خوب کر دینے والا ہے،",
      "   علامہ جوادی": "جو چاہتا ہے کرسکتا ہے",
      " محمد جوناگڑھی": "جو چاہے اسے کر گزرنے واﻻ ہے",
      " محمد حسین نجفی ": "وہ جو چاہتا ہے وہ کر گزرتا ہے۔",
      "مفتی تقی عثمانی": "جو کچھ ارادہ کرتا ہے کر گذرتا ہے ۔"
     },
     {
      "Aya": "﴾‏هَلْ أَتَاكَ حَدِيثُ الْجُنُودِ ﴿١٧‎",
    "ابوالاعلی مودودی ": "کیا تمہیں لشکروں کی خبر پہنچی ہے؟",
      "  احمد رضا خان ": "کیا تمھارے پاس لشکروں کے بات آئی",
       "احمد علی ": "کیا آپ کے پاس لشکروں کا حال پہنچا",
      "  جالندہری ": "بھلا تم کو لشکروں کا حال معلوم ہوا ہے",
      "  طاہر القادری": "کیا آپ کے پاس لشکروں کی خبر پہنچی ہے،",
      "   علامہ جوادی": "کیا تمہارے پاس لشکروں کی خبر آئی ہے",
      " محمد جوناگڑھی": "تجھے لشکروں کی خبر بھی ملی ہے؟",
      " محمد حسین نجفی ": "کیا تمہیں لشکروں کی خبر پہنچی ہے؟",
      "مفتی تقی عثمانی": "کیا تمہارے پاس ان لشکروں کی خبر پہنچی ہے ۔"
     },
     {
      "Aya": "﴾‏فِرْعَوْنَ وَثَمُودَ ﴿١٨‎‏ ",
    "ابوالاعلی مودودی ": "فرعون اور ثمود (کے لشکروں) کی؟",
      "  احمد رضا خان ": "وه لشکر کون فرعون اور ثمود",
       "احمد علی ": "فرعون اور ثمود کے",
      "  جالندہری ": "فرعون اور ثمود کا",
      "  طاہر القادری": "فرعون اور ثمود (کے لشکروں) کے،",
      "   علامہ جوادی": "فرعون اور قوم ثمود کی خبر",
      " محمد جوناگڑھی": "یعنی فرعون اور ﺛمود کی",
      " محمد حسین نجفی ": "یعنی فرعون اور ثمود (کے لشکروں) کی۔",
      "مفتی تقی عثمانی": "فرعون اور ثمود ( کے لشکروں ) کی؟"
     },
     {
      "Aya": " ﴾‏بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ ﴿١٩ ‎",
    "ابوالاعلی مودودی ": "مگر جنہوں نے کفر کیا ہے وہ جھٹلانے میں لگے ہوئے ہیں",
      "  احمد رضا خان ": "بلکہ کافر جھٹلا نے میں ہیں",
       "احمد علی ": "بلکہ منکر تو جھٹلانے میں لگے ہوئے ہیں",
      "  جالندہری ": "لیکن کافر (جان بوجھ کر) تکذیب میں (گرفتار) ہیں",
      "  طاہر القادری": "بلکہ ایسے کافر (ہمیشہ حق کو) جھٹلانے میں (ہی کوشاں رہتے) ہیں،",
      "   علامہ جوادی": "مگر کفاّر تو صرف جھٹلانے میں پڑے ہوئے ہیں",
      " محمد جوناگڑھی": "کچھ نہیں بلکہ کافر تو جھٹلانے میں پڑے ہوئے ہیں",
      " محمد حسین نجفی ": "بلکہ یہ کافر (و منکر) تو جھٹلانے میں لگے ہیں۔",
      "مفتی تقی عثمانی": "اس کے باوجود کافر لوگ حق کو جھٹلانے میں لگے ہوئے ہیں "
     },
     {
      "Aya": " ﴾‏وَاللَّهُ مِن وَرَائِهِم مُّحِيطٌ ﴿٢٠‎‏",
    "ابوالاعلی مودودی ": "حالانکہ اللہ نے ان کو گھیرے میں لے رکھا ہے",
      "  احمد رضا خان ": "اور اللہ ان کے پیچھے سے انھیں گھیرے ہوئے ہے",
       "احمد علی ": "اور الله ہر طرف سے ان کو گھیرے ہوئے ہے",
      "  جالندہری ": "اور خدا (بھی) ان کو گردا گرد سے گھیرے ہوئے ہے",
      "  طاہر القادری": "اور اللہ اُن کے گرد و پیش سے (انہیں) گھیرے ہوئے ہے،",
      "   علامہ جوادی": "اور اللہ ان کو پیچھے سے گھیرے ہوئے ہے",
      " محمد جوناگڑھی": "اور اللہ تعالیٰ بھی انہیں ہر طرف سے گھیرے ہوئے ہے",
      " محمد حسین نجفی ": "حالانکہ اللہ ان کو آگے پیچھے سے گھیرے ہوئے ہے۔",
      "مفتی تقی عثمانی": "جبکہ اللہ نے ان کو گھیرے میں لیا ہوا ہے ۔"
     },
     {
      "Aya": " ﴾‏بَلْ هُوَ قُرْآنٌ مَّجِيدٌ ﴿٢١‎‏ ",
    "ابوالاعلی مودودی ": "اُن کے جھٹلانے سے اِس قرآن کا کچھ نہیں بگڑتا بلکہ یہ قرآن بلند پایہ ہے",
      "  احمد رضا خان ": "بلکہ وه کمال شرف والا قران ہے،",
       "احمد علی ": "بلکہ وہ قرآن ہے بڑی شان والا",
      "  جالندہری ": "یہ کتاب ہزل و بطلان نہیں بلکہ یہ قرآن عظیم الشان ہے",
      "  طاہر القادری": "بلکہ یہ بڑی عظمت والا قرآن ہے،",
      "   علامہ جوادی": "یقینا یہ بزرگ و برتر قرآن ہے",
      " محمد جوناگڑھی": "بلکہ یہ قرآن ہے بڑی شان واﻻ",
      " محمد حسین نجفی ": "بلکہ وہ بڑی شان والا قرآن ہے۔",
      "مفتی تقی عثمانی": " ان کے جھٹلانے سے قرآن پر کوئی اثر نہیں پڑتا  بلکہ یہ بڑی عظمت والا قرآن ہے ۔"
     },
     {
      "Aya": "﴾‏‏ فِي لَوْحٍ مَّحْفُوظٍ ﴿٢٢‎‏",
    "ابوالاعلی مودودی ": "اُس لوح میں (نقش ہے) جو محفوظ ہے",
      "  احمد رضا خان ": "لو ح محفوظ میں،",
       "احمد علی ": "لوح محفوظ میں (لکھا ہوا ہے)",
      "  جالندہری ": "لوح محفوظ میں (لکھا ہوا)",
      "  طاہر القادری": "لوحِ محفوظ میں (لکھا ہوا) ہے،",
      "   علامہ جوادی": "جو لوح محفوظ میں محفوظ کیا گیا ہے",
      " محمد جوناگڑھی": "لوح محفوظ میں (لکھا ہوا)",
      " محمد حسین نجفی ": "جو لوحِ محفوظ میں ثبت ہے۔",
      "مفتی تقی عثمانی": "جو لوح محفوظ میں درج ہے "
     }
    ]
    