
[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
    "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya": " ﴾١‎﴿تَبَّت يَدا أَبى لَهَبٍ وَتَبَّ ",
      "ابوالاعلی مودودی ": "ٹوٹ گئے ابولہب کے ہاتھ اور نامراد ہو گیا وہ",
    "  احمد رضا خان ": "تباہ ہوجائیں ابولہب کے دونوں ہاتھ اور وہ تباہ ہوہی گیا",
     "احمد علی ": "ابو لہب کے دونوں ہاتھ ٹوٹ گئے اوروہ ہلاک ہو گیا",
     "  جالندہری ": "ابولہب کے ہاتھ ٹوٹیں اور وہ ہلاک ہو",
     "  طاہر القادری": "ابولہب کے دونوں ہاتھ ٹوٹ جائیں اور وہ تباہ ہو جائے (اس نے ہمارے حبیب پر ہاتھ اٹھانے کی کوشش کی ہے)،",
     "   علامہ جوادی": "ابو لہب کے ہاتھ ٹوٹ جائیں اور وہ ہلاک ہوجائے",
     " محمد جوناگڑھی": "ابولہب کے دونوں ہاتھ ٹوٹ گئے اور وه (خود) ہلاک ہو گیا",
     " محمد حسین نجفی ": "ابولہب کے دونوں ہاتھ ٹوٹ جائیں اور وہ ہلاک و برباد ہوا۔",
     "مفتی تقی عثمانی": "ہاتھ ابولہب کے برباد ہوں ، اور وہ خود برباد ہوچکا ہے ۔ "
    },
    {
     "Aya": " ﴾٢‎﴿مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ ",
      "ابوالاعلی مودودی ": "اُس کا مال اور جو کچھ اس نے کمایا وہ اُس کے کسی کام نہ آیا",
    "  احمد رضا خان ": "اسے کچھ کام نہ آیا اس کا مال اور نہ جو کمایا",
     "احمد علی ": "اس کا مال اورجو کچھ اس نے کمایا اس کے کام نہ آیا",
     "  جالندہری ": "نہ تو اس کا مال ہی اس کے کچھ کام آیا اور نہ وہ جو اس نے کمایا",
     "  طاہر القادری": "اسے اس کے (موروثی) مال نے کچھ فائدہ نہ پہنچایا اور نہ ہی اس کی کمائی نے،",
     "   علامہ جوادی": "نہ اس کا مال ہی اس کے کام آیا اور نہ اس کا کمایا ہوا سامان ہی",
     " محمد جوناگڑھی": "نہ تو اس کا مال اس کے کام آیا اور نہ اس کی کمائی",
     " محمد حسین نجفی ": "اس کامال اور جو کچھ اس نے کمایا وہ اس کے کچھ کام نہ آیا۔",
     "مفتی تقی عثمانی": "اس کی دولت اور اس نے جو کمائی کی تھی وہ اس کے کچھ کام نہیں آئی ۔"
    },
    {
     "Aya": "﴾٣‎﴿ سَيَصْلَىٰ نَارًا ذَاتَ لَهَ ",
      "ابوالاعلی مودودی ": "ضرور وہ شعلہ زن آگ میں ڈالا جائے گا",
    "  احمد رضا خان ": "اب دھنستا ہے لپٹ مارتی آگ میں وہ،",
     "احمد علی ": "وہ بھڑکتی ہوئی آگ میں پڑے گا",
     "  جالندہری ": "وہ جلد بھڑکتی ہوئی آگ میں داخل ہو گا",
     "  طاہر القادری": "عنقریب وہ شعلوں والی آگ میں جا پڑے گا،",
     "   علامہ جوادی": "وہ عنقریب بھڑکتی ہوئی آگ میں داخل ہو گا",
     " محمد جوناگڑھی": "وه عنقریب بھڑکنے والی آگ میں جائے گا",
     " محمد حسین نجفی ": "وہ عنقریب شعلہ زن آگ میں ڈالا جائے گا۔",
     "مفتی تقی عثمانی": "وہ بھڑکتے شعلوں والی آگ میں داخل ہوگا ۔"
    },
    {
     "Aya": " ﴾٤‎﴿وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ ",
      "ابوالاعلی مودودی ": "اور (اُس کے ساتھ) اُس کی جورو بھی، لگائی بجھائی کرنے والی",
    "  احمد رضا خان ": "اور اس کی جُورو لکڑیوں کا گٹھا سر پر اٹھاتی،",
     "احمد علی ": "اور اس کی عورت بھی جو ایندھن اٹھائے پھرتی تھی",
     "  جالندہری ": "اور اس کی جورو بھی جو ایندھن سر پر اٹھائے پھرتی ہے",
     "  طاہر القادری": "اور اس کی (خبیث) عورت (بھی) جو (کانٹے دار) لکڑیوں کا بوجھ (سر پر) اٹھائے پھرتی ہے، (اور ہمارے حبیب کے تلووں کو زخمی کرنے کے لئے رات کو ان کی راہوں میں بچھا دیتی ہے)،",
     "   علامہ جوادی": "اور اس کی بیوی جو لکڑی ڈھونے والی ہے",
     " محمد جوناگڑھی": "اور اس کی بیوی بھی (جائے گی،) جو لکڑیاں ڈھونے والی ہے",
     " محمد حسین نجفی ": "اور (اس کے ساتھ) اس کی بیوی بھی جو ایندھن اٹھانے والی ہے۔",
     "مفتی تقی عثمانی": "اور اس کی بیوی بھی لکڑیاں ڈھوتی ہوئی ۔ "
    },
    {
     "Aya": " ﴾٥‎﴿ فِي جِيدِهَا حَبْلٌ مِّن مَّسَدٍ ",
      "ابوالاعلی مودودی ": "اُس کی گردن میں مونجھ کی رسی ہوگی",
    "  احمد رضا خان ": "اس کے گلے میں کھجور کی چھال کا رسّا،",
     "احمد علی ": "اس کی گردن میں موُنج کی رسیّ ہے",
     "  جالندہری ": "اس کے گلے میں مونج کی رسّی ہو گی",
     "  طاہر القادری": "اس کی گردن میں کھجور کی چھال کا (وہی) رسّہ ہوگا (جس سے کانٹوں کا گٹھا باندھتی ہے)،",
     "   علامہ جوادی": "اس کی گردن میں بٹی ہوئی رسی بندھی ہوئی ہے",
     " محمد جوناگڑھی": "اس کی گردن میں پوست کھجور کی بٹی ہوئی رسی ہوگی",
     " محمد حسین نجفی ": "اور اس کی گردن میں مُونج کی بٹی ہوئی رسی ہے۔",
     "مفتی تقی عثمانی": "اپنی گردن میں مونجھ کی رسی لیے ہوئے"
    }
   ]
  
  