
[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
    "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
    "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
       " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya":" ﴾١‎﴿إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ " ,
     "ابوالاعلی مودودی ": "(اے نبیؐ) ہم نے تمہیں کوثر عطا کر دیا",
     "  احمد رضا خان ": "اے محبوب! بیشک ہم نے تمہیں بے شمار خوبیاں عطا فرمائیں",
    "احمد علی ": "بے شک ہم نے آپ کو کوثر دی",
    "  جالندہری ": "(اے محمدﷺ) ہم نے تم کو کوثر عطا فرمائی ہے",
      "  طاہر القادری": "بیشک ہم نے آپ کو (ہر خیر و فضیلت میں) بے انتہا کثرت بخشی ہے٭، ٭ کوثر سے مراد حوضِ کوثر یا نہرِ جنت بھی ہے اور قرآن اور نبوت و حکمت بھی، فضائل و معجزات کی کثرت یا اصحاب و اتباع اور امت کی کثرت بھی مراد لی گئی ہے۔ رفعتِ ذکر اور خلقِ عظیم بھی مراد ہے اور دنیا و آخرت کی نعمتیں بھی، نصرتِ الٰہیہ اور کثرتِ فتوحات بھی مراد ہیں اور روزِ قیامت مقامِ محمود اور شفاعتِ عظمیٰ بھی مراد لی گئی ہے۔",
    "   علامہ جوادی": "بے شک ہم نے آپ کو کوثر عطا کیا ہے",
       " محمد جوناگڑھی": "یقیناً ہم نے تجھے (حوض) کوﺛر (اور بہت کچھ) دیا ہے",
      " محمد حسین نجفی ": "(اے رسول(ص)) ہم نے آپ(ص) کو کوثر عطا کی ہے",
      "مفتی تقی عثمانی": " اے پیغمبر یقین جانو ہم نے تمہیں کوثر عطا کردی ہے"
    },
    {
     "Aya": "﴾٢‎﴿فَصَلِّ لِرَبِّكَ وَانْحَرْ ",
     "ابوالاعلی مودودی ": "پس تم اپنے رب ہی کے لیے نماز پڑھو اور قربانی کرو",
     "  احمد رضا خان ": "تو تم اپنے رب کے لیے نماز پڑھو اور قربانی کرو",
    "احمد علی ": "پس اپنے رب کے لیے نماز پڑھیئے اور قربانی کیجیئے",
    "  جالندہری ": "تو اپنے پروردگار کے لیے نماز پڑھا کرو اور قربانی دیا کرو",
      "  طاہر القادری": "پس آپ اپنے رب کے لئے نماز پڑھا کریں اور قربانی دیا کریں (یہ ہدیۂ تشکرّ ہے)،",
    "   علامہ جوادی": "لہذا آپ اپنے رب کے لئے نماز پڑھیں اور قربانی دیں",
       " محمد جوناگڑھی": "پس تو اپنے رب کے لئے نماز پڑھ اور قربانی کر",
      " محمد حسین نجفی ": "پس آپ(ص) اپنے پروردگار کے لئے نماز پڑھا کریں اور قربانی کریں۔",
      "مفتی تقی عثمانی": "لہذا تم اپنے پروردگار ( کی خوشنودی ) کے لیے نماز پڑھو ، اور قربانی کرو ۔"
    },
    {
     "Aya":" ﴾٣‎﴿ إِنَّ شانِئَكَ هُوَ الأَبتَرُ ",
     "ابوالاعلی مودودی ": "تمہارا دشمن ہی جڑ کٹا ہے",
     "  احمد رضا خان ": "بیشک جو تمہارا دشمن ہے وہی ہر خیر سے محروم ہے",
    "احمد علی ": "بے شک آپ کا دشمن ہی بے نام و نشان ہے",
    "  جالندہری ": "کچھ شک نہیں کہ تمہارا دشمن ہی بےاولاد رہے گا",
      "  طاہر القادری": "بیشک آپ کا دشمن ہی بے نسل اور بے نام و نشاں ہوگا،",
    "   علامہ جوادی": "یقینا آپ کا دشمن بے اولاد رہے گا",
       " محمد جوناگڑھی": "یقیناً تیرا دشمن ہی ﻻوارث اور بے نام ونشان ہے",
      " محمد حسین نجفی ": "بےشک آپ(ص) کا دشمن ہی نسل بُریدہ ہوگا۔",
      "مفتی تقی عثمانی": "یقین جانو تمہارا دشمن ہی وہ ہے جس کی جڑ کٹی ہوئی ہے "
    }
   ]
   