[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی":"شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏إِذَا السَّمَاءُ انفَطَرَتْ ﴿١‎‏ ",
     "ابوالاعلی مودودی ": "جب آسمان پھٹ جائے گا",
      "  احمد رضا خان ": "جب آسمان پھٹ پڑے،",
       "احمد علی ": "جب آسمان پھٹ جائے",
      "  جالندہری ": "جب آسمان پھٹ جائے گا",
      "  طاہر القادری": "جب (سب) آسمانی کرّے پھٹ جائیں گے،",
     "   علامہ جوادی": "جب آسمان شگافتہ ہوجائے گا",
      " محمد جوناگڑھی":"جب آسمان پھٹ جائے گا",
      " محمد حسین نجفی ": "اور جب آسمان پھٹ جائے گا۔",
      "مفتی تقی عثمانی": "جب آسمان چر جائے گا ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا الْكَوَاكِبُ انتَثَرَتْ ﴿٢‎‏",
     "ابوالاعلی مودودی ": "اور جب تارے بکھر جائیں گے",
      "  احمد رضا خان ": "اور جب تارے جھڑ پڑیں،",
       "احمد علی ": "اورجب ستارے جھڑ جائیں",
      "  جالندہری ": "اور جب تارے جھڑ پڑیں گے",
      "  طاہر القادری": "اور جب سیارے گر کر بکھر جائیں گے",
     "   علامہ جوادی": "اور جب ستارے بکھر جائیں گے",
      " محمد جوناگڑھی":"اور جب ستارے جھڑ جائیں گے",
      " محمد حسین نجفی ": "اور جب ستارے بکھر جائیں گے۔",
      "مفتی تقی عثمانی": "اور جب ستارے جھڑ پڑیں گے"
     },
     {
      "Aya": "﴾‏وَإِذَا الْبِحَارُ فُجِّرَتْ ﴿٣‎‏",
     "ابوالاعلی مودودی ": "اور جب سمندر پھاڑ دیے جائیں گے",
      "  احمد رضا خان ": "اور جب سمندر بہادیے جائیں",
       "احمد علی ": "اور جب سمندر ابل پڑیں",
      "  جالندہری ": "اور جب دریا بہہ (کر ایک دوسرے سے مل) جائیں گے",
      "  طاہر القادری": "اور جب سمندر (اور دریا) ابھر کر بہہ جائیں گے،",
     "   علامہ جوادی": "اور جب دریا بہہ کر ایک دوسرے سے مل جائیں گے",
      " محمد جوناگڑھی":"اور جب سمندر بہہ نکلیں گے",
      " محمد حسین نجفی ": "اور جب سمندر بہہ پڑیں گے۔",
      "مفتی تقی عثمانی": "اور جب سمندروں کو ابال دیا جائے گا ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا الْقُبُورُ بُعْثِرَتْ ﴿٤‎‏ ",
     "ابوالاعلی مودودی ": "اور جب قبریں کھول دی جائیں گی",
      "  احمد رضا خان ": "اور جب قبریں کریدی جائیں",
       "احمد علی ": "اور جب قبریں اکھاڑ دی جائیں",
      "  جالندہری ": "اور جب قبریں اکھیڑ دی جائیں گی",
      "  طاہر القادری": "اور جب قبریں زیر و زبر کر دی جائیں گی،",
     "   علامہ جوادی": "اور جب قبروں کو اُبھار دیا جائے گا",
      " محمد جوناگڑھی":"اور جب قبریں (شق کر کے) اکھاڑ دی جائیں گی",
      " محمد حسین نجفی ": "اور جب قبریں تہ و بالا کر دی جائیں گی۔",
      "مفتی تقی عثمانی": "اور جب قبریں اکھاڑ دی جائیں گی ۔"
     },
     {
      "Aya": "﴾‏عَلِمَتْ نَفْسٌ مَّا قَدَّمَتْ وَأَخَّرَتْ ﴿٥‎‏",
     "ابوالاعلی مودودی ": "اُس وقت ہر شخص کو اُس کا اگلا پچھلا سب کیا دھرا معلوم ہو جائے گا",
      "  احمد رضا خان ": "ہر جان، جان لے گی جو اس نے آگے بھیجا اور جو پیچھے",
       "احمد علی ": "تب ہر شخص جان لے گا کہ کیا آگے بھیجا اور کیا پیچھے چھوڑ آیا",
      "  جالندہری ": "تب ہر شخص معلوم کرلے گا کہ اس نے آگے کیا بھیجا تھا اور پیچھے کیا چھوڑا تھا",
      "  طاہر القادری": "تو ہر شخص جان لے گا کہ کیا عمل اس نے آگے بھیجا اور (کیا) پیچھے چھوڑ آیا تھا،",
     "   علامہ جوادی": "تب ہر نفس کو معلوم ہوگا کہ کیا مقدم کیا ہے اور کیا موخر کیا ہے",
      " محمد جوناگڑھی":"ہر شخص اپنے آگے بھیجے ہوئے اور پیچھے چھوڑے ہوئے (یعنی اگلے پچھلے اعمال) کو معلوم کر لے گا",
      " محمد حسین نجفی ": "تب ہر شخص کو معلوم ہو جائے گا کہ اس نے آگے کیا بھیجا ہے اور پیچھے کیا چھوڑا ہے؟",
      "مفتی تقی عثمانی": "اس وقت ہر شخص کو پتہ چل جائے گا کہ اس نے کیا آگے بھیجا اور کیا پیچھے چھوڑا "
     },
     {
      "Aya": "﴾‏يَا أَيُّهَا الْإِنسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ ﴿٦‎‏",
     "ابوالاعلی مودودی ": "اے انسان، کس چیز نے تجھے اپنے اُس رب کریم کی طرف سے دھوکے میں ڈال دیا",
      "  احمد رضا خان ": "اے آدمی! تجھے کس چیز نے فریب دیا اپنے کرم والے رب سے",
       "احمد علی ": "اے انسان تجھے اپنے رب کریم کے بارے میں کس چیز نے مغرور کر دیا",
      "  جالندہری ": "اے انسان تجھ کو اپنے پروردگار کرم گستر کے باب میں کس چیز نے دھوکا دیا",
      "  طاہر القادری": "اے انسان! تجھے کس چیز نے اپنے ربِ کریم کے بارے میں دھوکے میں ڈال دیا،",
     "   علامہ جوادی": "اے انسان تجھے رب کریم کے بارے میں کس شے نے دھوکہ میں رکھا ہے",
      " محمد جوناگڑھی":"اے انسان! تجھے اپنے رب کریم سے کس چیز نے بہکایا",
      " محمد حسین نجفی ": "اے انسان تجھے کس چیز نے اپنے (رحیم و) کریم پروردگار سے دھو کے میں ڈال رکھا ہے؟",
      "مفتی تقی عثمانی": "اے انسان ! تجھے کس چیز نے اپنے اس پروردگار کے معاملے میں دھوکا لگا دیا ہے جو بڑا کرم والا ہے ۔"
     },
     {
      "Aya": "﴾‏الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ ﴿٧‎‏",
     "ابوالاعلی مودودی ": "جس نے تجھے پیدا کیا، تجھے نک سک سے درست کیا، تجھے متناسب بنایا",
      "  احمد رضا خان ": "جس نے تجھے پیدا کیا پھر ٹھیک بنایا پھر ہموار فرمایا",
       "احمد علی ": "جس نے تجھے پیدا کیا پھر تجھے ٹھیک کیا پھر تجھے برابر کیا",
      "  جالندہری ": "وہی تو ہے جس نے تجھے بنایا اور (تیرے اعضا کو) ٹھیک کیا اور (تیرے قامت کو) معتدل رکھا",
      "  طاہر القادری": "جس نے (رحم مادر کے اندر ایک نطفہ میں سے) تجھے پیدا کیا، پھر اس نے تجھے (اعضا سازی کے لئے ابتداءً) درست اور سیدھا کیا، پھر وہ تیری ساخت میں متناسب تبدیلی لایا،",
     "   علامہ جوادی": "اس نے تجھے پیدا کیا ہے اور پھر برابر کرکے متوازن بنایا ہے",
      " محمد جوناگڑھی":"جس (رب نے) تجھے پیدا کیا، پھر ٹھیک ٹھاک کیا، پھر (درست اور) برابر بنایا",
      " محمد حسین نجفی ": "جس نے تجھے پیدا کیا پھر (تیرے اعضاء کو) درست بنایا (اور) پھر تجھے متناسب بنایا۔",
      "مفتی تقی عثمانی": "جس نے تجھے پیدا کیا پھر تجھے ٹھیک ٹھیک بنایا ، پھر تیرے اندر اعتدال پیدا کیا؟"
     },
     {
      "Aya": "﴾‏فِي أَيِّ صُورَةٍ مَّا شَاءَ رَكَّبَكَ ﴿٨‎‏ ",
     "ابوالاعلی مودودی ": "اور جس صورت میں چاہا تجھ کو جوڑ کر تیار کیا؟",
      "  احمد رضا خان ": "جس صورت میں چاہا تجھے ترکیب دیا",
       "احمد علی ": "جس صورت میں چاہا تیرے اعضا کو جوڑ دیا",
      "  جالندہری ": "اور جس صورت میں چاہا تجھے جوڑ دیا",
      "  طاہر القادری": "جس صورت میں بھی چاہا اس نے تجھے ترکیب دے دیا،",
     "   علامہ جوادی": "اس نے جس صورت میں چاہاہے تیرے اجزائ کی ترکیب کی ہے",
      " محمد جوناگڑھی":"جس صورت میں چاہا تجھے جوڑ دیا",
      " محمد حسین نجفی ": "جس شکل میں چاہا تجھے ترتیب دے دیا۔",
      "مفتی تقی عثمانی": "جس صورت میں چاہا ، اس نے تجھے جوڑ کر تیار کیا ۔"
     },
     {
      "Aya": "﴾‏كَلَّا بَلْ تُكَذِّبُونَ بِالدِّينِ ﴿٩‎‏ ",
     "ابوالاعلی مودودی ": "ہرگز نہیں، بلکہ (اصل بات یہ ہے کہ) تم لوگ جزا و سزا کو جھٹلاتے ہو",
      "  احمد رضا خان ": "کوئی نہیں بلکہ تم انصاف ہونے کو جھٹلانتے ہو",
       "احمد علی ": "نہیں نہیں بلکہ تم جزا کو نہیں مانتے",
      "  جالندہری ": "مگر ہیہات تم لوگ جزا کو جھٹلاتے ہو",
      "  طاہر القادری": "حقیقت تو یہ ہے (اور) تم اِس کے برعکس روزِ جزا کو جھٹلاتے ہو،",
     "   علامہ جوادی": "مگر تم لوگ جزا کا انکار کرتے ہو",
      " محمد جوناگڑھی":"ہرگز نہیں بلکہ تم تو جزا وسزا کے دن کو جھٹلاتے ہو",
      " محمد حسین نجفی ": "ہرگز نہیں! بلکہ (اصل حقیقت یہ ہے کہ) تم جزا و سزا (کے دن) کو جھٹلاتے ہو۔",
      "مفتی تقی عثمانی": "ہرگز ایسا نہیں ہونا چاہیے ۔ لیکن تم جزا و سزا کو جھٹلاتے ہو ۔"
     },
     {
      "Aya": "﴾‏وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ ﴿١٠‎‏ ",
     "ابوالاعلی مودودی ": "حالانکہ تم پر نگراں مقرر ہیں",
      "  احمد رضا خان ": "اور بیشک تم پر کچھ نگہبان ہیں",
       "احمد علی ": "اور بے شک تم پر محافظ ہیں",
      "  جالندہری ": "حالانکہ تم پر نگہبان مقرر ہیں",
      "  طاہر القادری": "حالانکہ تم پر نگہبان فرشتے مقرر ہیں",
     "   علامہ جوادی": "اور یقینا تمہارے سروں پر نگہبان مقرر ہیں",
      " محمد جوناگڑھی":"یقیناً تم پر نگہبان عزت والے",
      " محمد حسین نجفی ": "حالانکہ تم پر نگران (ملائکہ) مقرر ہیں۔",
      "مفتی تقی عثمانی": "حالانکہ تم پر کچھ نگراں ( فرشتے ) مقرر ہیں "
     },
     {
      "Aya": "﴾‏كِرَامًا كَاتِبِينَ ﴿١١‎‏",
     "ابوالاعلی مودودی ": "ایسے معزز کاتب",
      "  احمد رضا خان ": "معزز لکھنے والے",
       "احمد علی ": "عزت والے اعمال لکھنے والے",
      "  جالندہری ": "عالی قدر (تمہاری باتوں کے) لکھنے والے",
      "  طاہر القادری": " بہت معزز ہیں (تمہارے اعمال نامے) لکھنے والے ہیں،",
     "   علامہ جوادی": "جو باعزّت لکھنے والے ہیں",
      " محمد جوناگڑھی":"لکھنے والے مقرر ہیں",
      " محمد حسین نجفی ": "معزز لکھنے والے۔",
      "مفتی تقی عثمانی": "وہ معزز لکھنے والے ۔"
     },
     {
      "Aya": " ﴾‏يَعْلَمُونَ مَا تَفْعَلُونَ ﴿١٢      ‎",
     "ابوالاعلی مودودی ": "جو تمہارے ہر فعل کو جانتے ہیں",
      "  احمد رضا خان ": "جانتے ہیں جو کچھ تم کرو",
       "احمد علی ": "وہ جانتے ہیں جو تم کرتے ہو",
      "  جالندہری ": "جو تم کرتے ہو وہ اسے جانتے ہیں",
      "  طاہر القادری": "وہ ان (تمام کاموں) کو جانتے ہیں جو تم کرتے ہو،",
     "   علامہ جوادی": "وہ تمہارے اعمال کو خوب جانتے ہیں",
      " محمد جوناگڑھی":"جوکچھ تم کرتے ہو وه جانتے ہیں",
      " محمد حسین نجفی ": "وہ جانتے ہیں جو کچھ تم کرتے ہو۔",
      "مفتی تقی عثمانی": "جو تمہارے سارے کاموں کو جانتے ہیں"
     },
     {
      "Aya": " ﴾‏إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ ﴿١٣  ‎‏ ",
     "ابوالاعلی مودودی ": "یقیناً نیک لوگ مزے میں ہوں گے",
      "  احمد رضا خان ": "بیشک نِکو کار ضرور چین میں ہیں",
       "احمد علی ": "بےشک نیک لوگ نعمت میں ہوں گے",
      "  جالندہری ": "بے شک نیکوکار نعمتوں (کی بہشت) میں ہوں گے۔",
      "  طاہر القادری": "بیشک نیکوکار جنّتِ نعمت میں ہوں گے،",
     "   علامہ جوادی": "بے شک نیک لوگ نعمتوں میں ہوں گے",
      " محمد جوناگڑھی":"یقیناً نیک لوگ (جنت کے عیش وآرام اور) نعمتوں میں ہوں گے",
      " محمد حسین نجفی ": "بےشک نیکوکار لوگ عیش و آرام میں ہوں گے۔",
      "مفتی تقی عثمانی": "یقین رکھو کہ نیک لوگ یقینا بڑی نعمتوں میں ہوں گے ۔"
     },
     {
      "Aya": "﴾‏وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ ﴿١٤‎",
     "ابوالاعلی مودودی ": "اور بے شک بدکار لوگ جہنم میں جائیں گے",
      "  احمد رضا خان ": "اور بیشک بدکار ضرور دوزخ میں ہیں،",
       "احمد علی ": "اور بے شک نافرمان دوزخ میں ہوں گے",
      "  جالندہری ": "اور بدکردار دوزخ میں",
      "  طاہر القادری": "اور بیشک بدکار دوزخِ (سوزاں) میں ہوں گے،",
     "   علامہ جوادی": "اور بدکار افراد جہنم ّمیں ہوں گے",
      " محمد جوناگڑھی":"اور یقیناً بدکار لوگ دوزخ میں ہوں گے",
      " محمد حسین نجفی ": "اور بدکار لوگ دوزخ میں ہوں گے۔",
      "مفتی تقی عثمانی": "اور بدکار لوگ ضرور دوزخ میں ہوں گے "
     },
     {
      "Aya": "﴾‏يَصْلَوْنَهَا يَوْمَ الدِّينِ ﴿١٥    ‎‏ ",
     "ابوالاعلی مودودی ": "جزا کے دن وہ اس میں داخل ہوں گے",
      "  احمد رضا خان ": "انصاف کے دن اس میں جائیں گے،",
       "احمد علی ": "انصاف کے دن اس میں داخل ہوں گے",
      "  جالندہری ": "جزا کے دن اس میں داخل ہوں گے",
      "  طاہر القادری": "وہ اس میں قیامت کے روز داخل ہوں گے،",
     "   علامہ جوادی": "وہ روز جزا اسی میں جھونک دیئے جائیں گے",
      " محمد جوناگڑھی":"بدلے والے دن اس میں جائیں گے",
      " محمد حسین نجفی ": "وہ جزا (سزا) والے دن اس میں داخل ہوں گے۔",
      "مفتی تقی عثمانی": "وہ اس میں جزا و سزا کے دن داخل ہوں گے "
     },
     {
      "Aya": "﴾‏‏ وَمَا هُمْ عَنْهَا بِغَائِبِينَ ﴿١٦‎",
     "ابوالاعلی مودودی ": "اور اُس سے ہرگز غائب نہ ہو سکیں گے",
      "  احمد رضا خان ": "اور اس سے کہیں چھپ نہ سکیں گے،",
       "احمد علی ": "اور وہ اس سے کہیں جانے نہ پائیں گے",
      "  جالندہری ": "اور اس سے چھپ نہیں سکیں گے",
      "  طاہر القادری": "اور وہ اس (دوزخ) سے (کبھی بھی) غائب نہ ہو سکیں گے،",
     "   علامہ جوادی": "اور وہ اس سے بچ کر نہ جاسکیں گے",
      " محمد جوناگڑھی":"وه اس سے کبھی غائب نہ ہونے پائیں گے",
      " محمد حسین نجفی ": "اور وہ اس سے اوجھل نہیں ہوں گے",
      "مفتی تقی عثمانی": "اور وہ اس سے غائب نہیں ہوسکتے ۔"
     },
     {
      "Aya": "﴾‏‏ وَمَا أَدْرَاكَ مَا يَوْمُ ﴿١٧‏",
     "ابوالاعلی مودودی ": "اور تم کیا جانتے ہو کہ وہ جزا کا دن کیا ہے؟",
      "  احمد رضا خان ": "اور تو کیا جانیں کیسا انصاف کا دن،",
       "احمد علی ": "اورتجھے کیا معلوم انصاف کا دن کیا ہے",
      "  جالندہری ": "اور تمہیں کیا معلوم کہ جزا کا دن کیسا ہے؟",
      "  طاہر القادری": "اور آپ نے کیا سمجھا کہ روزِ جزا کیا ہے",
     "   علامہ جوادی": "اور تم کیا جانو کہ جزا کا دن کیا شے ہے",
      " محمد جوناگڑھی":"تجھے کچھ خبر بھی ہے کہ بدلے کا دن کیا ہے",
      " محمد حسین نجفی ": "تمہیں کیا معلوم کہ وہ جزا و سزا کا دن کیا ہے؟",
      "مفتی تقی عثمانی": "اور تمہیں کیا پتہ کہ جزا و سزا کا دن کیا چیز ہے ؟"
     },
     {
      "Aya": "﴾‏ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ ﴿١٨‎‏",
     "ابوالاعلی مودودی ": "ہاں، تمہیں کیا خبر کہ وہ جزا کا دن کیا ہے؟",
      "  احمد رضا خان ": "پھر تو کیا جانے کیسا انصاف کا دن،",
       "احمد علی ": "پھر تجھے کیا خبر کہ انصاف کا دن کیا ہے",
      "  جالندہری ": "پھر تمہیں کیا معلوم کہ جزا کا دن کیسا ہے؟",
      "  طاہر القادری": "پھر آپ نے کیا جانا کہ روزِ جزا کیا ہے،",
     "   علامہ جوادی": "پھر تمہیں کیا معلوم کہ جزا کا دن کیسا ہوتا ہے",
      " محمد جوناگڑھی":"میں پھر (کہتا ہوں کہ) تجھے کیا معلوم کہ جزا (اور سزا) کا دن کیا ہے",
      " محمد حسین نجفی ": "پھر سنو تمہیں کیا معلوم کہ جزا (و سزا) والا دن کیا ہے؟",
      "مفتی تقی عثمانی": "ہاں تمہیں کیا پتہ کہ جزا و سزا کا دن کیا چیز ہے ؟"
     },
     {
      "Aya": " ﴾‏يَوْمَ لَا تَمْلِكُ نَفْسٌ لِّنَفْسٍ شَيْئًا ۖ وَالْأَمْرُ يَوْمَئِذٍ لِّلَّهِ ﴿١٩    ‎‏",
     "ابوالاعلی مودودی ": "یہ وہ دن ہے جب کسی شخص کے لیے کچھ کرنا کسی کے بس میں نہ ہوگا، فیصلہ اُس دن بالکل اللہ کے اختیار میں ہوگا",
      "  احمد رضا خان ": "جس دن کوئی جان کسی جان کا کچھ اختیار نہ رکھے گی اور سارا حکم اس دن اللہ کا ہے،",
       "احمد علی ": "جس دن کوئی کسی کے لیے کچھ بھی نہ کر سکے گااور اس دن الله ہی کا حکم ہوگا",
      "  جالندہری ": "جس روز کوئی کسی کا بھلا نہ کر سکے گا اور حکم اس روز خدا ہی کا ہو گا",
      "  طاہر القادری": "وہ دن ہے جب کوئی شخص کسی کے لئے کسی چیز کا مالک نہ ہوگا، اور حکم فرمائی اس دن اللہ ہی کی ہوگی،",
     "   علامہ جوادی": "اس دن کوئی کسی کے بارے میں کوئی اختیار نہ رکھتا ہوگا اور سارا اختیار اللہ کے ہاتھوں میں ہوگا",
      " محمد جوناگڑھی":"جس دن کوئی شخص کسی شخص کے لئے کسی چیز کا مختار نہ ہوگا، اور (تمام تر) احکام اس روز اللہ کے ہی ہوں گے",
      " محمد حسین نجفی ": "جس دن کوئی کسی دوسرے کے کام نہ آسکے گا اور اس دن معاملہ (اختیار) اللہ ہی کے قبضۂ قدرت میں ہوگا۔",
      "مفتی تقی عثمانی": "یہ وہ دن ہوگا جس میں کسی دوسرے کے لیے کچھ کرنا کسی کے بس میں نہیں ہوگا ، اور تمام تر حکم اس دن اللہ ہی کا چلے گا ۔"
     }
    ]