[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
        "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی":  "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "   ﴾‏وَالتِّينِ وَالزَّيْتُون  ﴿١    " ,
     "ابوالاعلی مودودی ":  "قسم ہے انجیر اور زیتون کی",
        "  احمد رضا خان ": "انجیر کی قسم اور زیتون",
      "احمد علی ": "انجیر اور زیتون کی قسم ہے",
     "  جالندہری ": "انجیر کی قسم اور زیتون کی",
    "  طاہر القادری": "انجیر کی قَسم اور زیتون کی قَسم،",
      "   علامہ جوادی": "قسم ہے انجیر اور زیتون کی",
      " محمد جوناگڑھی": "قسم ہے انجیر کی اور زیتون کی",
     " محمد حسین نجفی ": "قَسم ہے انجیر اور زیتون کی۔",
     "مفتی تقی عثمانی":  "قسم ہے انجیر اور زیتون کی ۔"
     },
     {
      "Aya":" ﴾‏وَطُورِ سِينِينَ  ﴿٢    ",
     "ابوالاعلی مودودی ":  "اور طور سینا کی",
        "  احمد رضا خان ": "اور طور سینا",
      "احمد علی ": "اور طور سینا کی",
     "  جالندہری ": "اور طور سینین کی",
    "  طاہر القادری": "اور سینا کے (پہاڑ) طور کی قَسم،",
      "   علامہ جوادی": "اور طورسینین کی",
      " محمد جوناگڑھی": "اور طور سِینِین کی",
     " محمد حسین نجفی ": "اور طُورِ سینا کی۔",
     "مفتی تقی عثمانی":  "اور صحرائے سینا کے پہاڑ طور کی ۔"
     },
     {
      "Aya": " ﴾‏وَهَٰذَا الْبَلَدِ الْأَمِينِ  ﴿٣  ‎‏",
     "ابوالاعلی مودودی ":  "اور اِس پرامن شہر (مکہ) کی",
        "  احمد رضا خان ": "اور اس امان والے شہر کی",
      "احمد علی ": "اور اس شہر (مکہ) کی جو امن والا ہے",
     "  جالندہری ": "اور اس امن والے شہر کی",
    "  طاہر القادری": "اور اس امن والے شہر (مکہ) کی قَسم،",
      "   علامہ جوادی": "اور اس امن والے شہر کی",
      " محمد جوناگڑھی": "اور اس امن والے شہر کی",
     " محمد حسین نجفی ": "اور پُرامن شہر (مکہ) کی۔",
     "مفتی تقی عثمانی":  "اور اس امن و امان والے شہر کی "
     },
     {
      "Aya": "﴾‏لَقَدْ خَلَقْنَا الْإِنسَانَ فِي أَحْسَنِ تَقْوِيمٍ  ﴿٤   ‎",
     "ابوالاعلی مودودی ":  "ہم نے انسان کو بہترین ساخت پر پیدا کیا",
        "  احمد رضا خان ": "بیشک ہم نے آدمی کو اچھی صورت پر بنایا،",
      "احمد علی ": "بے شک ہم نے انسان کو بڑے عمدہ انداز میں پیدا کیا ہے",
     "  جالندہری ": "کہ ہم نے انسان کو بہت اچھی صورت میں پیدا کیا ہے",
    "  طاہر القادری": "بیشک ہم نے انسان کو بہترین (اعتدال اور توازن والی) ساخت میں پیدا فرمایا ہے،",
      "   علامہ جوادی": "ہم نے انسان کو بہترین ساخت میں پیدا کیا ہے",
      " محمد جوناگڑھی": "یقیناً ہم نے انسان کو بہترین صورت میں پیدا کیا",
     " محمد حسین نجفی ": "ہم نے انسان کو بہترین ساخت و انداز کے ساتھ پیدا کیا ہے۔",
     "مفتی تقی عثمانی":  "کہ ہم نے انسان کو بہترین سانچے میں ڈھال کر پیدا کیا ہے ۔"
     },
     {
      "Aya": " ﴾‏ ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ﴿٥  ‏",
     "ابوالاعلی مودودی ":  "پھر اُسے الٹا پھیر کر ہم نے سب نیچوں سے نیچ کر دیا",
        "  احمد رضا خان ": "پھر اسے ہر نیچی سے نیچی حالت کی طرف پھیردیا",
      "احمد علی ": "پھر ہم نے اسے سب سے نیچے پھینک دیا ہے",
     "  جالندہری ": "پھر (رفتہ رفتہ) اس (کی حالت) کو (بدل کر) پست سے پست کر دیا",
    "  طاہر القادری": "پھر ہم نے اسے پست سے پست تر حالت میں لوٹا دیا،",
      "   علامہ جوادی": "پھر ہم نے اس کو پست ترین حالت کی طرف پلٹا دیا ہے",
      " محمد جوناگڑھی": "پھر اسے نیچوں سے نیچا کر دیا",
     " محمد حسین نجفی ": "پھر اسے (اس کی کج رفتاری کی وجہ سے) پست ترین حالت کی طرف لوٹا دیا۔",
     "مفتی تقی عثمانی":  "پھر ہم اسے پستی والوں میں سب سے زیادہ نچلی حالت میں کردیتے ہیں "
     },
     {
      "Aya": "﴾‏إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ﴿٦ ‎",
     "ابوالاعلی مودودی ":  "سوائے اُن لوگوں کے جو ایمان لائے اور نیک عمل کرتے رہے کہ ان کے لیے کبھی ختم نہ ہونے والا اجر ہے",
        "  احمد رضا خان ": "مگر جو ایمان لائے اور اچھے کام کیے کہ انہیں بے حد ثواب ہے",
      "احمد علی ": "مگر جو ایمان لائے اور نیک کام کئے سو ان کے لیے تو بے انتہا بدلہ ہے",
     "  جالندہری ": "مگر جو لوگ ایمان لائے اور نیک عمل کرتے رہے انکے لیے بےانتہا اجر ہے",
    "  طاہر القادری": "سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کرتے رہے تو ان کے لئے ختم نہ ہونے والا (دائمی) اجر ہے،",
      "   علامہ جوادی": "علاوہ ان لوگوں کے جو ایمان لائے اور انہوں نے نیک اعمال انجام دیئے تو ان کے لئے نہ ختم ہونے والا اجر ہے",
      " محمد جوناگڑھی": "لیکن جو لوگ ایمان ﻻئے اور (پھر) نیک عمل کیے تو ان کے لئے ایسا اجر ہے جو کبھی ختم نہ ہوگا",
     " محمد حسین نجفی ": "سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کئے سو ان کیلئے ختم نہ ہو نے والا اجر ہے۔",
     "مفتی تقی عثمانی":  "سوائے ان کے جو ایمان لائے ، اور انہوں نے نیک عمل کیے ، تو ان کو ایسا اجر ملے گا جو کبھی ختم نہیں ہوگا ۔"
     },
     {
      "Aya": "  ﴾‏فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ ﴿٧   ‎‏ ",
     "ابوالاعلی مودودی ":  "پس (اے نبیؐ) اس کے بعد کون جزا و سزا کے معاملہ میں تم کو جھٹلا سکتا ہے؟",
        "  احمد رضا خان ": "تو اب کیا چیز تجھے انصاف کے جھٹلانے پر باعث ہے",
      "احمد علی ": "پھر اس کے بعد آپ کو قیامت کے معاملہ میں کون جھٹلا سکتا ہے",
     "  جالندہری ": "تو (اے آدم زاد) پھر تو جزا کے دن کو کیوں جھٹلاتا ہے؟",
    "  طاہر القادری": "پھر اس کے بعد کون ہے جو آپ کو دین (یا قیامت اور جزا و سزا) کے بارے میں جھٹلاتا ہے،",
      "   علامہ جوادی": "پھر تم کو روز جزا کے بارے میں کون جھٹلا سکتا ہے",
      " محمد جوناگڑھی": "پس تجھے اب روز جزا کے جھٹلانے پر کون سی چیز آماده کرتی ہے",
     " محمد حسین نجفی ": "تواس کے بعد آپ(ص) کو جزا و سزا کے معاملہ میں کون جھٹلا سکتا ہے؟",
     "مفتی تقی عثمانی":  "پھر ( اے انسان ) وہ کیا چیز ہے جو تجھے جزا و سزا کو جھٹلانے پر آمادہ کر رہی ہے ؟"
     },
     {
      "Aya": "﴾‏أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ ﴿٨   ‎‏",
     "ابوالاعلی مودودی ":  "کیا اللہ سب حاکموں سے بڑا حاکم نہیں ہے؟",
        "  احمد رضا خان ": "کیا اللہ سب حاکموں سے بڑھ کر حاکم نہیں،",
      "احمد علی ": "کیا الله سب حاکموں سے بڑا حاکم نہیں (ضرور ہے)",
     "  جالندہری ": "کیا خدا سب سے بڑا حاکم نہیں ہے؟",
    "  طاہر القادری": "کیا اﷲ سب حاکموں سے بڑا حاکم نہیں ہے،",
      "   علامہ جوادی": "کیا خدا سب سے بڑا حاکم اور فیصلہ کرنے والا نہیں ہے",
      " محمد جوناگڑھی": "کیا اللہ تعالیٰ (سب) حاکموں کا حاکم نہیں ہے",
     " محمد حسین نجفی ": "کیا اللہ سبحانہٗ سب حاکموں سے بڑا حاکم نہیں ہے؟",
     "مفتی تقی عثمانی":  "کیا اللہ سارے حکمرانوں سے بڑھ کر حکمران نہیں ہے ؟ "
     }
    ]
    