[
   {
    "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
    "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
    "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
    "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
   "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
    "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
    " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
    " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
    "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
   },
   {
    "Aya": " ﴾لَمْ يَكُنِ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ مُنفَكِّينَ حَتَّىٰ تَأْتِيَهُمُ الْبَيِّنَةُ ﴿١‎",
    "ابوالاعلی مودودی ": "اہل کتاب اور مشرکین میں سے جو لوگ کافر تھے (وہ اپنے کفر سے) باز آنے والے نہ تھے جب تک کہ ان کے پاس دلیل روشن نہ آ جائے",
    "  احمد رضا خان ": "کتابی کافر اور مشرک اپنا دین چھوڑنے کو نہ تھے جب تک ان کے پاس روشن دلیل نہ آئے",
    "احمد علی ": "اہلِ کتاب میں سے کافر اور مشرک لوگ باز آنے والے نہیں تھے یہاں تک کہ ان کے پاس کھلی دلیل آئے",
    "  جالندہری ": "جو لوگ کافر ہیں (یعنی) اہل کتاب اور مشرک وہ (کفر سے) باز رہنے والے نہ تھے جب تک ان کے پاس کھلی دلیل (نہ) آتی",
   "  طاہر القادری": "اہلِ کتاب میں سے جو لوگ کافر ہو گئے اور مشرکین اس قت تک (کفر سے) الگ ہونے والے نہ تھے جب تک ان کے پاس روشن دلیل (نہ) آجاتی،",
    "   علامہ جوادی": "اہل کتاب کے کفاّر اور دیگر مشرکین اپنے کفر سے الگ ہونے والے نہیں تھے جب تک کہ ان کے پاس کِھلی دلیل نہ آجاتی",
    " محمد جوناگڑھی": "اہل کتاب کے کافر اور مشرک لوگ جب تک کہ ان کے پاس ﻇاہر دلیل نہ آجائے باز رہنے والے نہ تھے (وه دلیل یہ تھی کہ)",
    " محمد حسین نجفی ": "اہلِ کتاب اور مشرکین میں سے جو لوگ کافر تھے وہ (اپنے کفر سے) باز آنے والے نہ تھے جب تک ان کے پاس ایک واضح دلیل نہ آجائے۔",
    "مفتی تقی عثمانی": "اہل کتاب اور مشرکین میں سے جو لوگ کافر تھے ، وہ اس وقت تک باز آنے والے نہیں تھے جب تک کہ ان کے پاس روشن دلیل نہ آتی ۔ "
   },
   {
    "Aya": " ﴾‏رَسُولٌ مِّنَ اللَّهِ يَتْلُو صُحُفًا مُّطَهَّرَةً ﴿٢‎‏",
    "ابوالاعلی مودودی ": " اللہ کی طرف سے ایک رسول جو پاک صحیفے پڑھ کر سنائے",
    "  احمد رضا خان ": "وہ کون وہ اللہ کا رسول کہ پاک صحیفے پڑھتا ہے",
    "احمد علی ": "یعنی ایک رسول الله کی طرف سے آئے جو پاک صحیفے پڑھ کر سنائے",
    "  جالندہری ": "یعنی خدا کے پیغمبر جو پاک اوراق پڑھتے ہیں",
   "  طاہر القادری": "وہ دلیل اﷲ کی طرف سے رسول (آخر الزماں صلی اللہ علیہ وآلہ وسلم) ہیں جو (ان پر) پاکیزہ اوراقِ (قرآن) کی تلاوت فرماتے ہیں،",
    "   علامہ جوادی": "اللہ کی طرف کا نمائندہ جو پاکیزہ صحفیوں کی تلاوت کرے",
    " محمد جوناگڑھی": "اللہ تعالیٰ کا ایک رسول جو پاک صحیفے پڑھے",
    " محمد حسین نجفی ": "یعنی اللہ کا ایک رسول(ع) جو انہیں پاک و پاکیزہ صحیفے پڑھ کر سنا ئے۔",
    "مفتی تقی عثمانی": "یعنی ایک اللہ کا رسول جو پاک صحیفے پڑھ کر سنائے ۔"
   },
   {
    "Aya": " ﴾فِيهَا كُتُبٌ قَيِّمَةٌ ﴿٣‎",
    "ابوالاعلی مودودی ": "جن میں بالکل راست اور درست تحریریں لکھی ہوئی ہوں",
    "  احمد رضا خان ": "ان میں سیدھی باتیں لکھی ہیں",
    "احمد علی ": "جن میں درست مضامین لکھے ہوں",
    "  جالندہری ": "جن میں (مستحکم) آیتیں لکھی ہوئی ہیں",
   "  طاہر القادری": "جن میں درست اور مستحکم احکام (درج) ہیں،",
    "   علامہ جوادی": "جن میں قیمتی اور مضبوط باتیں لکھی ہوئی ہیں",
    " محمد جوناگڑھی": "جن میں صحیح اور درست احکام ہوں",
    " محمد حسین نجفی ": "جن میں بالکل درست باتیں لکھی ہوئی ہوں۔",
    "مفتی تقی عثمانی": "جن میں سیدھی سچی تحریریں لکھی ہوں ۔"
   },
   {
    "Aya": " ﴾وَمَا تَفَرَّقَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَّا مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَةُ ﴿٤ ‎",
    "ابوالاعلی مودودی ": "پہلے جن لوگوں کو کتاب دی گئی تھی اُن میں تفرقہ برپا نہیں ہوا مگر اِس کے بعد کہ اُن کے پاس (راہ راست) کا بیان واضح آ چکا تھا",
    "  احمد رضا خان ": "اور پھوٹ نہ پڑی کتاب والوں میں مگر بعد اس کے کہ وہ روشن دلیل ان کے پاس تشریف لائے",
    "احمد علی ": "اور اہلِ کتاب نے جو اختلاف کیا تو واضح دلیل آنے کے بعد",
    "  جالندہری ": "اور اہل کتاب جو متفرق (و مختلف) ہوئے ہیں تو دلیل واضح آنے کے بعد (ہوئے ہیں)",
   "  طاہر القادری": "ان اہل کتاب میں (نبی آخر الزماں صلی اللہ علیہ وآلہ وسلم کی نبوت و رسالت پر ایمان لانے اور آپ کی شانِ اقدس کو پہچاننے کے بارے میں پہلے) کوئی پھوٹ نہ پڑی تھی مگر اس کے بعد کہ جب (بعثتِ محمدی صلی اللہ علیہ وآلہ وسلم کی) روشن دلیل ان کے پاس آگئی (تو وہ باہم بٹ گئے کوئی ان پر ایمان لے آیا اور کوئی حسد کے باعث منکر و کافر ہوگیا)،",
    "   علامہ جوادی": "اور یہ اہل کتاب متفرق نہیں ہوئے مگر اس وقت جب ان کے پاس کِھلی ہوئی دلیل آگئی",
    " محمد جوناگڑھی": "اہل کتاب اپنے پاس ﻇاہر دلیل آجانے کے بعد ہی (اختلاف میں پڑ کر) متفرق ہوگئے",
    " محمد حسین نجفی ": "اور جن لوگوں کو کتاب دی گئی تھی (اور وہ اہلِ کتاب تھے) وہ تو واضح دلیل کے آجانے کے بعد ہی تفرقہ میں پڑے۔",
    "مفتی تقی عثمانی": "اور جو اہل کتاب تھے ، انہوں نے جدا راستہ اسی کے بعد اختیار کیا جب ان کے پاس روش دلیل آچکی تھی ۔"
   },
   {
    "Aya": " ﴾وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ حُنَفَاءَ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ ۚ وَذَٰلِكَ دِينُ الْقَيِّمَةِ ﴿٥‎",
    "ابوالاعلی مودودی ": "اور اُن کو اِس کے سوا کوئی علم نہیں دیا گیا تھا کہ اللہ کی بندگی کریں اپنے دین کو اُس کے لیے خالص کر کے، بالکل یکسو ہو کر، اور نماز قائم کریں اور زکوٰۃ دیں یہی نہایت صحیح و درست دین ہے",
    "  احمد رضا خان ": "اور ان لوگوں کو تو یہی حکم ہوا کہ اللہ کی بندگی کریں نرے اسی پر عقیدہ لاتے ایک طرف کے ہوکر اور نماز قائم کریں اور زکوٰة دیں اور یہ سیدھا دین ہے،",
    "احمد علی ": "اور انہیں صرف یہی حکم دیا گیا تھا کہ الله کی عبادت کریں ایک رخ ہو کر خالص اسی کی اطاعت کی نیت سے اورنماز قائم کریں اور زکواة دیں اور یہی محکم دین ہے",
    "  جالندہری ": "اور ان کو حکم تو یہی ہوا تھا کہ اخلاص عمل کے ساتھ خدا کی عبادت کریں (اور) یکسو ہو کراورنماز پڑھیں اور زکوٰة دیں اور یہی سچا دین ہے",
   "  طاہر القادری": "حالانکہ انہیں فقط یہی حکم دیا گیا تھا کہ صرف اسی کے لئے اپنے دین کو خالص کرتے ہوئے اﷲ کی عبادت کریں، (ہر باطل سے جدا ہو کر) حق کی طرف یک سُوئی پیدا کریں اور نماز قائم کریں اور زکوٰۃ دیا کریں اور یہی سیدھا اور مضبوط دین ہے،",
    "   علامہ جوادی": "اور انہیں صرف اس بات کا حکم دیا گیا تھا کہ خدا کی عبادت کریں اور اس عبادت کو اسی کے لئے خالص رکھیں اور نماز قائم کریں اور زکوٰہ ادا کریں اور یہی سچاّ اور مستحکم دین ہے",
    " محمد جوناگڑھی": "انہیں اس کے سوا کوئی حکم نہیں دیا گیا کہ صرف اللہ کی عبادت کریں اسی کے لئے دین کو خالص رکھیں۔ ابراہیم حنیف کے دین پر اور نماز کو قائم رکھیں اور زکوٰة دیتے رہیں یہی ہے دین سیدھی ملت کا",
    " محمد حسین نجفی ": "حالانکہ انہیں تو بس یہی حکم دیا گیا تھا کہ دین کو اسی کیلئے خالص کرتے ہوئے اللہ کی عبادت کریں بالکل یکسُو ہو کر اور نماز قائم کریں اور زکوٰۃ دیں اور یہی نہایت (صحیح اور) درست دین ہے",
    "مفتی تقی عثمانی": "اور ‌انہیں ‌اس ‌كے ‌سوا ‌كوئی ‌اور ‌حكم ‌نہیں ‌دیا ‌گیا ‌تھا ‌كہ ‌وہ ‌اللہ ‌كی ‌عبادت ‌اس ‌طرح ‌كریں ‌كہ ‌بندگی ‌كو ‌بلكل ‌یكسو ‌ہوكر ‌صرف ‌اسی ‌كے ‌لیے ‌خالص ‌ركھیں ، ‌اور ‌نماز ‌قائم ‌كریں ‌اور ‌زكواة ‌ادا ‌كریں ، ‌اور ‌یہی ‌سیدھی ‌سچی ‌امت ‌كا ‌دین ‌ہے "
   },
   {
    "Aya": " ﴾إِنَّ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ وَالْمُشْرِكِينَ فِي نَارِ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ أُولَٰئِكَ هُمْ شَرُّ الْبَرِيَّةِ ﴿٦  ",
    "ابوالاعلی مودودی ": "اہل کتاب اور مشرکین میں سے جن لوگوں نے کفر کیا ہے وہ یقیناً جہنم کی آگ میں جائیں گے اور ہمیشہ اس میں رہیں گے، یہ لوگ بد ترین خلائق ہیں",
    "  احمد رضا خان ": "بیشک جتنے کافر ہیں کتابی اور مشرک سب جہنم کی آگ میں ہیں ہمیشہ اس میں رہیں گے، وہی تمام مخلوق میں بدتر ہیں،",
    "احمد علی ": "بے شک جو لوگ اہلِ کتاب میں سے منکر ہوئے اور مشرکین وہ دوزخ کی آگ میں ہوں گے اس میں ہمیشہ رہیں گے یہی لوگ بدترین مخلوقات ہیں",
    "  جالندہری ": "جو لوگ کافر ہیں (یعنی) اہل کتاب اور مشرک وہ دوزخ کی آگ میں پڑیں گے (اور) ہمیشہ اس میں رہیں گے۔ یہ لوگ سب مخلوق سے بدتر ہیں",
   "  طاہر القادری": "بیشک جو لوگ اہلِ کتاب میں سے کافر ہوگئے اور مشرکین (سب) دوزخ کی آگ میں (پڑے) ہوں گے وہ ہمیشہ اسی میں رہنے والے ہیں، یہی لوگ بد ترین مخلوق ہیں،",
    "   علامہ جوادی": "بے شک اہل کتاب میں جن لوگوں نے کفر اختیار کیا ہے اور دیگر مشرکین سب جہنمّ میں ہمیشہ رہنے والے ہیں اور یہی بدترین خلائق ہیں",
    " محمد جوناگڑھی": "بیشک جو لوگ اہل کتاب میں کافر ہوئے اور مشرکین سب دوزخ کی آگ میں (جائیں گے) جہاں وه ہمیشہ (ہمیشہ) رہیں گے۔ یہ لوگ بدترین خلائق ہیں",
    " محمد حسین نجفی ": "بےشک جو اہلِ کتاب اور مشرکین کفر میں مبتلا ہیں وہ جہنم کی آگ میں پڑیں گے (اور) ہمیشہ اس میں رہیں گے یہی لوگ بدترینِ خلائق ہیں۔",
    "مفتی تقی عثمانی": "یقین جانو کہ اہل کتاب اور مشرکین میں سے جنہوں نے کفر اپنا لیا ہے وہ جہنم کی آگ میں جائیں گے جہاں وہ ہمیشہ رہیں گے ۔ یہ لوگ ساری مخلوق میں سب سے برے ہیں ۔"
   },
   {
    "Aya": " ﴾‏إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أُولَٰئِكَ هُمْ خَيْرُ الْبَرِيَّةِ ﴿٧‎‏",
    "ابوالاعلی مودودی ": "جو لوگ ایمان لے آئے اور جنہوں نے نیک عمل کیے، وہ یقیناً بہترین خلائق ہیں",
    "  احمد رضا خان ": "بیشک جو ایمان لائے اور اچھے کام کیے وہی تمام مخلوق ہیں بہتر ہیں،",
    "احمد علی ": "بے شک جولوگ ایمان لائے اورنیک کام کیے یہی لوگ بہترین مخلوقات ہیں",
    "  جالندہری ": "اور جو لوگ ایمان لائے اور نیک عمل کرتے رہے وہ تمام خلقت سے بہتر ہیں",
   "  طاہر القادری": "بیشک جو لوگ ایمان لائے اور نیک عمل کرتے رہے وہی لوگ ساری مخلوق سے بہتر ہیں،",
    "   علامہ جوادی": "اور بے شک جو لوگ ایمان لائے ہیں اور انہوں نے نیک اعمال کئے ہیں وہ بہترین خلائق ہیں",
    " محمد جوناگڑھی": "بیشک جو لوگ ایمان ﻻئےاور نیک عمل کیے یہ لوگ بہترین خلائق ہیں",
    " محمد حسین نجفی ": "اور بےشک جو لوگ ایمان لائے اور نیک عمل کئے وہی بہترینِ خلائق ہیں۔",
    "مفتی تقی عثمانی": "جو لوگ ایمان لائے ہیں اور انہوں نے نیک عمل کیے ہیں وہ بیشک ساری مخلوق میں سب سے بہتر ہیں"
   },
   {
   "Aya": " ﴾‏جَزَاؤُهُمْ عِندَ رَبِّهِمْ جَنَّاتُ عَدْنٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۖ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ ۚ ذَٰلِكَ لِمَنْ خَشِيَ رَبَّهُ ﴿٨‏",
   "ابوالاعلی مودودی ": "اُن کی جزا اُن کے رب کے ہاں دائمی قیام کی جنتیں ہیں جن کے نیچے نہریں بہ رہی ہوں گی، وہ ان میں ہمیشہ ہمیشہ رہیں گے اللہ ان سے راضی ہوا اور وہ اللہ سے راضی ہوئے یہ کچھ ہے اُس شخص کے لیے جس نے اپنے رب کا خوف کیا ہو",
   "  احمد رضا خان ": "ان کا صلہ ان کے رب کے پاس بسنے کے باغ ہیں جن کے نیچے نہریں بہیں ان میں ہمیشہ ہمیشہ رہیں، اللہ ان سے راضی اور وہ اس سے راضی یہ اس کے لیے ہے جو اپنے رب سے ڈرے",
   "احمد علی ": "ان کا بدلہ ان کے رب کے ہاں ہمیشہ رہنے کے بہشت ہیں ان کے نیچے نہریں بہتی ہوں گی وہ ان میں ہمیشہ ہمیشہ رہیں گے الله ان سے راضی ہوا اور وہ اس سے راضی ہوئے یہ اس کے لئےہے جو اپنے رب سے ڈرتا ہے",
   "  جالندہری ": "ان کا صلہ ان کے پروردگار کے ہاں ہمیشہ رہنے کے باغ ہیں جن کے نیچے نہریں بہہ رہی ہیں ابدالاباد ان میں رہیں گے۔ خدا ان سے خوش اور وہ اس سے خوش۔ یہ (صلہ) اس کے لیے ہے جو اپنے پروردگار سے ڈرتا رہا",
  "  طاہر القادری": "ان کی جزا ان کے رب کے حضور دائمی رہائش کے باغات ہیں جن کے نیچے سے نہریں رواں ہیں، وہ ان میں ہمیشہ ہمیشہ رہیں گے، اﷲ اُن سے راضی ہوگیا ہے اور وہ لوگ اس سے راضی ہیں، یہ (مقام) اس شخص کے لئے ہے جو اپنے رب سے خائف رہا،",
   "   علامہ جوادی": "پروردگار کے یہاں ان کی جزائ وہ باغات ہیں جن کے نیچے نہریں جاری ہوں گی وہ انہی میں ہمیشہ رہنے والے ہیں خدا ان سے راضی ہے اور وہ اس سے راضی ہیں اور یہ سب اس کے لئے ہے جس کے دل میں خوف خدا ہے",
   " محمد جوناگڑھی": "ان کا بدلہ ان کے رب کے پاس ہمیشگی والی جنتیں ہیں جن کے نیچے نہریں بہہ رہی ہیں جن میں وه ہمیشہ ہمیشہ رہیں گے۔ اللہ تعالیٰ ان سے راضی ہوا اور یہ اس سے راضی ہوئے۔ یہ ہے اس کے لئے جو اپنے پروردگار سے ڈرے",
   " محمد حسین نجفی ": "ان کی جزا ان کے پروردگار کے ہاں ہمیشگی کی جنتیں ہیں جن کے نیچے نہریں جاری ہیں وہ ان میں ہمیشہ ہمیشہ رہیں گے اللہ ان سے راضی ہے اور وہ اللہ سے راضی ہیں (یہ سب کچھ) اس کے لئے ہے جو اپنے پروردگار (کی حکم عدولی) سے ڈرتا ہے۔",
   "مفتی تقی عثمانی": "ان ‌كے ‌پروردگار ‌كے ‌پاس ‌ان ‌كا ‌انعام ‌وہ ‌سدا ‌بہار ‌جنتیں ‌ہیں ‌جن ‌كے ‌نیچے ‌سے ‌نہریں ‌بہتی ‌ہیں ‌وہاں ‌وہ ‌ہمیشہ ‌ہمیشہ ‌رہیں ‌گے ۔ ‌اللہ ‌ان ‌سے ‌خوش ‌ہوگا ‌اور ‌وہ ‌اس ‌سے ‌خوش ‌ہوں ‌گے ۔ ‌یہ ‌سب ‌كچھ ‌اس ‌كے ‌لیے ‌ہے ‌جو ‌اپنے ‌پروردگار ‌كا ‌خوف ‌دل ‌میں ‌ركھتا ‌ہو ۔ ‌"
  }
  ]