[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ":"شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
       " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾‏وَيْلٌ لِّلْمُطَفِّفِينَ ﴿١"   ,
      "ابوالاعلی مودودی ": "تباہی ہے ڈنڈی مارنے والوں کے لیے",
       "  احمد رضا خان ":  "کم تولنے والوں کی خرابی ہے،",
      "احمد علی ":"کم تولنے والوں کے لیے تباہی ہے",
      "  جالندہری ": "ناپ اور تول میں کمی کرنے والوں کے لیے خرابی ہے",
     "  طاہر القادری": "بربادی ہے ناپ تول میں کمی کرنے والوں کے لئے،",
      "   علامہ جوادی": "ویل ہے ان کے لئے جو ناپ تول میں کمی کرنے والے ہیں",
      " محمد جوناگڑھی": "بڑی خرابی ہے ناپ تول میں کمی کرنے والوں کی",
       " محمد حسین نجفی ": "بربادی ہے ناپ تول میں کمی کرنے (ڈنڈی مارنے) والوں کے لئے۔",
      "مفتی تقی عثمانی": "بڑی خرابی ہے ناپ تول میں کمی کرنے والوں کی ۔"
     },
     {
      "Aya": " ﴾‏الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ ﴿٢  ‎‏",
      "ابوالاعلی مودودی ": "جن کا حال یہ ہے کہ جب لوگوں سے لیتے ہیں تو پورا پورا لیتے ہیں",
       "  احمد رضا خان ":  "وہ کہ جب اوروں سے ناپ لیں پورا لیں،",
      "احمد علی ":"وہ لوگ کہ جب لوگوں سے ماپ کر لیں تو پورا کریں",
      "  جالندہری ": "جو لوگوں سے ناپ کر لیں تو پورا لیں",
     "  طاہر القادری": "یہ لوگ جب (دوسرے) لوگوں سے ناپ لیتے ہیں تو (ان سے) پورا لیتے ہیں،",
      "   علامہ جوادی": "یہ جب لوگوں سے ناپ کرلیتے ہیں تو پورا مال لے لیتے ہیں",
      " محمد جوناگڑھی": "کہ جب لوگوں سے ناپ کر لیتے ہیں تو پورا پورا لیتے ہیں",
       " محمد حسین نجفی ": "جب وہ (اپنے لئے) لوگوں سےناپ کر لیں تو پورا لیتے ہیں",
      "مفتی تقی عثمانی": "جن کا حال یہ ہے کہ جب وہ لوگوں سے خود کوئی چیز ناپ کرلیتے ہیں تو پوری پوری لیتے ہیں"
     },
     {
      "Aya": " ﴾‏وَإِذَا كَالُوهُمْ أَو وَّزَنُوهُمْ يُخْسِرُونَ ﴿  ٣    ‎‏",
      "ابوالاعلی مودودی ": "اور جب ان کو ناپ کر یا تول کر دیتے ہیں تو انہیں گھاٹا دیتے ہیں",
       "  احمد رضا خان ":  "اور جب انہیں ناپ تول کردی کم کردیں،",
      "احمد علی ":"اور جب ان کو ماپ کر یا تول کردیں توگھٹا کر دیں",
      "  جالندہری ": "اور جب ان کو ناپ کر یا تول کر دیں تو کم کر دیں",
     "  طاہر القادری": "اور جب انہیں (خود) ناپ کر یا تول کر دیتے ہیں تو گھٹا کر دیتے ہیں،",
      "   علامہ جوادی": "اور جب ان کے لئے ناپتے یا تولتے ہیں تو کم کردیتے ہیں",
      " محمد جوناگڑھی": "اور جب انہیں ناپ کر یا تول کر دیتے ہیں تو کم دیتے ہیں",
       " محمد حسین نجفی ": "اور جب لوگوں کو ناپ کر یا تول کر دیتے ہیں تو انہیں گھاٹا دیتے ہیں۔",
      "مفتی تقی عثمانی": "اور جب وہ کسی کو ناپ کر یا تول کردیتے ہیں تو گھٹا کردیتے ہیں ۔"
     },
     {
      "Aya": "﴾‏أَلَا يَظُنُّ أُولَٰئِكَ أَنَّهُم مَّبْعُوثُونَ ﴿٤‎‏",
      "ابوالاعلی مودودی ": "کیا یہ لوگ نہیں سمجھتے کہ ایک بڑے دن،",
       "  احمد رضا خان ":  "کیا ان لوگوں کو گمان نہیں کہ انہیں اٹھنا ہے،",
      "احمد علی ":"کیا وہ خیال نہیں کرتے کہ وہ اٹھائے جائیں گے",
      "  جالندہری ": "کیا یہ لوگ نہیں جانتے کہ اٹھائے بھی جائیں گے",
     "  طاہر القادری": "کیا یہ لوگ اس بات کا یقین نہیں رکھتے کہ وہ (مرنے کے بعد دوبارہ) اٹھائے جائیں گے،",
      "   علامہ جوادی": "کیا انہیں یہ خیال نہیں ہے کہ یہ ایک روز دوبارہ اٹھائے جانے والے ہیں",
      " محمد جوناگڑھی": "کیا انہیں اپنے مرنے کے بعد جی اٹھنے کا خیال نہیں",
       " محمد حسین نجفی ": "کیا یہ لوگ خیال نہیں کرتے کہ وہ (دوبارہ زندہ کر کے) اٹھائے جائیں گے۔",
      "مفتی تقی عثمانی": "کیا یہ لوگ یہ نہیں سوچتے کہ انہیں زندہ کر کے ا ٹھایا جائے گا؟"
     },
     {
      "Aya": " ﴾‏لِيَوْمٍ عَظِيمٍ ﴿٥ ‎‎",
      "ابوالاعلی مودودی ": "یہ اٹھا کر لائے جانے والے ہیں؟",
       "  احمد رضا خان ":  "ایک عظمت والے دن کے لیے",
      "احمد علی ":"اس بڑے دن کے لیے",
      "  جالندہری ": " ایک بڑے (سخت) دن میں",
     "  طاہر القادری": "ایک بڑے سخت دن کے لئے،",
      "   علامہ جوادی": "بڑے سخت دن میں",
      " محمد جوناگڑھی": "اس عظیم دن کے لئے",
       " محمد حسین نجفی ": "ایک بڑے (سخت) دن کیلئے۔",
      "مفتی تقی عثمانی": "ایک بڑے زبردست دن میں"
     },
     {
      "Aya": " ﴾‏يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ ﴿٦‎‏",
      "ابوالاعلی مودودی ": "اُس دن جبکہ سب لوگ رب العالمین کے سامنے کھڑے ہوں گے",
       "  احمد رضا خان ":  "جس دن سب لوگ رب العالمین کے حضور کھڑے ہوں گے،",
      "احمد علی ":"جس دن سب لوگ رب العالمین کے سامنے کھڑے ہو ں گے",
      "  جالندہری ": "جس دن (تمام) لوگ رب العالمین کے سامنے کھڑے ہوں گے",
     "  طاہر القادری": "جس دن سب لوگ تمام جہانوں کے رب کے حضور کھڑے ہوں گے،",
      "   علامہ جوادی": "جس دن سب رب العالمین کی بارگاہ میں حاضر ہوں گے",
      " محمد جوناگڑھی": "جس دن سب لوگ رب العالمین کے سامنے کھڑے ہوں گے",
       " محمد حسین نجفی ": "جس دن تمام لوگ ربُ العالمین کی بارگاہ میں پیشی کیلئے کھڑے ہوں گے۔",
      "مفتی تقی عثمانی": "جس دن سب لوگ رب العالمین کے سامنے کھڑے ہوں گے ۔"
     },
     {
      "Aya": "﴾‏كَلَّا إِنَّ كِتَابَ الْفُجَّارِ لَفِي سِجِّينٍ ﴿٧ ‎",
      "ابوالاعلی مودودی ": "ہرگز نہیں، یقیناً بد کاروں کا نامہ اعمال قید خانے کے دفتر میں ہے",
       "  احمد رضا خان ":  "بیشک کافروں کی لکھت سب سے نیچی جگہ سجین میں ہے",
      "احمد علی ":"ہر گز ایسا نہیں چاہیے بے شک نافرمانوں کے اعمال نامے سجین میں ہیں",
      "  جالندہری ": "سن رکھو کہ بدکارروں کے اعمال سجّین میں ہیں",
     "  طاہر القادری": "یہ حق ہے کہ بدکرداروں کا نامۂ اعمال سجین (یعنی دیوان خانۂ جہنم) میں ہے،",
      "   علامہ جوادی": "یاد رکھو کہ بدکاروں کا نامہ اعمال سجین میں ہوگا",
      " محمد جوناگڑھی": "یقیناً بدکاروں کا نامہٴ اعمال سِجِّينٌ میں ہے",
       " محمد حسین نجفی ": "ہرگز نہیں! بےشک بدکاروں کا نامۂ اعمال سِجِّین (قید خانہ کے دفتر) میں ہے۔",
      "مفتی تقی عثمانی": "ہرگز ایسا نہیں چاہیے ! یقین جانو کہ بدکار لوگوں کا اعمال نامہ سجین میں ہے"
     },
     {
      "Aya": "﴾‏وَمَا أَدْرَاكَ مَا سِجِّينٌ ﴿٨‎‏ ",
      "ابوالاعلی مودودی ": "اور تمہیں کیا معلوم کہ وہ قید خانے کا دفتر کیا ہے؟",
       "  احمد رضا خان ":  "اور تو کیا جانے سجین کیسی ہے",
      "احمد علی ":"اور آپ کو کیا خبر کہ سجین کیا ہے",
      "  جالندہری ": "اور تم کیا جانتے ہوں کہ سجّین کیا چیز ہے؟",
     "  طاہر القادری": "اور آپ نے کیا جانا کہ سجین کیا ہے،",
      "   علامہ جوادی": "اور تم کیا جو کہ سجین کیا ہے",
      " محمد جوناگڑھی": "تجھے کیا معلوم سِجِّينٌ کیا ہے؟",
       " محمد حسین نجفی ": "تمہیں کیا معلوم کہ سِجِّین کیا ہے؟",
      "مفتی تقی عثمانی": "اور تمہیں کیا معلوم کہ سجین ( میں رکھا ہوا اعمال نامہ ) کیا چیز ہے؟"
     },
     {
      "Aya": "﴾‏كِتَابٌ مَّرْقُومٌ ﴿٩‎‏",
      "ابوالاعلی مودودی ": "ایک کتاب ہے لکھی ہوئی",
       "  احمد رضا خان ":  "وہ لکھت ایک مہر کیا نوشتہ ہے",
      "احمد علی ":"ایک دفتر ہے جس میں لکھا جاتا ہے",
      "  جالندہری ": "ایک دفتر ہے لکھا ہوا",
     "  طاہر القادری": "یہ قید خانۂ دوزخ میں اس بڑے دیوان کے اندر لکھی ہوئی (ایک) کتاب ہے (جس میں ہر جہنمی کا نام اور اس کے اعمال درج ہیں)،",
      "   علامہ جوادی": "ایک لکھا ہوا دفتر ہے",
      " محمد جوناگڑھی": "یہ تو لکھی ہوئی کتاب ہے",
       " محمد حسین نجفی ": "یہ ایک لکھی ہوئی کتاب ہے (جس میں بدکاروں کے عمل درج ہیں)۔",
      "مفتی تقی عثمانی": "وہ ایک لکھی ہوئی کتاب ہے ۔"
     },
     {
      "Aya": " ﴾‏وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ ﴿١٠  ‎",
      "ابوالاعلی مودودی ": "تباہی ہے اُس روز جھٹلانے والوں کے لیے",
       "  احمد رضا خان ":  "اس دن جھٹلانے والوں کی خرابی ہے،",
      "احمد علی ":"اس دن جھٹلانے والوں کے لئے تباہی ہے",
      "  جالندہری ": "اس دن جھٹلانے والوں کی خرابی ہے",
     "  طاہر القادری": "اس دن جھٹلانے والوں کے لئے تباہی ہوگی،",
      "   علامہ جوادی": "آج کے دن ان جھٹلانے والوں کے لئے بربادی ہے",
      " محمد جوناگڑھی": "اس دن جھٹلانے والوں کی بڑی خرابی ہے",
       " محمد حسین نجفی ": "بربادی ہے اس دن جھٹلانے والوں کیلئے۔",
      "مفتی تقی عثمانی": "اس دن بڑی خرابی ہوگی حق کو جھٹلانے والوں کی "
     },
     {
      "Aya": " ﴾‏الَّذِينَ يُكَذِّبُونَ بِيَوْمِ الدِّينِ ﴿١١‎",
      "ابوالاعلی مودودی ": "جو روز جزا کو جھٹلاتے ہیں",
       "  احمد رضا خان ":  "جو انصاف کے دن کو جھٹلاتے ہیں",
      "احمد علی ":"وہ جو انصاف کے دن کو جھٹلاتے ہیں",
      "  جالندہری ": "جو انصاف کے دن کو جھٹلاتے ہیں",
     "  طاہر القادری": "جو لوگ روزِ جزا کو جھٹلاتے ہیں،",
      "   علامہ جوادی": "جو لوگ روز جزا کا انکار کرتے ہیں",
      " محمد جوناگڑھی": "جو جزا وسزا کے دن کو جھٹلاتے رہے",
       " محمد حسین نجفی ": "جو جزا و سزا کے دن (قیامت) کو جھٹلاتے ہیں۔",
      "مفتی تقی عثمانی": "جو جزا و سزا کے دن کو جھٹلاتے ہیں "
     },
     {
      "Aya": " ﴾‏وَمَا يُكَذِّبُ بِهِ إِلَّا كُلُّ مُعْتَدٍ أَثِيمٍ ﴿١٢‎‏ ",
      "ابوالاعلی مودودی ": "اور اُسے نہیں جھٹلاتا مگر ہر وہ شخص جو حد سے گزر جانے والا بد عمل ہے",
       "  احمد رضا خان ":  "اور اسے نہ جھٹلائے گا مگر ہر سرکش",
      "احمد علی ":"اور اس کو وہی جھٹلاتا ہے جو حد سے بڑھا ہوا گناہگار ہے",
      "  جالندہری ": "اور اس کو جھٹلاتا وہی ہے جو حد سے نکل جانے والا گنہگار ہے",
     "  طاہر القادری": "اور اسے کوئی نہیں جھٹلاتا سوائے ہر اس شخص کے جو سرکش و گنہگار ہے،",
      "   علامہ جوادی": "اور اس کا انکار صرف وہی کرتے ہیں جو حد سے گزر جانے والے گنہگار ہیں",
      " محمد جوناگڑھی": "اسے صرف وہی جھٹلاتا ہےجو حد سے آگے نکل جانے واﻻ (اور) گناه گار ہوتا ہے",
       " محمد حسین نجفی ": "اور اس دن کو نہیں جھٹلاتا مگر وہ شخص جو حد سے گزر نے والا (اور) گنہگار ہے۔",
      "مفتی تقی عثمانی": "اور اس دن کو وہی جھٹلاتا ہے جو حد سے گذرا ہوا گنہگار ہو"
     },
     {
      "Aya": "﴾‏إِذَا تُتْلَىٰ عَلَيْهِ آيَاتُنَا قَالَ أَسَاطِيرُ الْأَوَّلِينَ ﴿١٣  ‎",
      "ابوالاعلی مودودی ": "اُسے جب ہماری آیات سنائی جاتی ہیں تو کہتا ہے یہ تو اگلے وقتوں کی کہانیاں ہیں",
       "  احمد رضا خان ":  "جب اس پر ہماری آیتیں پڑھی جائیں کہے اگلوں کی کہانیاں ہیں،",
      "احمد علی ":"جب اس پر ہماری آیتیں پڑھی جاتی ہیں تو کہتا ہے پہلوں کی کہانیاں ہیں",
      "  جالندہری ": "جب اس کو ہماری آیتیں سنائی جاتی ہیں تو کہتا ہے کہ یہ تو اگلے لوگوں کے افسانے ہیں",
     "  طاہر القادری": "جب اس پر ہماری آیتیں پڑھ کر سنائی جاتی ہیں تو کہتا (یا سمجھتا) ہے کہ (یہ تو) اگلے لوگوں کی کہانیاں ہیں،",
      "   علامہ جوادی": "جب ان کے سامنے آیات کی تلاوت کی جاتی ہے تو کہتے ہیں کہ یہ تو پرانے افسانے ہیں",
      " محمد جوناگڑھی": "جب اس کے سامنے ہماری آیتیں پڑھی جاتی ہیں تو کہہ دیتا ہے کہ یہ اگلوں کے افسانے ہیں",
       " محمد حسین نجفی ": "کہ جب اس کے سامنے ہماری آیتیں پڑھی جاتی ہیں تو وہ کہتا ہے کہ یہ تو پہلے زمانے والوں کے افسانے ہیں۔",
      "مفتی تقی عثمانی": "اسے جب ہماری آیتیں پڑھ کر سنائی جاتی ہوں تو وہ کہتا ہو کہ : یہ تو پچھلے لوگوں کے افسانے ہیں "
     },
     {
      "Aya":  " ﴾‏كَلَّا ۖ بَلْ ۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُوا يَكْسِبُونَ ﴿١٤‎",
      "ابوالاعلی مودودی ": "ہرگز نہیں، بلکہ دراصل اِن لوگوں کے دلوں پر اِن کے برے اعمال کا زنگ چڑھ گیا ہے",
       "  احمد رضا خان ":  "کوئی نہیں بلکہ ان کے دلوں پر زنگ چڑھادیا ہے ان کی کمائیوں نے",
      "احمد علی ":"ہر گز نہیں بلکہ ان کے (بڑے) کاموں سے ان کے دلو ں پر زنگ لگ گیا ہے",
      "  جالندہری ": "دیکھو یہ جو (اعمال بد) کرتے ہیں ان کا ان کے دلوں پر زنگ بیٹھ گیا ہے",
     "  طاہر القادری": "ہرگز نہیں بلکہ (حقیقت یہ ہے کہ) ان کے دلوں پر ان اَعمالِ (بد) کا زنگ چڑھ گیا ہے جو وہ کمایا کرتے تھے (اس لیے آیتیں ان کے دل پر اثر نہیں کرتیں)،",
      "   علامہ جوادی": "نہیں نہیں بلکہ ان کے دلوں پر ان کے اعمال کا زنگ لگ گیا ہے",
      " محمد جوناگڑھی": "یوں نہیں بلکہ ان کے دلوں پر ان کےاعمال کی وجہ سے زنگ (چڑھ گیا) ہے",
       " محمد حسین نجفی ": "ہرگز نہیں بلکہ ان کے دلوں پر ان کے اعمال کا زَنگ چڑھ گیا ہے جو وہ کرتے ہیں۔",
      "مفتی تقی عثمانی": "ہرگز نہیں ! بلکہ جو عمل یہ کرتے رہے ہیں اس نے ان کے دلوں پر زنگ چڑھا دیا ہے ۔"
     },
     {
      "Aya": " ﴾‏كَلَّا إِنَّهُمْ عَن رَّبِّهِمْ يَوْمَئِذٍ لَّمَحْجُوبُونَ ﴿١٥   ‎‏ ",
      "ابوالاعلی مودودی ": "ہرگز نہیں، بالیقین اُس روز یہ اپنے رب کی دید سے محروم رکھے جائیں گے",
       "  احمد رضا خان ":  "ہاں ہاں بیشک وہ اس دن اپنے رب کے دیدار سے محروم ہیں",
      "احمد علی ":"ہر گز نہیں بے شک وہ اپنے رب سے اس دن روک دیئے جائیں گے",
      "  جالندہری ": "بےشک یہ لوگ اس روز اپنے پروردگار (کے دیدار) سے اوٹ میں ہوں گے",
     "  طاہر القادری": "حق یہ ہے کہ بیشک اس دن انہیں اپنے ر ب کے دیدار سے (محروم کرنے کے لئے) پسِ پردہ کر دیا جائے گا،",
      "   علامہ جوادی": "یاد رکھو انہیں روز قیامت پروردگار کی رحمت سے محجوب کردیا جائے گا",
      " محمد جوناگڑھی": "ہرگز نہیں یہ لوگ اس دن اپنے رب سےاوٹ میں رکھے جائیں گے",
       " محمد حسین نجفی ": "ہرگز (ایسا نہیں کہ جزا وسزا نہ ہو) یہ لوگ اس دن اپنے پروردگار (کی رحمت سے) (محجوب اور محروم) رہیں گے۔",
      "مفتی تقی عثمانی": "ہرگز نہیں ! حقیقت یہ ہے کہ یہ لوگ اس دن اپنے پروردگار کے دیدار سے محروم ہوں گے ۔"
     },
     {
      "Aya": " ﴾‏ثُمَّ إِنَّهُمْ لَصَالُو الْجَحِيمِ ﴿١٦‎‏",
      "ابوالاعلی مودودی ": "پھر یہ جہنم میں جا پڑیں گے",
       "  احمد رضا خان ":  "پھر بیشک انہیں جہنم میں داخل ہونا،",
      "احمد علی ":"پھر بے شک وہ دوزخ میں گرنے والے ہیں",
      "  جالندہری ": "پھر دوزخ میں جا داخل ہوں گے",
     "  طاہر القادری": "پھر وہ دوزخ میں جھونک دیئے جائیں گے،",
      "   علامہ جوادی": "پھر اس کے بعد یہ جہنمّ میں جھونکے جانے والے ہیں",
      " محمد جوناگڑھی": "پھر یہ لوگ بالیقین جہنم میں جھونکے جائیں گے",
       " محمد حسین نجفی ": "پھر یہ لوگ جہنم میں ڈالے جائیں گے۔",
      "مفتی تقی عثمانی": "پھر ان کو دوزخ میں داخل ہونا پڑے گا ۔"
     },
     {
      "Aya": "﴾‏ثُمَّ يُقَالُ هَٰذَا الَّذِي كُنتُم بِهِ تُكَذِّبُونَ ﴿١٧‎‏",
      "ابوالاعلی مودودی ": "پھر اِن سے کہا جائے گا کہ یہ وہی چیز ہے جسے تم جھٹلایا کرتے تھے",
       "  احمد رضا خان ":  "پھر کہا جائے گا، یہ ہے وہ جسے تم جھٹلاتے تھے",
      "احمد علی ":"پھر کہا جائے گا کہ یہی ہے وہ جسے تم جھٹلاتے تھے",
      "  جالندہری ": "پھر ان سے کہا جائے گا کہ یہ وہی چیز ہے جس کو تم جھٹلاتے تھے",
     "  طاہر القادری": "پھر ان سے کہا جائے گا: یہ وہ (عذابِ جہنم) ہے جسے تم جھٹلایا کرتے تھے،",
      "   علامہ جوادی": "پھر ان سے کہا جائے گا کہ یہی وہ ہے جس کا تم انکار رہے تھے",
      " محمد جوناگڑھی": "پھر کہہ دیا جائے گا کہ یہی ہے وه جسے تم جھٹلاتے رہے",
       " محمد حسین نجفی ": "پھر (ان سے) کہا جائے گا کہ یہی وہ جہنم ہے جس کو تم جھٹلاتے تھے۔",
      "مفتی تقی عثمانی": "پھر کہا جائے گا کہ : یہ ہے وہ چیز جس کو تم جھٹلایا کرتے تھے ۔"
     },
     {
      "Aya": " ﴾‏كَلَّا إِنَّ كِتَابَ الْأَبْرَارِ لَفِي عِلِّيِّينَ ﴿١٨ ‎",
      "ابوالاعلی مودودی ": "ہرگز نہیں، بے شک نیک آدمیوں کا نامہ اعمال بلند پایہ لوگوں کے دفتر میں ہے",
       "  احمد رضا خان ":  "ہاں ہاں بیشک نیکوں کی لکھت سب سے اونچا محل علیین میں ہے",
      "احمد علی ":"ہر گز نہیں بےشک نیکوں کے اعمال نامے علییں میں ہیں",
      "  جالندہری ": "یہ بھی سن رکھو کہ نیکوکاروں کے اعمال علیین میں ہیں",
     "  طاہر القادری": "یہ (بھی) حق ہے کہ بیشک نیکوکاروں کا نوشتہ اعمال علّیّین (یعنی دیوان خانۂ جنت) میں ہے",
      "   علامہ جوادی": "یاد رکھو کہ نیک کردار افراد کا نامہ اعمال علیین میں ہوگا",
      " محمد جوناگڑھی": "یقیناً یقیناً نیکو کاروں کا نامہٴ اعمال عِلِّیین میں ہے",
       " محمد حسین نجفی ": "ہرگز (ایسا) نہیں (کہ جزا و سزا نہ ہو) یقیناً نیکو کاروں کا نامۂ اعمال علیین (بلند مرتبہ لوگوں کے دفتر) میں ہے۔",
      "مفتی تقی عثمانی": "خبردار ! نیک لوگوں کا اعمال نامہ علیین میں ہے"
     },
     {
      "Aya": "﴾‏وَمَا أَدْرَاكَ مَا عِلِّيُّونَ ﴿١٩‎",
      "ابوالاعلی مودودی ": "اور تمہیں کیا خبر کہ کیا ہے وہ بلند پایہ لوگوں کا دفتر؟",
       "  احمد رضا خان ":  "اور تو کیا جانے علیین کیسی ہے",
      "احمد علی ":"اور آپ کو کیا خبر کہ علیّین کیا ہے",
      "  جالندہری ": "اور تم کو کیا معلوم کہ علیین کیا چیز ہے؟",
     "  طاہر القادری": "اور آپ نے کیا جانا کہ علّیّین کیا ہے،",
      "   علامہ جوادی": "اور تم کیا جانو کہ علیین کیا ہے",
      " محمد جوناگڑھی": "تجھے کیا پتہ کہ عِلِّیین کیا ہے؟",
       " محمد حسین نجفی ": "اور تمہیں کیا معلوم کہ علیین (بلند مرتبہ لوگوں کا دفتر) کیا ہے؟",
      "مفتی تقی عثمانی": "اور تمہیں کیا معلوم کہ علیین ( میں رکھا ہوا اعمال نامہ ) کیا چیز ہے؟"
     },
     {
      "Aya": "﴾‏كِتَابٌ مَّرْقُومٌ ﴿٢٠‎",
      "ابوالاعلی مودودی ": "ایک لکھی ہوئی کتاب ہے",
       "  احمد رضا خان ":  "وہ لکھت ایک مہر کیا نوشتہ ہے",
      "احمد علی ":"ایک دفتر ہے جس میں لکھا جاتا ہے",
      "  جالندہری ": "ایک دفتر ہے لکھا ہوا",
     "  طاہر القادری": "یہ جنت کے اعلیٰ درجہ میں اس بڑے دیوان کے اندر لکھی ہوئی (ایک) کتاب ہے (جس میں ان جنتیوں کے نام اور اَعمال درج ہیں جنہیں اعلیٰ مقامات دئیے جائیں گے)،",
      "   علامہ جوادی": "ایک لکھا ہوا دفتر ہے",
      " محمد جوناگڑھی": "وه تو لکھی ہوئی کتاب ہے",
       " محمد حسین نجفی ": "وہ ایک لکھی ہوئی کتاب ہے (جس میں نیکو کاروں کے عمل درج ہیں)۔",
      "مفتی تقی عثمانی": "وہ ایک لکھی ہوئی کتاب ہے ۔"
     },
     {
      "Aya": "﴾‏يَشْهَدُهُ الْمُقَرَّبُونَ ﴿٢١‎‏",
      "ابوالاعلی مودودی ": "جس کی نگہداشت مقرب فرشتے کرتے ہیں",
       "  احمد رضا خان ":  "کہ مقرب جس کی زیارت کرتے ہیں،",
      "احمد علی ":"اسے مقرب فرشتے دیکھتے ہیں",
      "  جالندہری ": "جس کے پاس مقرب (فرشتے) حاضر رہتے ہیں",
     "  طاہر القادری": "اس جگہ (اللہ کے) مقرب فرشتے حاضر رہتے ہیں،",
      "   علامہ جوادی": "جس کے گواہ ملائکہ مقربین ہیں",
      " محمد جوناگڑھی": "مقرب (فرشتے) اس کا مشاہده کرتے ہیں",
       " محمد حسین نجفی ": "جس کامشاہدہ مقرب فرشتے کرتے ہیں۔",
      "مفتی تقی عثمانی": "جسے مقرب فرشتے دیکھتے ہیں"
     },
     {
      "Aya": " ﴾‏إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ ﴿٢٢   ‎‏",
      "ابوالاعلی مودودی ": "بے شک نیک لوگ بڑے مزے میں ہوں گے",
       "  احمد رضا خان ":  "بیشک نیکوکار ضرور چین میں ہیں،",
      "احمد علی ":"بے شک نیکو کار جنت میں ہوں گے",
      "  جالندہری ": "بےشک نیک لوگ چین میں ہوں گے",
     "  طاہر القادری": "بیشک نیکوکار (راحت و مسرت سے) نعمتوں والی جنت میں ہوں گے،",
      "   علامہ جوادی": "بے شک نیک لوگ نعمتوں میں ہوں گے",
      " محمد جوناگڑھی": "یقیناً نیک لوگ (بڑی) نعمتوں میں ہوں گے",
       " محمد حسین نجفی ": "بےشک نیکوکار لوگ عیش و آرام میں ہوں گے۔",
      "مفتی تقی عثمانی": "یقین جانو کہ نیک لوگ بڑی نعمتوں میں ہوں گے ۔"
     },
     {
      "Aya": "﴾‏عَلَى الْأَرَائِكِ يَنظُرُونَ ﴿٢٣‎‏",
      "ابوالاعلی مودودی ": "اونچی مسندوں پر بیٹھے نظارے کر رہے ہوں گے",
       "  احمد رضا خان ":  "تختوں پر دیکھتے ہیں",
      "احمد علی ":"تختوں پر بیٹھے دیکھ رہے ہوں گے",
      "  جالندہری ": "تختوں پر بیٹھے ہوئے نظارے کریں گے",
     "  طاہر القادری": "تختوں پر بیٹھے نظارے کر رہے ہوں گے،",
      "   علامہ جوادی": "تختوں پر بیٹھے ہوئے نظارے کررہے ہوں گے",
      " محمد جوناگڑھی": "مسہریوں پر بیٹھے دیکھ رہے ہوں گے",
       " محمد حسین نجفی ": "اونچی مسندوں پر بیٹھ کر دیکھ رہے ہونگے (نظارے کر رہے ہوں گے)۔",
      "مفتی تقی عثمانی": "آرام دہ نشستوں پر بیٹھے نظارہ کر رہے ہوں گے"
     },
     {
      "Aya": "﴾‏تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ ﴿٢٤‎",
      "ابوالاعلی مودودی ": "ان کے چہروں پر تم خوشحالی کی رونق محسوس کرو گے",
       "  احمد رضا خان ":  "تو ان کے چہروں میں چین کی تازگی پہنچانے",
      "احمد علی ":"آپ ان کے چہروں میں نعمت کی تازگی معلوم کریں گے",
      "  جالندہری ": "تم ان کے چہروں ہی سے راحت کی تازگی معلوم کر لو گے",
     "  طاہر القادری": "آپ ان کے چہروں سے ہی نعمت و راحت کی رونق اور شگفتگی معلوم کر لیں گے،",
      "   علامہ جوادی": "تم ان کے چہروں پر نعمت کی شادابی کا مشاہدہ کروگے",
      " محمد جوناگڑھی": "تو ان کے چہروں سے ہی نعمتوں کی تروتازگی پہچان لے گا",
       " محمد حسین نجفی ": "تم ان کے چہروں پر راحت و آرام کی شادابی محسوس کرو گے۔",
      "مفتی تقی عثمانی": "ان کے چہروں پر نعمتوں میں رہنے سے جو رونق آئے گی ، تم اسے صاف پہچان لوگے ۔"
     },
     {
      "Aya": "﴾‏يُسْقَوْنَ مِن رَّحِيقٍ مَّخْتُومٍ ﴿٢٥‎‏",
      "ابوالاعلی مودودی ": "ان کو نفیس ترین سر بند شراب پلائی جائے گی جس پر مشک کی مہر لگی ہوگی",
       "  احمد رضا خان ":  "نتھری شراب پلائے جائیں گے جو مہُر کی ہوئی رکھی ہے",
      "احمد علی ":"ان کو خالص شراب مہر لگی ہوئی پلائی جائے گی",
      "  جالندہری ": "ان کو خالص شراب سربمہر پلائی جائے گی",
     "  طاہر القادری": "انہیں سر بہ مہر بڑی لذیذ شرابِ طہور پلائی جائے گی،",
      "   علامہ جوادی": "انہیں سربمہر خالص شراب سے سیراب کیا جائے گا",
      " محمد جوناگڑھی": "یہ لوگ سربمہر خالص شراب پلائے جائیں گے",
       " محمد حسین نجفی ": "انہیں سر بمہر عمدہ شراب (طہور) پلائی جائے گی۔",
      "مفتی تقی عثمانی": "انہیں ایسی خالص شراب پلائی جائے گی جس پر مہر لگی ہوگی ۔"
     },
     {
      "Aya": "﴾‏خِتَامُهُ مِسْكٌ ۚ وَفِي ذَٰلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ ﴿٢٦‎",
      "ابوالاعلی مودودی ": "جو لوگ دوسروں پر بازی لے جانا چاہتے ہوں وہ اِس چیز کو حاصل کرنے میں بازی لے جانے کی کوشش کریں",
       "  احمد رضا خان ":  "اس کی مہُر مشک پر ہے، اور اسی پر چاہیے کہ للچائیں للچانے والے",
      "احمد علی ":"اس کی مہر مشک کی ہو گی اور رغبت کرنے والوں کو اس کی رغبت کرنی چاہیئے",
      "  جالندہری ": "جس کی مہر مشک کی ہو گی تو (نعمتوں کے) شائقین کو چاہیے کہ اسی سے رغبت کریں",
     "  طاہر القادری": "اس کی مُہر کستوری کی ہوگی، اور (یہی وہ شراب ہے) جس کے حصول میں شائقین کو جلد کوشش کر کے سبقت لینی چاہیے (کوئی شرابِ نعمت کا طالب و شائق ہے، کوئی شرابِ قربت کا اور کوئی شرابِ دیدار کا۔ ہر کسی کو اس کے شوق کے مطابق پلائی جائے گی)،",
      "   علامہ جوادی": "جس کی مہر مشک کی ہوگی اور ایسی چیزوں میں شوق کرنے والوں کو آپس میں سبقت اور رغبت کرنی چاہئے",
      " محمد جوناگڑھی": "جس پر مشک کی مہر ہوگی، سبقت لے جانے والوں کو اسی میں سبقت کرنی چاہئے",
       " محمد حسین نجفی ": "جس پر مشک کی مہر ہوگی۔ اس چیز میں سبقت لے جانے والوں کو سبقت (اور رغبت) کرنی چاہیے۔",
      "مفتی تقی عثمانی": "اس کی مہر بھی مشک ہی مشک ہوگی ۔ اور یہی وہ چیز ہے جس پر للچانے والوں کو بڑھ چڑھ کر للچانا چاہیے ۔"
     },
     {
      "Aya": "﴾‏وَمِزَاجُهُ مِن تَسْنِيمٍ ﴿٢٧‎",
      "ابوالاعلی مودودی ": "اُس شراب میں تسنیم کی آمیزش ہوگی",
       "  احمد رضا خان ":  "اور اس کی ملونی تسنیم سے ہے",
      "احمد علی ":"اور اس میں تسنیم ملی ہو گی",
      "  جالندہری ": "اور اس میں تسنیم (کے پانی) کی آمیزش ہو گی",
     "  طاہر القادری": "اور اس (شراب) میں آبِ تسنیم کی آمیزش ہوگی،",
      "   علامہ جوادی": "اس شراب میں تسنیم کے پانی کی آمیزش ہوگی",
      " محمد جوناگڑھی": "اور اس کی آمیزش تسنیم کی ہوگی",
       " محمد حسین نجفی ": "ور اس (شراب میں) تسنیم کی آمیزش ہوگی",
      "مفتی تقی عثمانی": "اور اس شراب میں تسنیم کا پانی ملا ہوا ہوگا ۔"
     },
     {
      "Aya": "﴾‏عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ ﴿٢٨‎‏",
      "ابوالاعلی مودودی ": "یہ ایک چشمہ ہے جس کے پانی کے ساتھ مقرب لوگ شراب پئیں گے",
       "  احمد رضا خان ":  "وہ چشمہ جس سے مقربانِ بارگاہ پیتے ہیں",
      "احمد علی ":"وہ ایک چشمہ ہے اس میں سےمقرب پئیں گے",
      "  جالندہری ": "وہ ایک چشمہ ہے جس میں سے (خدا کے) مقرب پیئیں گے",
     "  طاہر القادری": "یہ تسنیم ایک چشمہ ہے جہاں سے صرف اہلِ قربت پیتے ہیں،",
      "   علامہ جوادی": "یہ ایک چشمہ ہے جس سے مقرب بارگاہ بندے پانی پیتے ہیں",
      " محمد جوناگڑھی": "وه چشمہ جس کا پانی مقرب لوگ پیئں گے",
       " محمد حسین نجفی ": "یہ وہ چشمہ ہے جس سے مقرب لوگ پئیں گے۔",
      "مفتی تقی عثمانی": "جو ایک ایسا چشمہ ہے کہ جس سے اللہ کے مقرب بندے پانی پئیں گے "
     },
     {
      "Aya": "﴾‏إِنَّ الَّذِينَ أَجْرَمُوا كَانُوا مِنَ الَّذِينَ آمَنُوا يَضْحَكُونَ ﴿٢٩  ‎‏ ",
      "ابوالاعلی مودودی ": "مجرم لوگ دنیا میں ایمان لانے والوں کا مذاق اڑاتے تھے",
       "  احمد رضا خان ":  "بیشک مجرم لوگ ایمان والوں سے ہنسا کرتے تھے،",
      "احمد علی ":"بے شک نافرمان (دنیا میں) ایمان داروں سے ہنسی کیا کرتے تھے",
      "  جالندہری ": "جو گنہگار (یعنی کفار) ہیں وہ (دنیا میں) مومنوں سے ہنسی کیا کرتے تھے",
     "  طاہر القادری": "بیشک مجرم لوگ ایمان والوں کا (دنیا میں) مذاق اڑایا کرتے تھے،",
      "   علامہ جوادی": "بے شک یہ مجرمین صاحبانِ ایمان کا مذاق اُڑایا کرتے تھے",
      " محمد جوناگڑھی": "گنہگار لوگ ایمان والوں کی ہنسی اڑایا کرتے تھے",
       " محمد حسین نجفی ": "بےشک جو مجرم لوگ تھے وہ (دارِ دنیا میں) اہلِ ایمان پر ہنستے تھے۔",
      "مفتی تقی عثمانی": "جو لوگ مجرم تھے ، وہ ایمان والوں پر ہنسا کرتے تھے ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا مَرُّوا بِهِمْ يَتَغَامَزُونَ ﴿٣٠‎‏",
      "ابوالاعلی مودودی ": "جب اُن کے پاس سے گزرتے تو آنکھیں مار مار کر اُن کی طرف اشارے کرتے تھے",
       "  احمد رضا خان ":  "اور جب وہ ان پر گزرتے تو یہ آپس میں ان پر آنکھوں سے اشارے کرتے",
      "احمد علی ":"اور جب ان کے پاس سے گزرتے تو آپس میں آنکھ سے اشارے کرتے تھے",
      "  جالندہری ": "اور جب ان کے پاس سے گزرتے تو حقارت سے اشارے کرتے",
     "  طاہر القادری": "اور جب ان کے پاس سے گزرتے تو آپس میں آنکھوں سے اشارہ بازی کرتے تھے،",
      "   علامہ جوادی": "اور جب وہ ان کے پاس سے گزرتے تھے تو اشارے کنائے کرتے تھے",
      " محمد جوناگڑھی": "اور ان کے پاس سے گزرتے ہوئے آپس میں آنکھ کےاشارے کرتے تھے",
       " محمد حسین نجفی ": "جب ان کے پاس سے گزرتے تھے تو آنکھیں مارا کرتے تھے۔",
      "مفتی تقی عثمانی": "اور جب ان کے پاس سے گذرتے تھے تو ایک دوسرے کو آنکھوں ہی آنکھوں میں اشارے کرتے تھے "
     },
     {
      "Aya": "﴾‏وَإِذَا انقَلَبُوا إِلَىٰ أَهْلِهِمُ انقَلَبُوا فَكِهِينَ ﴿٣١‎‏ ",
      "ابوالاعلی مودودی ": "اپنے گھروں کی طرف پلٹتے تو مزے لیتے ہوئے پلٹتے تھے",
       "  احمد رضا خان ":  "اور جب (ف۹۳۳ اپنے گھر پلٹتے خوشیاں کرتے پلٹتے",
      "احمد علی ":"اور جب اپنے گھر والوں کے پاس لوٹ کر جاتے تو ہنستے ہوئے جاتے تھے",
      "  جالندہری ": "اور جب اپنے گھر کو لوٹتے تو اتراتے ہوئے لوٹتے",
     "  طاہر القادری": "اور جب اپنے گھر والوں کی طرف لوٹتے تو (مومنوں کی تنگ دستی اور اپنی خوش حالی کا موازنہ کر کے) اِتراتے اور دل لگی کرتے ہوئے پلٹتے تھے،",
      "   علامہ جوادی": "اور جب اپنے اہل کی طرف پلٹ کر آتے تھے تو خوش وخرم ہوتے تھے",
      " محمد جوناگڑھی": "اور جب اپنے والوں کی طرف لوٹتے تو دل لگیاں کرتے تھے",
       " محمد حسین نجفی ": "اور جب اپنے گھر والوں کی طرف لوٹتے تھے تو دل لگیاں کرتے ہوئے لوٹتے تھے۔",
      "مفتی تقی عثمانی": "اور جب اپنے گھر والوں کے پاس لوٹ کر جاتے تھے ، تو دل لگی کرتے ہوئے جاتے تھے ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا رَأَوْهُمْ قَالُوا إِنَّ هَٰؤُلَاءِ لَضَالُّونَ ﴿٣٢‎‏ ",
      "ابوالاعلی مودودی ": "اور جب انہیں دیکھتے تو کہتے تھے کہ یہ بہکے ہوئے لوگ ہیں",
       "  احمد رضا خان ":  "اور جب مسلمانوں کو دیکھتے کہتے بیشک یہ لوگ بہکے ہوئے ہیں",
      "احمد علی ":"اور جب ان کو دیکھتے تو کہتے بے شک یہی گمراہ ہیں",
      "  جالندہری ": "اور جب ان (مومنوں) کو دیکھتے تو کہتے کہ یہ تو گمراہ ہیں",
     "  طاہر القادری": "اور جب یہ (مغرور لوگ) ان (کمزور حال مومنوں) کو دیکھتے تو کہتے: یقیناً یہ لوگ راہ سے بھٹک گئے ہیں (یعنی یہ دنیا گنوا بیٹھے ہیں اور آخرت تو ہے ہی فقط افسانہ)،",
      "   علامہ جوادی": "اور جب مومنین کو دیکھتے تو کہتے تھے کہ یہ سب اصلی گمراہ ہیں",
      " محمد جوناگڑھی": "اور جب انہیں دیکھتے تو کہتے یقیناً یہ لوگ گمراه (بے راه) ہیں",
       " محمد حسین نجفی ": "اور جب ان (اہلِ ایمان) کو دیکھتے تھے تو کہتے تھے کہ یہ بھٹکے ہوئے لوگ ہیں۔",
      "مفتی تقی عثمانی": "اور جب ان ( مومنوں ) کو دیکھتے تو کہتے کہ یہ لوگ یقینا گمراہ ہیں ۔"
     },
     {
      "Aya": "﴾‏وَمَا أُرْسِلُوا عَلَيْهِمْ حَافِظِينَ ﴿٣٣‎",
      "ابوالاعلی مودودی ": "حالانکہ وہ اُن پر نگراں بنا کر نہیں بھیجے گئے تھے",
       "  احمد رضا خان ":  "اور یہ کچھ ان پر نگہبان بناکر نہ بھیجے گئے",
      "احمد علی ":"حالانکہ وہ ان پر نگہبان بنا کر نہیں بھیجے گئے تھے",
      "  جالندہری ": "حالانکہ وہ ان پر نگراں بنا کر نہیں بھیجے گئے تھے",
     "  طاہر القادری": "حالانکہ وہ ان (کے حال) پر نگہبان بنا کر نہیں بھیجے گئے تھے،",
      "   علامہ جوادی": "حالانکہ انہیں ان کا نگراں بنا کر نہیں بھیجا گیا تھا",
      " محمد جوناگڑھی": "یہ ان پر پاسبان بنا کر تو نہیں بھیجے گئے",
       " محمد حسین نجفی ": "حالانکہ وہ انکے نگران بنا کر نہیں بھیجے گئے تھے۔",
      "مفتی تقی عثمانی": "حالانکہ ان کو ان مسلمانوں پر نگراں بنا کر نہیں بھیجا گیا تھا ۔"
     },
     {
      "Aya": "﴾‏فَالْيَوْمَ الَّذِينَ آمَنُوا مِنَ الْكُفَّارِ يَضْحَكُونَ ﴿٣٤‎‏",
      "ابوالاعلی مودودی ": "آج ایمان لانے والے کفار پر ہنس رہے ہیں",
       "  احمد رضا خان ":  "تو آج ایمان والے کافروں سے ہنستے ہیں",
      "احمد علی ":"حالانکہ وہ ان پر نگہبان بنا کر نہیں بھیجے گئے تھے",
      "  جالندہری ": "تو آج مومن کافروں سے ہنسی کریں گے",
     "  طاہر القادری": "پس آج (دیکھو) اہلِ ایمان کافروں پر ہنس رہے ہیں،",
      "   علامہ جوادی": "تو آج ایمان لانے والے بھی کفاّر کا مضحکہ اُڑائیں گے",
      " محمد جوناگڑھی": "پس آج ایمان والے ان کافروں پر ہنسیں گے",
       " محمد حسین نجفی ": "پس آج اہلِ ایمان کافروں (اور منکروں) پر ہنستے ہوں گے۔",
      "مفتی تقی عثمانی": "آخر ہوگا یہ کہ آج ایمان لانے والے کافروں پر ہنس رہے ہوں گے"
     },
     {
      "Aya": "﴾‏عَلَى الْأَرَائِكِ يَنظُرُونَ ﴿٣٥‎",
      "ابوالاعلی مودودی ": "مسندوں پر بیٹھے ہوئے ان کا حال دیکھ رہے ہیں",
       "  احمد رضا خان ":  "تختوں پر بیٹھے دیکھتے ہیں",
      "احمد علی ":"تختوں پر بیٹھے دیکھ رہے ہوں گے",
      "  جالندہری ": "اور تختوں پر (بیٹھے ہوئے ان کا حال) دیکھ رہے ہوں گے",
     "  طاہر القادری": "سجے ہوئے تختوں پر بیٹھے (اپنی خوش حالی اور کافروں کی بدحالی کا) نظارہ کر رہے ہیں،",
      "   علامہ جوادی": "تختوں پر بیٹھے ہوئے دیکھ رہے ہوں گے",
      " محمد جوناگڑھی": "تختوں پر بیٹھے دیکھ رہے ہوں گے",
       " محمد حسین نجفی ": "اونچی مسندوں پر بیٹھے ہوئے (ان کی حالت) دیکھ رہے ہونگے۔",
      "مفتی تقی عثمانی": "آرام دہ نشستوں پر بیٹھے ہوئے دیکھ رہے ہوں گے ۔"
     },
     {
      "Aya": "﴾‏هَلْ ثُوِّبَ الْكُفَّارُ مَا كَانُوا يَفْعَلُونَ ﴿٣٦‎‏",
      "ابوالاعلی مودودی ": "مل گیا نا کافروں کو اُن حرکتوں کا ثواب جو وہ کیا کرتے تھے",
       "  احمد رضا خان ":  "کیوں کچھ بدلا ملا کافروں کو اپنے کیے کا",
      "احمد علی ":"آیا کافروں کو بدلہ دیا گیا ہے ان اعمال کا جو وہ کیا کرتے تھے",
      "  جالندہری ": "تو کافروں کو ان کے عملوں کا (پورا پورا) بدلہ مل گیا",
     "  طاہر القادری": "سو کیا کافروں کو اس (مذاق) کا پورا بدلہ دے دیا گیا جو وہ (مسلمانوں سے) کیا کرتے تھے،",
      "   علامہ جوادی": "اب تو کفار کو ان کے اعمال کا پورا پورا بدلہ مل رہا ہے",
      " محمد جوناگڑھی": "کہ اب ان منکروں نے جیسا یہ کرتے تھے پورا پورا بدلہ پالیا",
       " محمد حسین نجفی ": "کیا کافروں کو ان کے کئے ہوئے (کرتوتوں) کا پورا بدلہ مل گیا ہے۔",
      "مفتی تقی عثمانی": "کہ کافر لوگوں کو واقعی ان کاموں کا بدلہ مل گیا جو وہ کیا کرتے تھے ۔"
     }
    ]
    