[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی":  "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏إِذَا الشَّمْسُ كُوِّرَتْ ﴿١‎‏",
      "ابوالاعلی مودودی ":  "جب سورج لپیٹ دیا جائے گا",
       "  احمد رضا خان ": "جب دھوپ لپیٹی جائے",
      "احمد علی ": "جب سورج کی روشنی لپیٹی جائے",
     "  جالندہری ": "جب سورج لپیٹ لیا جائے گا",
       "  طاہر القادری": "جب سورج لپیٹ کر بے نور کر دیا جائے گا،",
     "   علامہ جوادی": "جب چادر آفتاب کو لپیٹ دیا جائے گا",
     " محمد جوناگڑھی": "جب سورج لپیٹ لیا جائے گا",
      " محمد حسین نجفی ": "جب سورج (کی بساط) لپیٹ دی جائے گی۔",
      "مفتی تقی عثمانی":  "جب سورج لپیٹ دیا جائے گا ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا النُّجُومُ انكَدَرَتْ ﴿٢   ‏",
      "ابوالاعلی مودودی ":  "اور جب تارے بکھر جائیں گے",
       "  احمد رضا خان ": "اور جب تارے جھڑ پڑیں",
      "احمد علی ": "اور جب ستارے گر جائیں",
     "  جالندہری ": "جب تارے بےنور ہو جائیں گے",
       "  طاہر القادری": "اور جب ستارے (اپنی کہکشاؤں سے) گر پڑیں گے،",
     "   علامہ جوادی": "جب تارے گر پڑیں گے",
     " محمد جوناگڑھی": "اور جب ستارے بے نور ہو جائیں گی",
      " محمد حسین نجفی ": "اور ستارے (بکھر کر) بےنور ہو جائیں گے",
      "مفتی تقی عثمانی":  "اور جب ستارے ٹوٹ ٹوٹ کر گریں گے ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا الْجِبَالُ سُيِّرَتْ ﴿٣‎‏ ",
      "ابوالاعلی مودودی ":  "اور جب پہاڑ چلائے جائیں گے",
       "  احمد رضا خان ": "اور جب پہاڑ چلائے جائیں",
      "احمد علی ": "اور جب پہاڑ چلائے جائیں",
     "  جالندہری ": "اور جب پہاڑ چلائے جائیں گے",
       "  طاہر القادری": "اور جب پہاڑ (غبار بنا کر فضا میں) چلا دیئے جائیں گے،",
     "   علامہ جوادی": "جب پہاڑ حرکت میں آجائیں گے",
     " محمد جوناگڑھی": "اور جب پہاڑ چلائے جائیں گے",
      " محمد حسین نجفی ": "اور جب پہاڑ چلا دئیے جائیں گے۔",
      "مفتی تقی عثمانی":  "اور جب پہاڑوں کو چلایا جائے گا ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا الْعِشَارُ عُطِّلَتْ ﴿٤‎",
      "ابوالاعلی مودودی ":  "اور جب دس مہینے کی حاملہ اونٹنیاں اپنے حال پر چھوڑ دی جائیں گی",
       "  احمد رضا خان ": "اور جب تھلکی (گابھن) اونٹنیاں چھوٹی پھریں",
      "احمد علی ": "اور جب دس مہینے کی گابھن اونٹنیاں چھوڑ دی جائیں",
     "  جالندہری ": "اور جب بیانے والی اونٹنیاں بےکار ہو جائیں گی",
       "  طاہر القادری": "اور جب حاملہ اونٹنیاں بے کار چھوٹی پھریں گی (کوئی ان کا خبر گیر نہ ہوگا)،",
     "   علامہ جوادی": "جب عنقریب جننے والی اونٹنیاں معطل کردی جائیں گی",
     " محمد جوناگڑھی": "اور جب دس ماه کی حاملہ اونٹنیاں چھوڑ دی جائیں",
      " محمد حسین نجفی ": "اور جب حاملہ اونٹیاں آوارہ پھریں گی",
      "مفتی تقی عثمانی":  "اور جب دس مہینے کی گابھن اونٹنیوں کو بھی بیکار چھوڑ دیا جائے گا "
     },
     {
      "Aya": " ﴾‏وَإِذَا الْوُحُوشُ حُشِرَتْ ﴿٥   ‎‏ ",
      "ابوالاعلی مودودی ":  "اور جب جنگلی جانور سمیٹ کر اکٹھے کر دیے جائیں گے",
       "  احمد رضا خان ": "اور جب وحشی جانور جمع کیے جائیں",
      "احمد علی ": "اور جب جنگلی جانور اکھٹے ہوجائیں",
     "  جالندہری ": "اور جب وحشی جانور جمع اکٹھے ہو جائیں گے",
       "  طاہر القادری": "اور جب وحشی جانور (خوف کے مارے) جمع کر دیئے جائیں گے،",
     "   علامہ جوادی": "جب جانوروں کو اکٹھا کیا جائے گا",
     " محمد جوناگڑھی": "اور جب وحشی جانور اکھٹے کیے جائیں گے",
      " محمد حسین نجفی ": "اور جب وحشی جانور اکٹھے کر دئیے جائیں گے۔",
      "مفتی تقی عثمانی":  "اور جب وحشی جانور اکٹھے کردیے جائیں گے ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا الْبِحَارُ سُجِّرَتْ ﴿٦‎",
      "ابوالاعلی مودودی ":  "اور جب سمندر بھڑکا دیے جائیں گے",
       "  احمد رضا خان ": "اور جب سمندر سلگائے جائیں",
      "احمد علی ": "اور جب سمندر جوش دیئے جائیں",
     "  جالندہری ": "اور جب دریا آگ ہو جائیں گے",
       "  طاہر القادری": "جب سمندر اور دریا (سب) ابھار دیئے جائیں گے",
     "   علامہ جوادی": "جب دریا بھڑک اٹھیں گے",
     " محمد جوناگڑھی": "اور جب سمندر بھڑکائے جائیں گے",
      " محمد حسین نجفی ": "اور جب سمندر بھڑکا دئیے جائیں گے۔",
      "مفتی تقی عثمانی":  "اور جب سمندروں کو بھڑکایا جائے گا ۔"
     },
     {
      "Aya": "﴾‏وَإِذَا النُّفُوسُ زُوِّجَتْ ﴿٧‎‏ ",
      "ابوالاعلی مودودی ":  "اور جب جانیں (جسموں سے) جوڑ دی جائیں گی",
       "  احمد رضا خان ": "اور جب جانوں کے جوڑ بنیں",
      "احمد علی ": "اور جب جانیں جسموں سے ملائی جائیں",
     "  جالندہری ": "اور جب روحیں (بدنوں سے) ملا دی جائیں گی",
       "  طاہر القادری": "اور جب روحیں (بدنوں سے) ملا دی جائیں گی،",
     "   علامہ جوادی": "جب روحوں کو جسموں سے جوڑ دیا جائے گا",
     " محمد جوناگڑھی": "اور جب جانیں (جسموں سے) ملا دی جائیں گی",
      " محمد حسین نجفی ": "اور جب جانیں (جِسموں سے) ملا دی جائیں گی۔",
      "مفتی تقی عثمانی":  "اور جب لوگوں کے جوڑے جوڑے بنا دئیے جائیں گے"
     },
     {
      "Aya": "﴾‏وَإِذَا الْمَوْءُودَةُ سُئِلَتْ ﴿٨‎‏ ",
      "ابوالاعلی مودودی ":  "اور جب زندہ گاڑی ہوئی لڑکی سے پوچھا جائے گا",
       "  احمد رضا خان ": "اور جب زندہ دبائی ہوئی سے پوچھا جائے",
      "احمد علی ": "اور جب زندہ درگور لڑکی سے پوچھا جائے",
     "  جالندہری ": "اور جب لڑکی سے جو زندہ دفنا دی گئی ہو پوچھا جائے گا",
       "  طاہر القادری": "اور جب زندہ دفن کی ہوئی لڑکی سے پوچھا جائے گا،",
     "   علامہ جوادی": "اور جب زندہ درگور لڑکیوں کے بارے میں سوال کیا جائے گا",
     " محمد جوناگڑھی": "اور جب زنده گاڑی ہوئی لڑکی سے سوال کیا جائے گا",
      " محمد حسین نجفی ": "اور جب زندہ درگور کی ہوئی (لڑکی) سے پوچھا جائے گا۔",
      "مفتی تقی عثمانی":  "اور جس بچی کو زندہ قبر میں گاڑ دیا گیا تھا ، اس سے پوچھا جائے گا ۔"
     },
     {
      "Aya": " ﴾‏بِأَيِّ ذَنبٍ قُتِلَتْ ﴿٩  ‎",
      "ابوالاعلی مودودی ":  "کہ وہ کس قصور میں ماری گئی؟",
       "  احمد رضا خان ": "کس خطا پر ماری گئی",
      "احمد علی ": "کہ کس گناہ پر ماری گئی تھی",
     "  جالندہری ": "کہ وہ کس گناہ پرماری گئی",
       "  طاہر القادری": "کہ وہ کس گناہ کے باعث قتل کی گئی تھی",
     "   علامہ جوادی": "کہ انہیں کس گناہ میں مارا گیا ہے",
     " محمد جوناگڑھی": "کہ کس گناه کی وجہ سے وه قتل کی گئی؟",
      " محمد حسین نجفی ": "کہ وہ کس گناہ پر قتل کی گئی؟",
      "مفتی تقی عثمانی":  "کہ اسے کس جرم میں قتل کیا گیا؟"
     },
     {
      "Aya": "﴾‏وَإِذَا الصُّحُفُ نُشِرَتْ ﴿١٠‎",
      "ابوالاعلی مودودی ":  "اور جب اعمال نامے کھولے جائیں گے",
       "  احمد رضا خان ": "اور جب نامہٴ اعمال کھولے جائیں،",
      "احمد علی ": "اور جب اعمال نامے کھل جائیں",
     "  جالندہری ": "اور جب (عملوں کے) دفتر کھولے جائیں گے",
       "  طاہر القادری": "اور جب اَعمال نامے کھول دیئے جائیں گے",
     "   علامہ جوادی": "اور جب نامہ اعمال منتشر کردیئے جائیں گے",
     " محمد جوناگڑھی": "اور جب نامہٴ اعمال کھول دیئے جائیں گے",
      " محمد حسین نجفی ": "اور جب اعمال نامے کھولے جائیں گے۔",
      "مفتی تقی عثمانی":  "اور جب اعمال نامے کھول دئے جائیں گے ۔"
     },
     {
      "Aya": " ﴾‏وَإِذَا السَّمَاءُ كُشِطَتْ ﴿ ١١   ‎‏",
      "ابوالاعلی مودودی ":  "اور جب آسمان کا پردہ ہٹا دیا جائے گا",
       "  احمد رضا خان ": "اور جب آسمان جگہ سے کھینچ لیا جائے",
      "احمد علی ": "اور آسمان کا پوست اتارا جائے",
     "  جالندہری ": "اور جب آسمانوں کی کھال کھینچ لی جائے گی",
       "  طاہر القادری": "اور جب سماوی طبقات کو پھاڑ کر اپنی جگہوں سے ہٹا دیا جائے گا،",
     "   علامہ جوادی": "اور جب آسمان کا چھلکا اُتار دیا جائے گا",
     " محمد جوناگڑھی": "اور جب آسمان کی کھال اتار لی جائے گی",
      " محمد حسین نجفی ": "اور جب آسمان کھول دیا جائے گا۔",
      "مفتی تقی عثمانی":  "اور جب آسمان کا چھلکا اتار دیا جائے گا "
     },
     {
      "Aya": " ﴾‏وَإِذَا الْجَحِيمُ سُعِّرَتْ ﴿١٢‎",
      "ابوالاعلی مودودی ":  "اور جب جہنم دہکائی جائے گی",
       "  احمد رضا خان ": "اور جب جہنم بھڑکایا جائے",
      "احمد علی ": "اورجب دوزخ دھکائی جائے",
     "  جالندہری ": "اور جب دوزخ (کی آگ) بھڑکائی جائے گی",
       "  طاہر القادری": "اور جب دوزخ (کی آگ) بھڑکائی جائے گی،",
     "   علامہ جوادی": "اور جب جہنمّ کی آگ بھڑکا دی جائے گی",
     " محمد جوناگڑھی": "اور جب جہنم بھڑکائی جائے گی",
      " محمد حسین نجفی ": "اور جب دوزخ بھڑکا دی جائے گی۔",
      "مفتی تقی عثمانی":  "اور جب دوزخ بھڑکائی جائے گی "
     },
     {
      "Aya": " ﴾‏وَإِذَا الْجَنَّةُ أُزْلِفَتْ ﴿١٣‎‏ ",
      "ابوالاعلی مودودی ":  "اور جب جنت قریب لے آئی جائے گی",
       "  احمد رضا خان ": "اور جب جنت پاس لائی جائے",
      "احمد علی ": "اورجب جنت قریب لائی جائے",
     "  جالندہری ": "اور بہشت جب قریب لائی جائے گی",
       "  طاہر القادری": "اور جب جنت قریب کر دی جائے گی",
     "   علامہ جوادی": "اور جب جنّت قریب تر کردی جائے گی",
     " محمد جوناگڑھی": "اور جب جنت نزدیک کر دی جائے گی",
      " محمد حسین نجفی ": "اور جب جنت قریب لے آئی جائے گی۔",
      "مفتی تقی عثمانی":  "اور جب جنت قریب کردی جائے گی "
     },
     {
      "Aya": " ﴾‏عَلِمَتْ نَفْسٌ مَّا أَحْضَرَتْ ﴿١٤  ‎",
      "ابوالاعلی مودودی ":  "اُس وقت ہر شخص کو معلوم ہو جائے گا کہ وہ کیا لے کر آیا ہے",
       "  احمد رضا خان ": "ہر جان کو معلوم ہوجائے گا جو حاضر لائی",
      "احمد علی ": "تو ہر شخص جان لے گا کہ وہ کیا لے کر آیا ہے",
     "  جالندہری ": "تب ہر شخص معلوم کر لے گا کہ وہ کیا لے کر آیا ہے",
       "  طاہر القادری": "ہر شخص جان لے گا جو کچھ اس نے حاضر کیا ہے،",
     "   علامہ جوادی": "تب ہر نفس کو معلوم ہوگا کہ اس نے کیا حاضر کیا ہے",
     " محمد جوناگڑھی": "تو اس دن ہر شخص جان لے گا جو کچھ لے کر آیا ہوگا",
      " محمد حسین نجفی ": "تب ہر شخص کو معلوم ہو جائے گا کہ اس نے کیا لا کر پیش کیا ہے۔",
      "مفتی تقی عثمانی":  "تو اس وقت ہر شخص کو اپنا سارا کیا دھرا معلوم ہوجائے گا ۔"
     },
     {
      "Aya": " ﴾‏فَلَا أُقْسِمُ بِالْخُنَّسِ ﴿١٥   ‎",
      "ابوالاعلی مودودی ":  "پس نہیں، میں قسم کھاتا ہوں",
       "  احمد رضا خان ": "تو قسم ہے ان کی جو الٹے پھریں،",
      "احمد علی ": "پس میں قسم کھاتا ہوں پیچھے ہٹنے والے",
     "  جالندہری ": "ہم کو ان ستاروں کی قسم جو پیچھے ہٹ جاتے ہیں",
       "  طاہر القادری": "تو میں قَسم کھاتا ہوں ان (آسمانی کرّوں) کی جو (ظاہر ہونے کے بعد) پیچھے ہٹ جاتے ہیں،",
     "   علامہ جوادی": "تو میں ان ستاروں کی قسم کھاتا ہوں جو پلٹ جانے والے ہیں",
     " محمد جوناگڑھی": "میں قسم کھاتا ہوں پیچھے ہٹنے والے",
      " محمد حسین نجفی ": "تو نہیں! میں قَسم کھاتا ہوں پیچھے ہٹنے والے۔",
      "مفتی تقی عثمانی":  "اب میں قسم کھاتا ہوں ان ستاروں کی جو پیچھے کی طرف چلنے لگتے ہیں "
     },
     {
      "Aya": " ﴾‏الْجَوَارِ الْكُنَّسِ ﴿١٦   ‎",
      "ابوالاعلی مودودی ":  "پلٹنے اور چھپ جانے والے تاروں کی",
       "  احمد رضا خان ": "سیدھے چلیں تھم رہیں",
      "احمد علی ": "سیدھے چلنے والے غیب ہو جانے والے ستارو ں کی",
     "  جالندہری ": "جو سیر کرتے اور غائب ہو جاتے ہیں",
       "  طاہر القادری": "جو بلا روک ٹوک چلتے رہتے ہیں (پھر ظاہر ہو کر) چھپ جاتے ہیں،",
     "   علامہ جوادی": "چلنے والے اورحُھپ جانے والے ہیں",
     " محمد جوناگڑھی": "چلنے پھرنے والے چھپنے والے ستاروں کی",
      " محمد حسین نجفی ": "سیدھے چلنے اور چھپ جانے والے ستاروں کی۔",
      "مفتی تقی عثمانی":  "اب میں قسم کھاتا ہوں ان ستاروں کی جو پیچھے کی طرف چلنے لگتے ہیں "
     },
     {
      "Aya": "﴾‏وَاللَّيْلِ إِذَا عَسْعَسَ ﴿١٧   ‎‏",
      "ابوالاعلی مودودی ":  "اور رات کی جبکہ وہ رخصت ہوئی",
       "  احمد رضا خان ": "اور رات کی جب پیٹھ دے",
      "احمد علی ": "اور قسم ہے رات کی جب وہ جانے لگے",
     "  جالندہری ": "اور رات کی قسم جب ختم ہونے لگتی ہے",
       "  طاہر القادری": "اور رات کی قَسم جب اس کی تاریکی جانے لگے،",
     "   علامہ جوادی": "اور رات کی قسم جب ختم ہونے کو آئے",
     " محمد جوناگڑھی": "اور رات کی جب جانے لگے",
      " محمد حسین نجفی ": "اور قَسم کھاتا ہوں رات کی جب وہ جانے لگے۔",
      "مفتی تقی عثمانی":  "اور قسم کھاتا ہوں رات کی جب وہ رخصت ہو ۔"
     },
     {
      "Aya": "﴾‏وَالصُّبْحِ إِذَا تَنَفَّسَ ﴿١٨‎",
      "ابوالاعلی مودودی ":  "اور صبح کی جبکہ اس نے سانس لیا",
       "  احمد رضا خان ": "اور صبح کی جب دم لے",
      "احمد علی ": "اور قسم ہے صبح کی جب وہ آنے لگے",
     "  جالندہری ": "اور صبح کی قسم جب نمودار ہوتی ہے",
       "  طاہر القادری": "اور صبح کی قَسم جب اس کی روشنی آنے لگے،",
     "   علامہ جوادی": "اور صبح کی قسم جب سانس لینے لگے",
     " محمد جوناگڑھی": "اور صبح کی جب چمکنے لگے",
      " محمد حسین نجفی ": "اور صبح کی جب وہ سانس لے کر آنے لگے۔",
      "مفتی تقی عثمانی":  "اور صبح کی جب وہ سانس لے "
     },
     {
      "Aya": "﴾‏إِنَّهُ لَقَوْلُ رَسُولٍ كَرِيمٍ ﴿١٩‎‏ ",
      "ابوالاعلی مودودی ":  "یہ فی الواقع ایک بزرگ پیغام بر کا قول ہے",
       "  احمد رضا خان ": "بیشک یہ عزت والے رسول کا پڑھنا ہے،",
      "احمد علی ": "بے شک یہ قرآن ایک معزز رسول کا لایا ہوا ہے",
     "  جالندہری ": "کہ بےشک یہ (قرآن) فرشتہٴ عالی مقام کی زبان کا پیغام ہے",
       "  طاہر القادری": "بیشک یہ (قرآن) بڑی عزت و بزرگی والے رسول کا (پڑھا ہوا) کلام ہے،",
     "   علامہ جوادی": "بے شک یہ ایک معزز فرشتے کا بیان ہے",
     " محمد جوناگڑھی": "یقیناً یہ ایک بزرگ رسول کا کہا ہوا ہے",
      " محمد حسین نجفی ": "بےشک یہ (قرآن) ایک معزز پیغامبر(ص) کا قول ہے۔",
      "مفتی تقی عثمانی":  "کہ یہ ( قرآن ) یقینی طور پر ایک معزز فرشتے کا لایا ہوا کلام ہے "
     },
     {
      "Aya": " ﴾‏ذِي قُوَّةٍ عِندَ ذِي الْعَرْشِ مَكِينٍ ﴿٢٠   ‎‏",
      "ابوالاعلی مودودی ":  "جو بڑی توانائی رکھتا ہے، عرش والے کے ہاں بلند مرتبہ ہے",
       "  احمد رضا خان ": "جو قوت والا ہے مالک عرش کے حضور عزت والا وہاں اس کا حکم مانا جاتا ہے",
      "احمد علی ": "جو بڑا طاقتور ہے عرش کے مالک کے نزدیک بڑے رتبہ والا ہے",
     "  جالندہری ": "جو صاحب قوت مالک عرش کے ہاں اونچے درجے والا ہے",
       "  طاہر القادری": "جو (دعوتِ حق، تبلیغِ رسالت اور روحانی استعداد میں) قوت و ہمت والے ہیں (اور) مالکِ عرش کے حضور بڑی قدر و منزلت (اور جاہ و عظمت) والے ہیں،",
     "   علامہ جوادی": "وہ صاحبِ قوت ہے اور صاحبِ عرش کی بارگاہ کا مکین ہے",
     " محمد جوناگڑھی": "جو قوت واﻻ ہے، عرش والے (اللہ) کے نزدیک بلند مرتبہ ہے",
      " محمد حسین نجفی ": "جو قوت والا ہے اور مالکِ عرش کے نزدیک بلند مرتبہ ہے۔",
      "مفتی تقی عثمانی":  "جو قوت والا ہے ، جس کا عرش والے کے پاس بڑا رتبہ ہے ۔"
     },
     {
      "Aya": " ﴾‏مُّطَاعٍ ثَمَّ أَمِينٍ ﴿٢١      ‏",
      "ابوالاعلی مودودی ":  "وہاں اُس کا حکم مانا جاتا ہے، وہ با اعتماد ہے",
       "  احمد رضا خان ": "امانت دار ہے",
      "احمد علی ": "وہاں کا سردار امانت دار ہے",
     "  جالندہری ": "سردار (اور) امانت دار ہے",
       "  طاہر القادری": " واجب الاطاعت ہیں (کیونکہ ان کی اطاعت ہی اللہ کی اطاعت ہے)، امانت دار ہیں (وحی اور زمین و آسمان کے سب اُلوہی رازوں کے حامل ہیں)،",
     "   علامہ جوادی": "وہ وہاں قابل اطاعت اور پھر امانت دار ہے",
     " محمد جوناگڑھی": "جس کی (آسمانوں میں) اطاعت کی جاتی ہے امین ہے",
      " محمد حسین نجفی ": "اس کا حکم مانا جاتا ہے اور پھر وہ امانتدار (بھی) ہے۔",
      "مفتی تقی عثمانی":  "وہاں اس کی بات مانی جاتی ہے ۔ وہ امانت دار ہے ۔"
     },
     {
      "Aya": "﴾‏وَمَا صَاحِبُكُم بِمَجْنُونٍ ﴿٢٢‎‏",
      "ابوالاعلی مودودی ":  "اور (اے اہل مکہ) تمہارا رفیق مجنون نہیں ہے",
       "  احمد رضا خان ": "اور تمہارے صاحب مجنون نہیں",
      "احمد علی ": "اور تمہارا رفیق کوئی دیوانہ نہیں ہے",
     "  جالندہری ": "اور (مکے والو) تمہارے رفیق (یعنی محمدﷺ) دیوانے نہیں ہیں",
       "  طاہر القادری": "اور (اے لوگو!) یہ تمہیں اپنی صحبت سے نوازنے والے (محمد صلی اللہ علیہ وآلہ وسلم) دیوانے نہیں ہیں (جو فرماتے ہیں وہ حق ہوتا ہے)،",
     "   علامہ جوادی": "اور تمہارا ساتھی پیغمبر دیوانہ نہیں ہے",
     " محمد جوناگڑھی": "اور تمہارا ساتھی دیوانہ نہیں ہے",
      " محمد حسین نجفی ": "اور تمہارا ساتھی (پیغمبرِ اسلام (ص)) دیوانہ نہیں ہے۔",
      "مفتی تقی عثمانی":  "اور ( اے مکہ والو ) تمہارے ساتھ رہنے والے یہ صاحب ( یعنی حضرت محمد ( صلی اللہ علیہ وآلہ وسلم ) کوئی دیوانے نہیں ہیں ۔"
     },
     {
      "Aya": "﴾‏وَلَقَدْ رَآهُ بِالْأُفُقِ الْمُبِينِ ﴿٢٣‎‏ ",
      "ابوالاعلی مودودی ":  "اُس نے اُس پیغام بر کو روشن افق پر دیکھا ہے",
       "  احمد رضا خان ": "اور بیشک انہوں نے اسے روشن کنارہ پر دیکھا",
      "احمد علی ": "اور اس نے اس کو کُھلے کنارے پر دیکھا بھی ہے",
     "  جالندہری ": "بےشک انہوں نے اس (فرشتے) کو (آسمان کے کھلے یعنی) مشرقی کنارے پر دیکھا ہے",
       "  طاہر القادری": "اور بیشک انہوں نے اس (مالکِ عرش کے حُسنِ مطلق) کو (لامکاں کے) روشن کنارے پر دیکھا ہے٭، ٭ یہ ترجمہ حضرت عبد اللہ بن عباس، انس بن مالک، عکرمہ، ابو سلمہ، ضحّاک، ابو العالیہ، حسن، کعب الاحبار، شریک بن عبد اللہ اور شعبی و غیرھم رضی اللہ عنھم کے اَقوال پر کیا گیا ہے جنہیں بخاری، مسلم، ترمذی، ابن جریر، بغوی اور کئی ائمہ حدیث نے روایت کیا ہے اور کثیر ائمہ تفسیر نے بھی اسے اختیار کیا ہے۔",
     "   علامہ جوادی": "اور اس نے فرشتہ کو بلند اُفق پر دیکھا ہے",
     " محمد جوناگڑھی": "اس نے اس (فرشتے) کو آسمان کے کھلے کنارے پر دیکھا بھی ہے",
      " محمد حسین نجفی ": "اور اس (پیغمبر(ص)) نے اس (پیغامبر) کو روشن افق (کنارے) پر دیکھا ہے۔",
      "مفتی تقی عثمانی":  "اور یہ بالکل سچی بات ہے کہ انہوں نے اس فرشتے کو کھلے ہوئے افق پر دیکھا ہے ۔"
     },
     {
      "Aya": "﴾‏وَمَا هُوَ عَلَى الْغَيْبِ بِضَنِينٍ ﴿٢٤‎",
      "ابوالاعلی مودودی ":  "اور وہ غیب (کے اِس علم کو لوگوں تک پہنچانے) کے معاملے میں بخیل نہیں ہے",
       "  احمد رضا خان ": "اور یہ نبی غیب بتانے میں بخیل نہیں،",
      "احمد علی ": "اور وہ غیب کی باتوں پر بخیل نہیں ہے",
     "  جالندہری ": "اور وہ پوشیدہ باتوں (کے ظاہر کرنے) میں بخیل نہیں",
       "  طاہر القادری": "اور وہ (یعنی نبئ اکرم صلی اللہ علیہ وآلہ وسلم) غیب (کے بتانے) پر بالکل بخیل نہیں ہیں (مالکِ عرش نے ان کے لئے کوئی کمی نہیں چھوڑی)،",
     "   علامہ جوادی": "اور وہ غیب کے بارے میں بخیل نہیں ہے",
     " محمد جوناگڑھی": "اور یہ غیب کی باتوں کو بتلانے میں بخیل بھی نہیں",
      " محمد حسین نجفی ": "اور وہ غیب کی باتوں کے معاملہ میں بخیل نہیں ہے۔",
      "مفتی تقی عثمانی":  "اور وہ غیب کی باتوں کے بارے میں بخیل بھی نہیں ہیں "
     },
     {
      "Aya": " ﴾‏وَمَا هُوَ بِقَوْلِ شَيْطَانٍ رَّجِيمٍ ﴿٢٥   ‎",
      "ابوالاعلی مودودی ":  "اور یہ کسی شیطان مردود کا قول نہیں ہے",
       "  احمد رضا خان ": "اور قرآن، مردود شیطان کا پڑھا ہوا نہیں،",
      "احمد علی ": "اور وہ کسی شیطان مردود کا قول نہیں ہے",
     "  جالندہری ": "اور یہ شیطان مردود کا کلام نہیں",
       "  طاہر القادری": "اور وہ (قرآن) ہرگز کسی شیطان مردود کا کلام نہیں ہے،",
     "   علامہ جوادی": "اور یہ قرآن کسی شیطان رجیم کا قول نہیں ہے",
     " محمد جوناگڑھی": "اور یہ قرآن شیطان مردود کا کلام نہیں",
      " محمد حسین نجفی ": "اور وہ (قرآن) کسی مردود شیطان کا قول نہیں ہے۔",
      "مفتی تقی عثمانی":  "اور نہ یہ ( قرآن ) کسی مردود شیطان کی ( بنائی ہوئی ) کوئی بات ہے ۔"
     },
     {
      "Aya": "﴾‏فَأَيْنَ تَذْهَبُونَ ﴿٢٦‎‏",
      "ابوالاعلی مودودی ":  "پھر تم لوگ کدھر چلے جا رہے ہو؟",
       "  احمد رضا خان ": "پھر کدھر جاتے ہو",
      "احمد علی ": "پس تم کہاں چلے جا رہے ہو",
     "  جالندہری ": "پھر تم کدھر جا رہے ہو",
       "  طاہر القادری": "پھر (اے بدبختو!) تم (اتنے بڑے خزانے کو چھوڑ کر) کدھر چلے جا رہے ہو،",
     "   علامہ جوادی": "تو تم کدھر چلے جارہے ہو",
     " محمد جوناگڑھی": "پھر تم کہاں جا رہے ہو",
      " محمد حسین نجفی ": "تم کدھر جا رہے ہو؟",
      "مفتی تقی عثمانی":  "پھر بھی تم لوگ کدھر چلے جارہے ہو؟"
     },
     {
      "Aya": "﴾‏إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ ﴿٢٧‎",
      "ابوالاعلی مودودی ":  "یہ تو سارے جہان والوں کے لیے ایک نصیحت ہے",
       "  احمد رضا خان ": "وہ تو نصیحت ہی ہے سارے جہان کے لیے",
      "احمد علی ": "یہ تو جہان بھرکے لیے نصیحت ہی نصیحت ہے",
     "  جالندہری ": "یہ تو جہان کے لوگوں کے لیے نصیحت ہے",
       "  طاہر القادری": "یہ (قرآن) تو تمام جہانوں کے لئے (صحیفۂ) نصیحت ہے،",
     "   علامہ جوادی": "یہ صرف عالمین کے لئے ایک نصیحت کا سامان ہے",
     " محمد جوناگڑھی": "یہ تو تمام جہان والوں کے لئے نصیحت نامہ ہے",
      " محمد حسین نجفی ": "وہ نہیں ہے مگر تمام دنیا جہان کے لئے نصیحت۔",
      "مفتی تقی عثمانی":  "یہ تو دنیا جہان کے لوگوں کے لیے ایک نصیحت ہے ۔"
     },
     {
      "Aya": "﴾‏لِمَن شَاءَ مِنكُمْ أَن يَسْتَقِيمَ ﴿٢٨‎‏ ",
      "ابوالاعلی مودودی ":  "تم میں سے ہر اُس شخص کے لیے جو راہ راست پر چلنا چاہتا ہو",
       "  احمد رضا خان ": "اس کے لیے جو تم میں سیدھا ہونا چاہے",
      "احمد علی ": "اس کے لیے جو تم میں سے سیدھا چلنا چاہے",
     "  جالندہری ": "اس کے لیے جو تم میں سے سیدھی چال چلنا چاہے",
       "  طاہر القادری": "تم میں سے ہر اس شخص کے لئے (اس چشمہ سے ہدایت میسر آسکتی ہے) جو سیدھی راہ چلنا چاہے،",
     "   علامہ جوادی": "جو تم میں سے سیدھا ہونا چاہے",
     " محمد جوناگڑھی": " اس کے لئے جو تم میں سے سیدھی راه پر چلنا چاہے",
      " محمد حسین نجفی ": "یعنی اس کیلئے جو تم میں سے سیدھی راہ پر چلنا چاہے۔",
      "مفتی تقی عثمانی":  "تم میں سے ہر اس شخص کے لیے جو سیدھا سیدھا رہنا چاہے ۔"
     },
     {
      "Aya": "﴾‏وَمَا تَشَاءُونَ إِلَّا أَن يَشَاءَ اللَّهُ رَبُّ الْعَالَمِينَ ﴿٢٩‎‏",
      "ابوالاعلی مودودی ":  "اور تمہارے چاہنے سے کچھ نہیں ہوتا جب تک اللہ رب العالمین نہ چاہے",
       "  احمد رضا خان ": "اور تم کیا چا ہو مگر یہ کہ چاہے اللہ سارے جہان کا رب،",
      "احمد علی ": "اور تم توجب ہی چاہو گے کہ جب الله چاہے گا جو تمام جہان کا رب ہے",
     "  جالندہری ": "اور تم کچھ بھی نہیں چاہ سکتے مگر وہی جو خدائے رب العالمین چاہے",
       "  طاہر القادری": "اور تم وہی کچھ چاہ سکتے ہو جو اللہ چاہے جو تمام جہانوں کا رب ہے،",
     "   علامہ جوادی": "اور تم لوگ کچھ نہیں چاہ سکتے مگریہ کہ عالمین کا پروردگار خدا چاہے",
     " محمد جوناگڑھی": "اور تم بغیر پروردگار عالم کے چاہے کچھ نہیں چاه سکتے",
      " محمد حسین نجفی ": "اور تم نہیں چاہتے مگر وہی جو عالمین کا پرورگار چاہتا ہے۔",
      "مفتی تقی عثمانی":  "اور تم چاہو گے نہیں ، الا یہ کہ خود اللہ چاہے جو سارے جہانوں کا پروردگار ہے ۔"
     }
    ]