[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":"عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾‏إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ ﴿١‎‏",
     "ابوالاعلی مودودی ":  "ہم نے اِس (قرآن) کو شب قدر میں نازل کیا ہے",
      "  احمد رضا خان ": "بیشک ہم نے اسے شبِ قدر میں اتارا",
     "احمد علی ": "بے شک ہم نے اس (قرآن) کو شب قدر میں اتارا ہے",
      "  جالندہری ": "ہم نے اس (قرآن) کو شب قدر میں نازل (کرنا شروع) کیا",
      "  طاہر القادری": "بیشک ہم نے اس (قرآن) کو شبِ قدر میں اتارا ہے،",
      "   علامہ جوادی":"بے شک ہم نے اسے شب قدر میں نازل کیا ہے",
     " محمد جوناگڑھی": "یقیناً ہم نے اسے شب قدر میں نازل فرمایا",
     " محمد حسین نجفی ": "بےشک ہم نے اس (قرآن) کوشبِ قدر میں نازل کیا۔",
      "مفتی تقی عثمانی": "بیشک ہم نے اس ( قرآن ) کو شب قدر میں نازل کیا ہے "
     },
     {
      "Aya": " ﴾وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ ﴿٢‎",
     "ابوالاعلی مودودی ":  "اور تم کیا جانو کہ شب قدر کیا ہے؟",
      "  احمد رضا خان ": "اور تم نے کیا جانا کیا شبِ قدر،",
     "احمد علی ": "اور آپ کو کیا معلوم کہ شب قدر کیا ہے",
      "  جالندہری ": "اور تمہیں کیا معلوم کہ شب قدر کیا ہے؟",
      "  طاہر القادری": "اور آپ کیا سمجھے ہیں (کہ) شبِ قدر کیا ہے،",
      "   علامہ جوادی":"اور آپ کیا جانیں یہ شب قدر کیا چیز ہے",
     " محمد جوناگڑھی": "تو کیا سمجھا کہ شب قدر کیا ہے؟",
     " محمد حسین نجفی ": "اور آپ کو کیا معلوم کہ شب قدر کیا ہے؟",
      "مفتی تقی عثمانی": "اور تمہیں کیا معلوم کہ شب قدر کیا چیز ہے؟"
     },
     {
      "Aya": " ﴾‏ لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ ﴿٣  ‎‏ ",
     "ابوالاعلی مودودی ":  "شب قدر ہزار مہینوں سے زیادہ بہتر ہے",
      "  احمد رضا خان ": "شبِ قدر ہزار مہینوں سے بہتر",
     "احمد علی ": "شب قدر ہزار مہینوں سے بہتر ہے",
      "  جالندہری ": "شب قدر ہزار مہینے سے بہتر ہے",
      "  طاہر القادری": "شبِ قدر (فضیلت و برکت اور اَجر و ثواب میں) ہزار مہینوں سے بہتر ہے،",
      "   علامہ جوادی":"شب قدر ہزار مہینوں سے بہتر ہے",
     " محمد جوناگڑھی": "شب قدر ایک ہزار مہینوں سے بہتر ہے",
     " محمد حسین نجفی ": "شبِ قدر ہزار مہینوں سے بہتر ہے۔",
      "مفتی تقی عثمانی": "شب قدر ایک ہزار مہینوں سے بھی بہتر ہے ۔"
     },
     { 
      "Aya": " ﴾‏تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ ﴿٤  ‎‏",
     "ابوالاعلی مودودی ":  "فرشتے اور روح اُس میں اپنے رب کے اذن سے ہر حکم لے کر اترتے ہیں",
      "  احمد رضا خان ": "اس میں فرشتے اور جبریل اترتے ہیں اپنے رب کے حکم سے ہر کام کے لیے",
     "احمد علی ": "اس میں فرشتے اور روح نازل ہوتے ہیں اپنے رب کے حکم سے ہر کام پر",
      "  جالندہری ": "اس میں روح (الامین) اور فرشتے ہر کام کے (انتظام کے) لیے اپنے پروردگار کے حکم سے اترتے ہیں",
      "  طاہر القادری": "اس (رات) میں فرشتے اور روح الامین (جبرائیل) اپنے رب کے حکم سے (خیر و برکت کے) ہر امر کے ساتھ اترتے ہیں،",
      "   علامہ جوادی":"اس میں ملائکہ اور روح القدس اسُن خدا کے ساتھ تمام امور کو لے کر نازل ہوتے ہیں",
     " محمد جوناگڑھی": "اس (میں ہر کام) کے سر انجام دینے کو اپنے رب کے حکم سے فرشتے اور روح (جبرائیل) اترتے ہیں",
     " محمد حسین نجفی ": "اس میں فرشتے اور روح اپنے پروردگار کی اجازت سے (سال بھر کی) ہر بات کا حکم لے کر اترتے ہیں۔",
      "مفتی تقی عثمانی": "اس میں فرشتے اور روح اپنے پروردگار کی اجازت سے ہر کام کے لیے اترتے ہیں"
     },
     {
      "Aya": " ﴾‏سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ ﴿٥‎‏",
     "ابوالاعلی مودودی ":  "وہ رات سراسر سلامتی ہے طلوع فجر تک",
      "  احمد رضا خان ": "وہ سلامتی ہے، صبح چمکتے تک",
     "احمد علی ": "وہ صبح روشن ہونے تک سلامتی کی رات ہے",
      "  جالندہری ": "یہ (رات) طلوع صبح تک (امان اور) سلامتی ہے",
      "  طاہر القادری": "یہ (رات) طلوعِ فجر تک (سراسر) سلامتی ہے،",
      "   علامہ جوادی":"یہ رات طلوع فجر تک سلامتی ہی سلامتی ہے",
     " محمد جوناگڑھی": "یہ رات سراسر سلامتی کی ہوتی ہے اور فجر کے طلوع ہونے تک (رہتی ہے)",
     " محمد حسین نجفی ": "وہ (رات) سراسر سلامتی ہے طلوعِ صبح تک۔",
      "مفتی تقی عثمانی": "وہ رات سراپا سلامتی ہے فجر کے طلوع ہونے تک ۔"
     }
    ]
