[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
     "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  جالندہری ":  "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  طاہر القادری":"اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
       " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
    " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
       "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾وَالْعَصْرِ ﴿١‎",
     "ابوالاعلی مودودی ": "زمانے کی قسم",
     "  احمد رضا خان ":  "اس زمانہ محبوب کی قسم",
       "احمد علی ": "زمانہ کی قسم ہے",
       "  جالندہری ": "عصر کی قسم",
       "  طاہر القادری":"زمانہ کی قَسم (جس کی گردش انسانی حالات پر گواہ ہے)۔ (یا- نمازِ عصر کی قَسم (کہ وہ سب نمازوں کا وسط ہے)۔ (یا- وقتِ عصر کی قَسم (جب دن بھر چمکنے والا سورج خود ڈوبنے کا منظر پیش کرتا ہے)۔ (یا- زمانۂ بعثتِ مصطفیٰ (صلی اللہ علیہ وآلہ وسلم) کی قَسم (جو سارے زمانوں کا ماحصل اور مقصود ہے)،",
      "   علامہ جوادی": "قسم ہے عصر کی",
       " محمد جوناگڑھی": "زمانے کی قسم",
    " محمد حسین نجفی ": "قَسم ہے زمانے کی۔",
       "مفتی تقی عثمانی": "زمانے کی قسم"
     },
     {
      "Aya": " ﴾إِنَّ الْإِنسَانَ لَفِي خُسْرٍ ﴿٢‎",
     "ابوالاعلی مودودی ": "انسان درحقیقت بڑے خسارے میں ہے",
     "  احمد رضا خان ":  "بیشک آدمی ضرور نقصان میں ہے",
       "احمد علی ": "بے شک انسان گھاٹے میں ہے",
       "  جالندہری ":"کہ انسان نقصان میں ہے",
       "  طاہر القادری":"بیشک انسان خسارے میں ہے (کہ وہ عمرِ عزیز گنوا رہا ہے)،",
      "   علامہ جوادی": "بے شک انسان خسارہ میں ہے",
       " محمد جوناگڑھی": "بیشک (بالیقین) انسان سرتا سر نقصان میں ہے",
    " محمد حسین نجفی ": "یقیناً (ہر) انسان گھاٹے میں ہے۔",
       "مفتی تقی عثمانی": "انسان درحقیقت بڑے گھاٹے میں ہے ۔"
     },
     {
      "Aya": " ﴾‏إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ ﴿٣‎‏",
     "ابوالاعلی مودودی ": "سوائے اُن لوگوں کے جو ایمان لائے، اور نیک اعمال کرتے رہے، اور ایک دوسرے کو حق کی نصیحت اور صبر کی تلقین کرتے رہے",
     "  احمد رضا خان ":  "مگر جو ایمان لائے اور اچھے کام کیے اور ایک دورے کو حق کی تاکید کی اور ایک دوسرے کو صبر کی وصیت کی",
       "احمد علی ": "مگر جو لوگ ایمان لائے اور نیک کام کیے اور حق پر قائم رہنے کی اور صبر کرنے کی آپس میں وصیت کرتے رہے",
       "  جالندہری ": "مگر وہ لوگ جو ایمان لائے اور نیک عمل کرتے رہے اور آپس میں حق (بات) کی تلقین اور صبر کی تاکید کرتے رہے",
       "  طاہر القادری":"سوائے ان لوگوں کے جو ایمان لے آئے اور نیک عمل کرتے رہے اور (معاشرے میں) ایک دوسرے کو حق کی تلقین کرتے رہے اور (تبلیغِ حق کے نتیجے میں پیش آمدہ مصائب و آلام میں) باہم صبر کی تاکید کرتے رہے،",
      "   علامہ جوادی": "علاوہ ان لوگوں کے جو ایمان لائے اور انہوں نے نیک اعمال کئے اور ایک دوسرے کو حق اور صبر کی وصیت و نصیحت کی",
       " محمد جوناگڑھی": "سوائے ان لوگوں کے جو ایمان ﻻئے اور نیک عمل کیے اور (جنہوں نے) آپس میں حق کی وصیت کی اور ایک دوسرے کو صبر کی نصیحت کی",
    " محمد حسین نجفی ": "سوائے ان لوگوں کے جو ایمان لائے اور نیک عمل کئے اور ایک دوسرے کو حق کی وصیت کی اورصبر کی نصیحت کی۔",
       "مفتی تقی عثمانی": "سوا‎ئے ‌ان ‌لوگوں ‌كے ‌جو ‌ایمان ‌لائیں ، ‌اور ‌نیك ‌عمل ‌كریں ، ‌اور ‌ایك ‌دوسرے ‌كو ‌حق ‌بات ‌كی ‌نصیحت ‌كریں ، ‌اور ‌ایك ‌دوسرے ‌كو ‌صبر ‌كی ‌نصیحت ‌كریں ۔"
     }
    ]
    