[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ":  "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ":  "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":  "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾‏وَاللَّيْلِ إِذَا يَغْشَىٰ ﴿١   ‎‏",
      "ابوالاعلی مودودی ":  "قسم ہے رات کی جبکہ وہ چھا جائے",
      "  احمد رضا خان ": "اور رات کی قسم جب چھائے",
      "احمد علی ": "رات کی قسم ہے جب کہ وہ چھاجائے",
      "  جالندہری ":  "رات کی قسم جب (دن کو) چھپالے",
      "  طاہر القادری": "رات کی قَسم جب وہ چھا جائے (اور ہر چیز کو اپنی تاریکی میں چھپا لے)،",
      "   علامہ جوادی":  "رات کی قسم جب وہ دن کو ڈھانپ لے",
      " محمد جوناگڑھی": "قسم ہے اس رات کی جب چھا جائے",
      " محمد حسین نجفی ": "قَسم ہے رات کی جب کہ وہ (دن کو) ڈھانپ لے۔",
      "مفتی تقی عثمانی": "قسم ہے رات کی جب وہ چھا جائے ۔"
     },
     {
      "Aya": "﴾‏وَالنَّهَارِ إِذَا تَجَلَّىٰ ﴿٢‎‏ ",
      "ابوالاعلی مودودی ":  "اور دن کی جبکہ وہ روشن ہو",
      "  احمد رضا خان ": "اور دن کی جب چمکے",
      "احمد علی ": "اور دن کی جبکہ وہ روشن ہو",
      "  جالندہری ":  "اور دن کی قسم جب چمک اٹھے",
      "  طاہر القادری": "اور دن کی قَسم جب وہ چمک اٹھے،",
      "   علامہ جوادی":  "اور دن کی قسم جب وہ چمک جائے",
      " محمد جوناگڑھی": "اور قسم ہے دن کی جب روشن ہو",
      " محمد حسین نجفی ": "اور قَسم ہے دن کی جب کہ وہ روشن ہو جائے۔",
      "مفتی تقی عثمانی": "اور دن کی جب اس کا اجالا پھیل جائے ۔"
     },
     {
      "Aya": "﴾‏وَمَا خَلَقَ الذَّكَرَ وَالْأُنثَىٰ ﴿٣‎‏ ",
      "ابوالاعلی مودودی ":  "اور اُس ذات کی جس نے نر اور مادہ کو پیدا کیا",
      "  احمد رضا خان ": "اور اس کی جس نے نر و مادہ بنائے",
      "احمد علی ": "اوراس کی قسم کہ جس نے نر و مادہ کوبنایا",
      "  جالندہری ":  "اور اس (ذات) کی قسم جس نے نر اور مادہ پیدا کیے",
      "  طاہر القادری": "اور اس ذات کی (قَسم) جس نے (ہر چیز میں) نر اور مادہ کو پیدا فرمایا،",
      "   علامہ جوادی":  "اور اس کی قسم جس نے مرد اور عورت کو پیدا کیا ہے",
      " محمد جوناگڑھی": "اور قسم ہے اس ذات کی جس نے نر وماده کو پیدا کیا",
      " محمد حسین نجفی ": "اور اس ذات کی قَسم جس نے نر اور مادہ کو پیدا کیا۔",
      "مفتی تقی عثمانی": "اور اس ذات کی جس نے نر اور مادہ کو پیدا کیا "
     },
     {
      "Aya": "  ﴾‏إِنَّ سَعْيَكُمْ لَشَتَّىٰ ﴿٤   ‎‏",
      "ابوالاعلی مودودی ":  "درحقیقت تم لوگوں کی کوششیں مختلف قسم کی ہیں",
      "  احمد رضا خان ": "بیشک تمہاری کوشش مختلف ہے",
      "احمد علی ": "بے شک تمہاری کوشش مختلف ہے",
      "  جالندہری ":  "کہ تم لوگوں کی کوششں طرح طرح کی ہے",
      "  طاہر القادری": "بیشک تمہاری کوشش مختلف (اور جداگانہ) ہے،",
      "   علامہ جوادی":  "بے شک تمہاری کوششیں مختلف قسم کی ہیں",
      " محمد جوناگڑھی": "یقیناً تمہاری کوشش مختلف قسم کی ہے",
      " محمد حسین نجفی ": "یقیناً تمہاری کوششیں مختلف قِسم کی ہیں۔",
      "مفتی تقی عثمانی": "کہ حقیقت میں تم لوگوں کی کوششیں الگ الگ قسم کی ہیں "
     },
     {
      "Aya": "﴾‏فَأَمَّا مَنْ أَعْطَىٰ وَاتَّقَىٰ ﴿٥‎",
      "ابوالاعلی مودودی ":  "تو جس نے (راہ خدا میں) مال دیا اور (خدا کی نافرمانی سے) پرہیز کیا",
      "  احمد رضا خان ": "تو وہ جس نے دیا اور پرہیزگاری کی",
      "احمد علی ": "پھر جس نے دیا اور پرہیز گاری کی",
      "  جالندہری ":  "تو جس نے (خدا کے رستے میں مال) دیا اور پرہیز گاری کی",
      "  طاہر القادری": "پس جس نے (اپنا مال اﷲ کی راہ میں) دیا اور پرہیزگاری اختیار کی،",
      "   علامہ جوادی":  "پھر جس نے مال عطا کیا اور تقویٰ اختیار کیا",
      " محمد جوناگڑھی": "جس نے دیا (اللہ کی راه میں) اور ڈرا (اپنے رب سے)",
      " محمد حسین نجفی ": "تو جس نے (راہِ خدا میں) مال دیا اور پرہیزگاری اختیار کی",
      "مفتی تقی عثمانی": "کہ حقیقت میں تم لوگوں کی کوششیں الگ الگ قسم کی ہیں "
     },
     {
      "Aya": "﴾‏وَصَدَّقَ بِالْحُسْنَىٰ ﴿٦‎",
      "ابوالاعلی مودودی ":  "اور بھلائی کو سچ مانا",
      "  احمد رضا خان ": "اور سب سے اچھی کو سچ مانا",
      "احمد علی ": "اورنیک بات کی تصدیق کی",
      "  جالندہری ":  "اور نیک بات کو سچ جانا",
      "  طاہر القادری": "اور اس نے (اِنفاق و تقوٰی کے ذریعے) اچھائی (یعنی دینِ حق اور آخرت) کی تصدیق کی،",
      "   علامہ جوادی":  "اور نیکی کی تصدیق کی",
      " محمد جوناگڑھی": "اور نیک بات کی تصدیق کرتا رہے گا",
      " محمد حسین نجفی ": "اور اچھی بات (اسلام) کی تصدیق کی۔",
      "مفتی تقی عثمانی": "اب جس کسی نے ( اللہ کے راستے میں مال ) دیا ، اور تقوی اختیار کیا ۔"
     },
     {
      "Aya": "﴾‏فَسَنُيَسِّرُهُ لِلْيُسْرَىٰ ﴿٧‎‏",
      "ابوالاعلی مودودی ":  "اس کو ہم آسان راستے کے لیے سہولت دیں گے",
      "  احمد رضا خان ": "تو بہت جلد ہم اسے آسانی مہیا کردیں گے",
      "احمد علی ": "تو ہم اس کے لیے جنت کی راہیں آسان کر دیں گے",
      "  جالندہری ":  "اس کو ہم آسان طریقے کی توفیق دیں گے",
      "  طاہر القادری": "تو ہم عنقریب اسے آسانی (یعنی رضائے الٰہی) کے لئے سہولت فراہم کر دیں گے،",
      "   علامہ جوادی":  "تو اس کے لئے ہم آسانی کا انتظام کردیں گے",
      " محمد جوناگڑھی": "تو ہم بھی اس کو آسان راستے کی سہولت دیں گے",
      " محمد حسین نجفی ": "تو ہم اسے آسان راستہ کیلئے سہو لت دیں گے۔",
      "مفتی تقی عثمانی": "اور سب سے اچھی بات کو دل سے مانا "
     },
     {
      "Aya": "﴾‏وَأَمَّا مَن بَخِلَ وَاسْتَغْنَىٰ ﴿٨ ‎‎ ‎",
      "ابوالاعلی مودودی ":  "اور جس نے بخل کیا اور (اپنے خدا سے) بے نیازی برتی",
      "  احمد رضا خان ": "اور وہ جس نے بخل کیا اور بے پرواہ بنا",
      "احمد علی ": "اورلیکن جس نے بخل کیا اوربے پرواہ رہا",
      "  جالندہری ":  "اور جس نے بخل کیا اور بےپروا بنا رہا",
      "  طاہر القادری": "اور جس نے بخل کیا اور (راہِ حق میں مال خرچ کرنے سے) بے پروا رہا،",
      "   علامہ جوادی":  "اور جس نے بخل کیا اور لاپروائی برتی",
      " محمد جوناگڑھی": "لیکن جس نے بخیلی کی اور بے پرواہی برتی",
      " محمد حسین نجفی ": "اور جس نے بُخل کیا اور (خدا سے) بےپرواہی کی۔",
      "مفتی تقی عثمانی": "تو ہم اس کو آرام کی منزل تک پہنچنے کی تیاری کرا دیں گے "
     },
     {
      "Aya": "﴾‏وَكَذَّبَ بِالْحُسْنَىٰ ﴿٩‎‏",
      "ابوالاعلی مودودی ":  "اور بھلائی کو جھٹلایا",
      "  احمد رضا خان ": "اور سب سے اچھی کو جھٹلایا",
      "احمد علی ": "اور نیک بات کو جھٹلایا",
      "  جالندہری ":  "اور نیک بات کو جھوٹ سمجھا",
      "  طاہر القادری": "اور اس نے (یوں) اچھائی (یعنی دینِ حق اور آخرت) کو جھٹلایا،",
      "   علامہ جوادی":  "اور نیکی کو جھٹلایا ہے",
      " محمد جوناگڑھی": "اور نیک بات کی تکذیب کی",
      " محمد حسین نجفی ": "اور اچھی بات کو جھٹلایا۔",
      "مفتی تقی عثمانی": "رہا وہ شخص جس نے بخل سے کام لیا ، اور ( اللہ سے ) بے نیازی اختیاری کی "
     },
     {
      "Aya": "  ﴾‏فَسَنُيَسِّرُهُ لِلْعُسْرَىٰ﴿١٠   ‏",
      "ابوالاعلی مودودی ":  "اس کو ہم سخت راستے کے لیے سہولت دیں گے",
      "  احمد رضا خان ": "تو بہت جلد ہم اسے دشواری مہیا کردیں گے",
      "احمد علی ": "تو ہم اس کے لیے جہنم کی راہیں آسان کر دیں گے",
      "  جالندہری ":  "اسے سختی میں پہنچائیں گے",
      "  طاہر القادری": "تو ہم عنقریب اسے سختی (یعنی عذاب کی طرف بڑھنے) کے لئے سہولت فراہم کر دیں گے (تاکہ وہ تیزی سے مستحقِ عذاب ٹھہرے)،",
      "   علامہ جوادی":  "اس کے لئے سختی کی راہ ہموار کردیں گے",
      " محمد جوناگڑھی": "تو ہم بھی اس کی تنگی ومشکل کے سامان میسر کر دیں گے",
      " محمد حسین نجفی ": "تو ہم اسے سخت راستے کی سہولت دیں گے۔",
      "مفتی تقی عثمانی": "اور سب سے اچھی بات کو جھٹلایا ۔"
     },
     {
      "Aya": " ﴾‏وَمَا يُغْنِي عَنْهُ مَالُهُ إِذَا تَرَدَّىٰ ﴿١١    ‎",
      "ابوالاعلی مودودی ":  "اور اُس کا مال آخر اُس کے کس کام آئے گا جبکہ وہ ہلاک ہو جائے؟",
      "  احمد رضا خان ": "اور اس کا مال اسے کام نہ آئے گا جب ہلاکت میں پڑے گا",
      "احمد علی ": "اوراس کا مال اس کے کچھ بھی کام نہ آئے گا جب کہ وہ گھڑے میں گرے گا",
      "  جالندہری ":  "اور جب وہ (دوزخ کے گڑھے میں) گرے گا تو اس کا مال اس کے کچھ کام نہ آئے گا",
      "  طاہر القادری": "اور اس کا مال اس کے کسی کام نہیں آئے گا جب وہ ہلاکت (کے گڑھے) میں گرے گا،",
      "   علامہ جوادی":  "اور اس کا مال کچھ کام نہ آئے گا جب وہ ہلاک ہوجائے گا",
      " محمد جوناگڑھی": "اس کا مال اسے (اوندھا) گرنے کے وقت کچھ کام نہ آئے گا",
      " محمد حسین نجفی ": "اور اس کا مال اسے کوئی فائدہ نہ دے گا جب وہ (ہلاکت کے) گڑھے میں گرے گا۔",
      "مفتی تقی عثمانی": "تو ہم اس کو تکلیف کی منزل تک پہنچنے کی تیاری کرا دیں گے "
     },
     {
      "Aya": " ﴾‏إِنَّ عَلَيْنَا لَلْهُدَىٰ ﴿١٢   ‎‏",
      "ابوالاعلی مودودی ":  "بے شک راستہ بتانا ہمارے ذمہ ہے",
      "  احمد رضا خان ": "بیشک ہدایت فرمانا ہمارے ذمہ ہے،",
      "احمد علی ": "بے شک ہمارے ذمے راہ دکھانا ہے",
      "  جالندہری ":  "ہمیں تو راہ دکھا دینا ہے",
      "  طاہر القادری": "بیشک راہِ (حق) دکھانا ہمارے ذمہ ہے،",
      "   علامہ جوادی":  "بے شک ہدایت کی ذمہ داری ہمارے اوپر ہے",
      " محمد جوناگڑھی": "بیشک راه دکھا دینا ہمارے ذمہ ہے",
      " محمد حسین نجفی ": "بےشک راہ دکھانا ہمارے ذمہ ہے۔",
      "مفتی تقی عثمانی": "اور جب ایسا شخص تباہی کے گڑھے میں گرے گا تو اس کا مال اس کے کچھ کام نہیں آئے گا "
     },
     {
      "Aya": "﴾‏وَإِنَّ لَنَا لَلْآخِرَةَ وَالْأُولَىٰ ﴿١٣‎‏",
      "ابوالاعلی مودودی ":  "اور درحقیقت آخرت اور دنیا، دونوں کے ہم ہی مالک ہیں",
      "  احمد رضا خان ": "اور بیشک آخرت اور دنیا دونوں کے ہمیں مالک ہیں،",
      "احمد علی ": "اور بے شک ہمارے ہی ہاتھ میں آخرت بھی اور دنیا بھی ہے",
      "  جالندہری ":  "اور آخرت او ردنیا ہماری ہی چیزیں ہیں",
      "  طاہر القادری": "اور بیشک ہم ہی آخرت اور دنیا کے مالک ہیں،",
      "   علامہ جوادی":  "اور دنیا و آخرت کا اختیار ہمارے ہاتھوں میں ہے",
      " محمد جوناگڑھی": "اور ہمارے ہی ہاتھ آخرت اور دنیا ہے",
      " محمد حسین نجفی ": "اور بےشک آخرت اور دنیا ہمارے ہی قبضہ میں ہیں۔",
      "مفتی تقی عثمانی": "یہ سچ ہے کہ راستہ بتلا دینا ہمارے ذمے ہے ۔"
     },
     {
      "Aya": " ﴾‏فَأَنذَرْتُكُمْ نَارًا تَلَظَّىٰ ﴿١٤   ‎‏",
      "ابوالاعلی مودودی ":  "پس میں نے تم کو خبردار کر دیا ہے بھڑکتی ہوئی آگ سے",
      "  احمد رضا خان ": "تو میں تمہیں ڈراتا ہوں اس آگ سے جو بھڑک رہی ہے،",
      "احمد علی ": "پس میں نے تمہیں بڑھکتی ہوئی آگ سے ڈرایا ہے",
      "  جالندہری ":  "سو میں نے تم کو بھڑکتی آگ سے متنبہ کر دیا",
      "  طاہر القادری": "سو میں نے تمہیں (دوزخ کی) آگ سے ڈرا دیا ہے جو بھڑک رہی ہے،",
      "   علامہ جوادی":  "تو ہم نے تمہیں بھڑکتی ہوئی آگ سے ڈرایا",
      " محمد جوناگڑھی": "میں نے تو تمہیں شعلے مارتی ہوئی آگ سے ڈرا دیا ہے",
      " محمد حسین نجفی ": "سو میں نے تمہیں بھڑکتی ہوئی آگ سے ڈرایا ہے۔",
      "مفتی تقی عثمانی": "اور یہ بھی سچ ہے کہ آخرت اور دنیا دونوں ہمارے قبضے میں ہیں ۔ "
     },
     {
      "Aya": "﴾‏لَا يَصْلَاهَا إِلَّا الْأَشْقَى ﴿١٥‎",
      "ابوالاعلی مودودی ":  "اُس میں نہیں جھلسے گا مگر وہ انتہائی بد بخت",
      "  احمد رضا خان ": "نہ جائے گا اس میں مگر بڑا بدبخت،",
      "احمد علی ": "جس میں صرف وہی بد بخت داخل ہوگا",
      "  جالندہری ":  "اس میں وہی داخل ہو گا جو بڑا بدبخت ہے",
      "  طاہر القادری": "جس میں انتہائی بدبخت کے سوا کوئی داخل نہیں ہوگا،",
      "   علامہ جوادی":  "جس میں کوئی نہ جائے گا سوائے بدبخت شخص کے",
      " محمد جوناگڑھی": "جس میں صرف وہی بدبخت داخل ہوگا",
      " محمد حسین نجفی ": "اس میں وہ داخل ہوگا(اور جلے گا) جو بڑا بدبخت ہوگا۔",
      "مفتی تقی عثمانی": "لہذا میں نے تمہیں ایک بھڑکتی ہوئی آگ سے خبردار کردیا ہے ۔"
     },
     {
      "Aya": " ﴾‏الَّذِي كَذَّبَ وَتَوَلَّىٰ ﴿١٦",
      "ابوالاعلی مودودی ":  "جس نے جھٹلایا اور منہ پھیرا",
      "  احمد رضا خان ": "جس نے جھٹلایا اور منہ پھیرا",
      "احمد علی ": "جس نے جھٹلایا اورمنہ موڑا",
      "  جالندہری ":  "جس نے جھٹلایا اور منہ پھیرا",
      "  طاہر القادری": "جس نے (دینِ حق کو) جھٹلایا اور (رسول کی اطاعت سے) منہ پھیر لیا،",
      "   علامہ جوادی":  "جس نے جھٹلایا اور منھ پھیرلیا",
      " محمد جوناگڑھی": "جس نے جھٹلایا اور (اس کی پیروی سے) منھ پھیر لیا",
      " محمد حسین نجفی ": "جس نے جھٹلایا اور رُوگردانی کی۔",
      "مفتی تقی عثمانی": "اس آگ میں کوئی اور نہیں ، وہی بدبخت داخل ہوگا ۔"
     },
     {
      "Aya": " ﴾‏وَسَيُجَنَّبُهَا الْأَتْقَى ﴿١٧‎‏ ",
      "ابوالاعلی مودودی ":  "اور اُس سے دور رکھا جائیگا وہ نہایت پرہیزگار",
      "  احمد رضا خان ": "اور بہت اس سے دور رکھا جائے گا جو سب سے زیادہ پرہیزگار،",
      "احمد علی ": "اوراس آگ سے وہ بڑا پرہیز گار دور رہے گا",
      "  جالندہری ":  "اور جو بڑا پرہیزگار ہے وہ (اس سے) بچا لیا جائے گا",
      "  طاہر القادری": "اور اس (آگ) سے اس بڑے پرہیزگار شخص کو بچا لیا جائے گا،",
      "   علامہ جوادی":  "اور اس سے عنقریب صاحبِ تقویٰ کو محفوظ رکھا جائے گا",
      " محمد جوناگڑھی": "اور اس سے ایسا شخص دور رکھا جائے گا جو بڑا پرہیزگار ہو گا",
      " محمد حسین نجفی ": "اور جو بڑا پرہیزگار ہوگا وہ اس سے دور رکھا جائے گا۔",
      "مفتی تقی عثمانی": "جس نے حق کو جھٹلایا ، اور منہ موڑا ۔"
     },
     {
      "Aya": " ﴾‏الَّذِي يُؤْتِي مَالَهُ يَتَزَكَّىٰ ﴿ ١٨ ‎‏",
      "ابوالاعلی مودودی ":  "جو پاکیزہ ہونے کی خاطر اپنا مال دیتا ہے",
      "  احمد رضا خان ": "جو اپنا مال دیتا ہے کہ ستھرا ہو",
      "احمد علی ": "جو اپنا مال دیتا ہے تاکہ وہ پاک ہو جائے",
      "  جالندہری ":  "جو مال دیتا ہے تاکہ پاک ہو",
      "  طاہر القادری": "جو اپنا مال (اﷲ کی راہ میں) دیتا ہے کہ (اپنے جان و مال کی) پاکیزگی حاصل کرے،",
      "   علامہ جوادی":  "جو اپنے مال کو دے کر پاکیزگی کا اہتمام کرتا ہے",
      " محمد جوناگڑھی": "جو پاکی حاصل کرنے کے لئے اپنا مال دیتا ہے",
      " محمد حسین نجفی ": "جو پاکیزگی حاصل کرنے کیلئے اپنا مال دیتا ہے۔",
      "مفتی تقی عثمانی": "اور اس سے ایسے پرہیزگار شخص کو دور رکھا جائے گا ۔"
     },
     {
      "Aya": "  ﴾‏وَمَا لِأَحَدٍ عِندَهُ مِن نِّعْمَةٍ تُجْزَىٰ ﴿١٩   ‎",
      "ابوالاعلی مودودی ":  "اُس پر کسی کا کوئی احسان نہیں ہے جس کا بدلہ اُسے دینا ہو",
      "  احمد رضا خان ": "اور کسی کا اس پر کچھ احسان نہیں جس کا بدلہ دیا جائے",
      "احمد علی ": "اور اس پر کسی کا کوئی احسان نہیں کہ جس کا بدلہ دیا جائے",
      "  جالندہری ":  "اور (اس لیے) نہیں (دیتا کہ) اس پر کسی کا احسان (ہے) جس کا وہ بدلہ اتارتا ہے",
      "  طاہر القادری": "اور کسی کا اس پر کوئی احسان نہیں کہ جس کا بدلہ دیا جا رہا ہو،",
      "   علامہ جوادی":  "جب کہ اس کے پاس کسی کا کوئی احسان نہیں ہے جس کی جزا دی جائے",
      " محمد جوناگڑھی": "کسی کا اس پر کوئی احسان نہیں کہ جس کا بدلہ دیا جا رہا ہو",
      " محمد حسین نجفی ": "اور اس پر کسی کا کوئی احسان نہیں ہے جس کا بدلہ دیا جائے۔",
      "مفتی تقی عثمانی": "جو اپنا مال پاکیزگی حاصل کرنے کے لیے ( اللہ کے راستے میں ) دیتا ہے ۔"
     },
     {
      "Aya": "﴾‏لَّا ابْتِغَاءَ وَجْهِ رَبِّهِ الْأَعْلَىٰ ﴿٢٠‏",
      "ابوالاعلی مودودی ":  "وہ تو صرف اپنے رب برتر کی رضا جوئی کے لیے یہ کام کرتا ہے",
      "  احمد رضا خان ": "صرف اپنے رب کی رضا چاہتا ہے جو سب سے بلند ہے،",
      "احمد علی ": "وہ تو صرف اپنے سب سے برتر رب کی رضا مندی کے لیے دیتا ہے",
      "  جالندہری ":  "بلکہ اپنے خداوند اعلیٰ کی رضامندی حاصل کرنے کے لیے دیتا ہے",
      "  طاہر القادری": "مگر (وہ) صرف اپنے ربِ عظیم کی رضا جوئی کے لئے (مال خرچ کر رہا ہے)،",
      "   علامہ جوادی":  "سوائے یہ کہ وہ خدائے بزرگ کی مرضی کا طلبگار ہے",
      " محمد جوناگڑھی": "بلکہ صرف اپنے پروردگار بزرگ وبلند کی رضا چاہنے کے لئے",
      " محمد حسین نجفی ": "بلکہ وہ تو صرف اپنے بالا و برتر پروردگار کی خوشنودی چاہتا ہے۔",
      "مفتی تقی عثمانی": "حالانکہ اس پر کسی کا کوئی احسان نہیں تھا جس کا بدلہ دیا جاتا ۔"
     },
     {
      "Aya": "﴾‏وَلَسَوْفَ يَرْضَىٰ ﴿٢١‎‏",
      "ابوالاعلی مودودی ":  "اور ضرور وہ (اُس سے) خوش ہوگا",
      "  احمد رضا خان ": "اور بیشک قریب ہے کہ وہ راضی ہوگا",
      "احمد علی ": "اوروہ عنقریب خوش ہو جائے گا",
      "  جالندہری ":  "اور وہ عنقریب خوش ہو جائے گا",
      "  طاہر القادری": "اور عنقریب وہ (اﷲ کی عطا سے اور اﷲ اس کی وفا سے) راضی ہو جائے گا،",
      "   علامہ جوادی":  "اور عنقریب وہ راضی ہوجائے گا",
      " محمد جوناگڑھی": "یقیناً وه (اللہ بھی) عنقریب رضامند ہو جائے گا",
      " محمد حسین نجفی ": "اور عنقریب وہ اس سے ضرور خوش ہوجائے گا۔",
      "مفتی تقی عثمانی": "البتہ وہ صرف اپنے اس پروردگار کی خوشنودی چاہتا ہے جس کی شان سب سے اونچی ہے "
     }
    ]
    