[
    {
     "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
    "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
    "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
     " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
    },
    {
     "Aya": "﴾أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ﴿١",
     "ابوالاعلی مودودی ": "تم نے دیکھا اُس شخص کو جو آخرت کی جزا و سزا کو جھٹلاتا ہے؟",
      "  احمد رضا خان ": "بھلا دیکھو تو جو دین کو جھٹلاتا ہے",
    "احمد علی ": "کیا آپ نے اس کو دیکھا جو روزِ جرا کو جھٹلاتا ہے",
     "  جالندہری ": "بھلا تم نے اس شخص کو دیکھا جو (روزِ) جزا کو جھٹلاتا ہے؟",
     "  طاہر القادری": "کیا آپ نے اس شخص کو دیکھا جو دین کو جھٹلاتا ہے،",
    "   علامہ جوادی": "کیا تم نے اس شخص کو دیکھا ہے جوقیامت کو جھٹلاتا ہے",
     " محمد جوناگڑھی": "کیا تو نے (اسے بھی) دیکھا جو (روز) جزا کو جھٹلاتا ہے؟",
     " محمد حسین نجفی ": "کیا آپ نے اس شخص کو دیکھا ہے جو جزا و سزا (کے دن) کو جھٹلاتا ہے۔",
     "مفتی تقی عثمانی": "کیا تم نے اسے دیکھا جو جزا و سزا کو جھٹلاتا ہے؟"
    },
    {
     "Aya": "﴾فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ ﴿٢",
     "ابوالاعلی مودودی ": "وہی تو ہے جو یتیم کو دھکے دیتا ہے",
      "  احمد رضا خان ": "پھر وہ وہ ہے جو یتیم کو دھکے دیتا ہے",
    "احمد علی ": "پس وہ وہی ہے جو یتیم کو دھکے دیتا ہے",
     "  جالندہری ": "یہ وہی (بدبخت) ہے، جو یتیم کو دھکے دیتا ہے",
     "  طاہر القادری": "تو یہ وہ شخص ہے جو یتیم کو دھکے دیتا ہے (یعنی یتیموں کی حاجات کو ردّ کرتا اور انہیں حق سے محروم رکھتا ہے)،",
    "   علامہ جوادی": "یہ وہی ہے جو یتیم کو دھکےّ دیتا ہے",
     " محمد جوناگڑھی": "یہی وه ہے جو یتیم کو دھکے دیتا ہے",
     " محمد حسین نجفی ": "پس یہی وہ ہے جو یتیم کو دھکے دیتا ہے۔",
     "مفتی تقی عثمانی": "وہی تو ہے جو یتیم کو دھکے دیتا ہے "
    },
    {
     "Aya": "﴾وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ ﴿٣",
     "ابوالاعلی مودودی ": "اور مسکین کو کھانا دینے پر نہیں اکساتا",
      "  احمد رضا خان ": "اور مسکین کو کھانا دینے کی رغبت نہیں دیتا",
    "احمد علی ": "اور مسکین کو کھانا کھلانے کی ترغیب نہیں دیتا",
     "  جالندہری ": "اور فقیر کو کھانا کھلانے کے لیے (لوگوں کو) ترغیب نہیں دیتا",
     "  طاہر القادری": "اور محتاج کو کھانا کھلانے کی ترغیب نہیں دیتا (یعنی معاشرے سے غریبوں اور محتاجوں کے معاشی اِستحصال کے خاتمے کی کوشش نہیں کرتا)،",
    "   علامہ جوادی": "اور کسی کو مسکین کے کھانے کے لئے تیار نہیں کرتا ہے",
     " محمد جوناگڑھی": "اور مسکین کو کھلانے کی ترغیب نہیں دیتا",
     " محمد حسین نجفی ": "اور کسی مسکین کو کھانا کھلانے پر (لوگوں) کو آمادہ نہیں کرتا۔",
     "مفتی تقی عثمانی": "اور مسکین کو کھانا دینے کی ترغیب نہیں دیتا "
    },
    {
     "Aya": "﴾ فَوَيْلٌ لِّلْمُصَلِّينَ ﴿٤",
     "ابوالاعلی مودودی ": "پھر تباہی ہے اُن نماز پڑھنے والوں کے لیے",
      "  احمد رضا خان ": "تو ان نمازیوں کی خرابی ہے،",
    "احمد علی ": "پس ان نمازیوں کے لیے ہلاکت ہے",
     "  جالندہری ": "تو ایسے نمازیوں کی خرابی ہے",
     "  طاہر القادری": "پس افسوس (اور خرابی) ہے ان نمازیوں کے لئے،",
    "   علامہ جوادی": "تو تباہی ہے ان نمازیوں کے لئے",
     " محمد جوناگڑھی": "ان نمازیوں کے لئے افسوس (اور ویل نامی جہنم کی جگہ) ہے",
     " محمد حسین نجفی ": "تباہی ہے ان نمازیوں کیلئے۔",
     "مفتی تقی عثمانی": "پھر بڑی خرابی ہے ان نماز پڑھنے والوں کی"
    },
    {
     "Aya": "﴾الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ ﴿٥",
     "ابوالاعلی مودودی ": "جو اپنی نماز سے غفلت برتتے ہیں",
      "  احمد رضا خان ": "جو اپنی نماز سے بھولے بیٹھے ہیں",
    "احمد علی ": "جو اپنی نماز سے غافل ہیں",
     "  جالندہری ": "جو نماز کی طرف سے غافل رہتے ہیں",
     "  طاہر القادری": "جو اپنی نماز (کی روح) سے بے خبر ہیں (یعنی انہیں محض حقوق اﷲ یاد ہیں حقوق العباد بھلا بیٹھے ہیں)،",
    "   علامہ جوادی": "جو اپنی نمازوں سے غافل رہتے ہیں",
     " محمد جوناگڑھی": "جو اپنی نماز سے غافل ہیں",
     " محمد حسین نجفی ": "جو اپنی نماز (کی ادائیگی) میں غفلت برتتے ہیں۔",
     "مفتی تقی عثمانی": "جو اپنی نماز سے غفلت برتتے ہیں"
    },
    {
     "Aya": "﴾‏الَّذِينَ هُمْ يُرَاءُونَ ﴿٦",
     "ابوالاعلی مودودی ": "جو ریا کاری کرتے ہیں",
      "  احمد رضا خان ": "وہ جو دکھاوا کرتے ہیں",
    "احمد علی ": "جو دکھلاوا کرتے ہیں",
     "  جالندہری ": "جو ریا کاری کرتے ہیں",
     "  طاہر القادری": "وہ لوگ (عبادت میں) دکھلاوا کرتے ہیں (کیونکہ وہ خالق کی رسمی بندگی بجا لاتے ہیں اور پسی ہوئی مخلوق سے بے پرواہی برت رہے ہیں)،",
    "   علامہ جوادی": "دکھانے کے لئے عمل کرتے ہیں",
     " محمد جوناگڑھی": "جو ریاکاری کرتے ہیں",
     " محمد حسین نجفی ": "جو ریاکاری کرتے ہیں۔",
     "مفتی تقی عثمانی": "جو دکھاوا کرتے ہیں "
    },
    {
     "Aya": "﴾‏وَيَمْنَعُونَ الْمَاعُونَ ﴿٧",
     "ابوالاعلی مودودی ": "اور معمولی ضرورت کی چیزیں (لوگوں کو) دینے سے گریز کرتے ہیں",
      "  احمد رضا خان ": "اور بر تنے کی چیز مانگے نہیں دیتے",
    "احمد علی ": "اور برتنے کی چیز تک روکتے ہیں",
     "  جالندہری ": "اور برتنے کی چیزیں عاریتہً نہیں دیتے",
     "  طاہر القادری": "اور وہ برتنے کی معمولی سی چیز بھی مانگے نہیں دیتے،",
    "   علامہ جوادی": "اور معمولی ظروف بھی عاریت پر دینے سے انکار کردتے ہیں",
     " محمد جوناگڑھی": "اور برتنے کی چیز روکتے ہیں",
     " محمد حسین نجفی ": "اور معمولی روزمرہ ضرورت کی چیزیں بھی (لوگوں کو) نہیں دیتے۔",
     "مفتی تقی عثمانی": "اور دوسروں کو معمولی چیز دینے سے بھی انکار کرتے ہیں "
    }
   ]
   