[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ":"شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏وَالنَّازِعَاتِ غَرْقًا ﴿١‎‏",
      "ابوالاعلی مودودی ": "قسم ہے اُن (فرشتوں کی) جو ڈوب کر کھینچتے ہیں",
      "  احمد رضا خان ": "قسم ان کی کہ سختی سے جان کھینچیں",
      "احمد علی ":"جورڑوں میں گھس کر نکالنے والوں کی قسم ہے",
      "  جالندہری ": "ان (فرشتوں) کی قسم جو ڈوب کر کھینچ لیتے ہیں",
      "  طاہر القادری":"ان (فرشتوں) کی قَسم جو (کافروں کی جان ان کے جسموں کے ایک ایک انگ میں سے) نہایت سختی سے کھینچ لاتے ہیں۔ (یا:- توانائی کی ان لہروں کی قَسم جو مادہ کے اندر گھس کر کیمیائی جوڑوں کو سختی سے توڑ پھوڑ دیتی ہیں)،",
      "   علامہ جوادی": "قسم ہے ان کی جو ڈوب کر کھینچ لینے والے ہیں",
      " محمد جوناگڑھی": "ڈوب کر سختی سے کھینچنے والوں کی قسم!",
      " محمد حسین نجفی ": "قَسم ہے ان (فرشتوں) کی جو (جسم میں ڈوب کر) سختی سے (جان) کھینچتے ہیں۔",
      "مفتی تقی عثمانی": "قسم ہے ان ( فرشتوں ) کی جو ( کافروں کی روح ) سختی سے کھینچتے ہیں ۔ "
     },
     {
      "Aya": "﴾‏وَالنَّاشِطَاتِ نَشْطًا ﴿٢‎",
      "ابوالاعلی مودودی ": "اور آہستگی سے نکال لے جاتے ہیں",
      "  احمد رضا خان ": "اور نرمی سے بند کھولیں)",
      "احمد علی ":"اور بند کھولنے والوں کی",
      "  جالندہری ": "اور ان کی جو آسانی سے کھول دیتے ہیں",
      "  طاہر القادری":"اور ان (فرشتوں) کی قَسم جو (مومنوں کی جان کے) بند نہایت نرمی سے کھول دیتے ہیں۔ (یا:- توانائی کی ان لہروں کی قَسم جو مادہ کے اندر سے کیمیائی جوڑوں کو نہایت نرمی اور آرام سے توڑ دیتی ہیں)،",
      "   علامہ جوادی": "اور آسانی سے کھول دینے والے ہیں",
      " محمد جوناگڑھی": "بند کھول کر چھڑا دینے والوں کی قسم!",
      " محمد حسین نجفی ": "اور قَسم ہے آہستگی اور آسانی سے (جان) نکالنے والوں کی۔",
      "مفتی تقی عثمانی": "اور جو ( مومنوں کی روح کی ) گرہ نرمی سے کھول دیتے ہیں ۔"
     },
     {
      "Aya": " ﴾‏وَالسَّابِحَاتِ سَبْحًا ﴿٣   ‎‏",
      "ابوالاعلی مودودی ": "اور (اُن فرشتوں کی جو کائنات میں) تیزی سے تیرتے پھرتے ہیں",
      "  احمد رضا خان ": "اور آسانی سے پیریں",
      "احمد علی ":"اورتیزی سے تیرنے والوں کی",
      "  جالندہری ": "اور ان کی جو تیرتے پھرتے ہیں",
      "  طاہر القادری":"اور ان (فرشتوں) کی قَسم جو (زمین و آسمان کے درمیان) تیزی سے تیرتے پھرتے ہیں۔ (یا:- توانائی کی ان لہروں کی قَسم جو آسمانی خلا و فضا میں بلا روک ٹوک چلتی پھرتی ہیں)،",
      "   علامہ جوادی": "اور فضا میں پیرنے والے ہیں",
      " محمد جوناگڑھی": "اور تیرنے پھرنے والوں کی قسم!",
      " محمد حسین نجفی ": "اور قَسم ہے (فضاؤں کے اندر) تیر نے پھرنے والوں کی۔",
      "مفتی تقی عثمانی": "پھر ( فضا میں ) تیرے ہوئے جاتے ہیں ۔"
     },
     {
      "Aya": "﴾‏فَالسَّابِقَاتِ سَبْقًا ﴿٤‎",
      "ابوالاعلی مودودی ": "پھر (حکم بجا لانے میں) سبقت کرتے ہیں",
      "  احمد رضا خان ": "پھر آگے بڑھ کر جلد پہنچیں",
      "احمد علی ":"پھر دوڑ کر آگے بڑھ جانے والوں کی",
      "  جالندہری ": "پھر لپک کر آگے بڑھتے ہیں",
      "  طاہر القادری":"پھر ان (فرشتوں) کی قَسم جو لپک کر (دوسروں سے) آگے بڑھ جاتے ہیں۔ (یا:- پھر توانائی کی ان لہروں کی قَسم جو رفتار، طاقت اور جاذبیت کے لحاظ سے دوسری لہروں پر سبقت لے جاتی ہیں)،",
      "   علامہ جوادی": "پھر تیز رفتاری سے سبقت کرنے والے ہیں",
      " محمد جوناگڑھی": "پھر دوڑ کر آگے بڑھنے والوں کی قسم!",
      " محمد حسین نجفی ": "پھر قَسم ہے (تعمیلِ حکم میں) ایک دوسرے پر سبقت لے جانے والوں کی۔",
      "مفتی تقی عثمانی": "پھر تیزی سے لپکتے ہیں ۔"
     },
     {
      "Aya": "﴾‏فَالْمُدَبِّرَاتِ أَمْرًا ﴿٥‎‏",
      "ابوالاعلی مودودی ": "پھر (احکام الٰہی کے مطابق) معاملات کا انتظام چلاتے ہیں",
      "  احمد رضا خان ": "پھر کام کی تدبیر کریں",
      "احمد علی ":"پھر ہر امر کی تدبیر کرنے والوں کی",
      "  جالندہری ": "پھر (دنیا کے) کاموں کا انتظام کرتے ہیں",
      "  طاہر القادری":"پھر ان (فرشتوں) کی قَسم جو مختلف اُمور کی تدبیر کرتے ہیں۔ (یا:- پھر توانائی کی ان لہروں کی قَسم جو باہمی تعامل سے کائناتی نظام کی بقا کے لئے توازن و تدبیر قائم رکھتی ہیں)،",
      "   علامہ جوادی": "پھر امور کا انتظام کرنے والے ہیں",
      " محمد جوناگڑھی": "پھر کام کی تدبیر کرنے والوں کی قسم!",
      " محمد حسین نجفی ": "پھر قَسم ہے ہر امر کا بندوبست کرنے والوں کی (کہ قیامت برحق ہے)۔",
      "مفتی تقی عثمانی": "پھر جو حکم ملتا ہے اس ( کو پورا کرنے ) کا انتظام کرتے ہیں ۔"
     },
     {
      "Aya": "﴾‏يَوْمَ تَرْجُفُ الرَّاجِفَةُ ﴿٦‎‏ ",
      "ابوالاعلی مودودی ": "جس روز ہلا مارے گا زلزلے کا جھٹکا",
      "  احمد رضا خان ": "کہ کافروں پر ضرور عذاب ہوگا جس دن تھر تھرائے گی تھرتھرانے والی",
      "احمد علی ":"جس دن کانپنے والی کانپے گی",
      "  جالندہری ": "کہ وہ دن آ کر رہے گا جس دن زمین کو بھونچال آئے گا",
      "  طاہر القادری":"جب انہیں اس نظامِ کائنات کے درہم برہم کردینے کا حکم ہوگا تو اس دن (کائنات کی) ہر متحرک چیز شدید حرکت میں آجائے گی،",
      "   علامہ جوادی": "جس دن زمین کو جھٹکا دیا جائے گا",
      " محمد جوناگڑھی": "جس دن کانپنے والی کانپے گی",
      " محمد حسین نجفی ": "جس دن تھرتھرانے والی (زمین وغیرہ) تھرتھرائے گی۔",
      "مفتی تقی عثمانی": "کہ جس دن بھونچال ( ہر چیز کو ) ہلا ڈالے گا"
     },
     {
      "Aya": "﴾‏تَتْبَعُهَا الرَّادِفَةُ ﴿٧‎",
      "ابوالاعلی مودودی ": "اور اس کے پیچھے ایک اور جھٹکا پڑے گا",
      "  احمد رضا خان ": "اس کے پیچھے آئے گی پیچھے آنے والی",
      "احمد علی ":"اس کے پیچھے آنے والی پیچھے آئے گی",
      "  جالندہری ": "پھر اس کے پیچھے اور (بھونچال) آئے گا",
      "  طاہر القادری":"پیچھے آنے والا ایک اور زلزلہ اس کے پیچھے آئے گا،",
      "   علامہ جوادی": "اور اس کے بعد دوسرا جھٹکا لگے گا",
      " محمد جوناگڑھی": "اس کے بعد ایک پیچھے آنے والی (پیچھے پیچھے) آئے گی",
      " محمد حسین نجفی ": "اس کے پیچھے ایک اور آنے والی (مصیبت) آئے گی۔",
      "مفتی تقی عثمانی": "پھر اس کے بعد ایک اور جھٹکا آئے گا "
     },
     {
      "Aya": "﴾‏قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ ﴿٨‎‏",
      "ابوالاعلی مودودی ": "کچھ دل ہوں گے جو اُس روز خوف سے کانپ رہے ہوں گے",
      "  احمد رضا خان ": "کتنے دل اس دن دھڑکتے ہوں گے،",
      "احمد علی ":"کئی دل اس دن دھڑک رہے ہوں گے",
      "  جالندہری ": "اس دن (لوگوں) کے دل خائف ہو رہے ہوں گے",
      "  طاہر القادری":"اس دن (لوگوں کے) دل خوف و اضطراب سے دھڑکتے ہوں گے،",
      "   علامہ جوادی": "اس دن دل لرز جائیں گے",
      " محمد جوناگڑھی": "بہت سے) دل اس دن دھڑکتے ہوں گے",
      " محمد حسین نجفی ": "کچھ دل اس دن کانپ رہے ہوں گے۔",
      "مفتی تقی عثمانی": "س دن بہت سے دل لرز رہے ہوں گے ۔"
     },
     {
      "Aya": "﴾‏أَبْصَارُهَا خَاشِعَةٌ ﴿٩‎‏ ",
      "ابوالاعلی مودودی ": "نگاہیں اُن کی سہمی ہوئی ہوں گی",
      "  احمد رضا خان ": "آنکھ اوپر نہ اٹھا سکیں گے",
      "احمد علی ":"ان کی آنکھیں جھکی ہوئی ہوں گی",
      "  جالندہری ": "اور آنکھیں جھکی ہوئی",
      "  طاہر القادری":"ان کی آنکھیں (خوف و ہیبت سے) جھکی ہوں گی،",
      "   علامہ جوادی": "آنکھیں خوف سے جھکیِ ہوں گی",
      " محمد جوناگڑھی": "جن کی نگاہیں نیچی ہوں گی",
      " محمد حسین نجفی ": "ان کی آنکھیں (شدتِ خوف سے) جھکی ہوئی ہوں گی۔",
      "مفتی تقی عثمانی": "ان کی آنکھیں جھکی ہوئی ہوں گی ۔"
     },
     {
      "Aya": "  ﴾‏يَقُولُونَ أَإِنَّا لَمَرْدُودُونَ فِي الْحَافِرَةِ ﴿١٠   ‎‏",
      "ابوالاعلی مودودی ": "یہ لوگ کہتے ہیں \"کیا واقعی ہم پلٹا کر پھر واپس لائے جائیں گے؟",
      "  احمد رضا خان ": "کافر کہتے ہیں کیا ہم پھر الٹے پاؤں پلٹیں گے",
      "احمد علی ":"وہ کہتے ہیں کیا ہم پہلی حالت میں لوٹائے جائیں گے",
      "  جالندہری ": "کافر کہتے ہیں کیا ہم الٹے پاؤں پھر لوٹ جائیں گے",
      "  طاہر القادری":"کفّار کہتے ہیں: کیا ہم پہلی زندگی کی طرف پلٹائے جائیں گے،",
      "   علامہ جوادی": "یہ کفاّر کہتے ہیں کہ کیا ہم پلٹ کر پھر اس دنیا میں بھیجے جائیں گے",
      " محمد جوناگڑھی": "کہتے ہیں کہ کیا ہم پہلی کی سی حالت کی طرف پھر لوٹائے جائیں گے؟",
      " محمد حسین نجفی ": "وہ (کافر لوگ) کہتے ہیں کیا ہم پہلی حالت میں (الٹے پاؤں) واپس لائے جائیں گے؟",
      "مفتی تقی عثمانی": "یہ ( کافر لوگ ) کہتے ہیں کہ : کیا ہم پہلی والی حالت پر لوٹا دیئے جائیں گے ؟"
     },
     {
      "Aya": "﴾‏أَإِذَا كُنَّا عِظَامًا نَّخِرَةً ﴿١١‎‏",
      "ابوالاعلی مودودی ": "کیا جب ہم کھوکھلی بوسیدہ ہڈیاں بن چکے ہوں گے؟\"",
      "  احمد رضا خان ": "کیا ہم جب گلی ہڈیاں ہوجائیں گے",
      "احمد علی ":"کیا جب ہم بوسیدہ ہڈیاں ہوجائیں گے",
      "  جالندہری ": "بھلا جب ہم کھوکھلی ہڈیاں ہو جائیں گے (تو پھر زندہ کئے جائیں گے)",
      "  طاہر القادری":"کیا جب ہم بوسیدہ (کھوکھلی) ہڈیاں ہو جائیں گے (تب بھی زندہ کیے جائیں گے)،",
      "   علامہ جوادی": "کیا جب ہم کھوکھلی ہڈیاں ہوجائیں گے تب",
      " محمد جوناگڑھی": "کیا اس وقت جب کہ ہم بوسیده ہڈیاں ہو جائیں گے؟",
      " محمد حسین نجفی ": "کیا جب ہم بوسیدہ ہڈیاں ہو جائیں گے؟",
      "مفتی تقی عثمانی": "کیا اس وقت جب ہم بوسیدہ ہڈیوں میں تبدیل ہوچکے ہوں گے ؟"
     },
     {
      "Aya": " ﴾‏قَالُوا تِلْكَ إِذًا كَرَّةٌ خَاسِرَةٌ ﴿١٢‎‏ ",
      "ابوالاعلی مودودی ": "کہنے لگے \"یہ واپسی تو پھر بڑے گھاٹے کی ہوگی!\"",
      "  احمد رضا خان ": "بولے یوں تو یہ پلٹنا تو نرا نقصان ہے",
      "احمد علی ":"کہتے ہیں کہ یہ تو اس وقت خسارہ کا لوٹنا ہوگا",
      "  جالندہری ": "کہتے ہیں کہ یہ لوٹنا تو (موجب) زیاں ہے",
      "  طاہر القادری":"وہ کہتے ہیں: یہ (لوٹنا) تو اس وقت بڑے خسارے کا لوٹنا ہوگا،",
      "   علامہ جوادی": "یہ تو بڑے گھاٹے والی واپسی ہوگی",
      " محمد جوناگڑھی": "کہتے ہیں کہ پھر تو یہ لوٹنا نقصان ده ہے",
      " محمد حسین نجفی ": "کہتے ہیں یہ (واپسی) تو بڑے گھاٹے کی ہوگی۔",
      "مفتی تقی عثمانی": "کہتے ہیں کہ : اگر ایسا ہوا تو یہ بڑے گھاٹے کی واپسی ہوگی ۔ "
     },
     {
      "Aya": " ﴾‏فَإِنَّمَا هِيَ زَجْرَةٌ وَاحِدَةٌ ﴿١٣‎‏",
      "ابوالاعلی مودودی ": "حالانکہ یہ بس اتنا کام ہے کہ ایک زور کی ڈانٹ پڑے گی",
      "  احمد رضا خان ": "تو وہ نہیں مگر ایک جھڑکی",
      "احمد علی ":"پھر وہ واقعہ صرف ایک ہی ہیبت ناک آواز ہے",
      "  جالندہری ": "وہ تو صرف ایک ڈانٹ ہوگی",
      "  طاہر القادری":"پھر تو یہ ایک ہی بار شدید ہیبت ناک آواز کے ساتھ (کائنات کے تمام اَجرام کا) پھٹ جانا ہوگا،",
      "   علامہ جوادی": "یہ قیامت تو بس ایک چیخ ہوگی",
      " محمد جوناگڑھی": "معلوم ہونا چاہئے وه تو صرف ایک (خوفناک) ڈانٹ ہے",
      " محمد حسین نجفی ": "حالانکہ اس (واپسی) کیلئے ایک زور کی ڈانٹ پڑے گی۔",
      "مفتی تقی عثمانی": "حقیقت تو یہ ہے کہ وہ بس ایک زور کی آواز ہوگی "
     },
     {
      "Aya": "﴾‏‏ فَإِذَا هُم بِالسَّاهِرَةِ ﴿١٤‎‏ ",
      "ابوالاعلی مودودی ": "اور یکایک یہ کھلے میدان میں موجود ہوں گے",
      "  احمد رضا خان ": "جبھی وہ کھلے میدان میں آپڑے ہوں گے",
      "احمد علی ":"پس وہ اسی وقت میدان میں آ موجود ہوں گے",
      "  جالندہری ": "اس وقت وہ (سب) میدان (حشر) میں آ جمع ہوں گے",
      "  طاہر القادری":"پھر وہ (سب لوگ) یکایک کھلے میدانِ (حشر) میں آموجود ہوں گے،",
      "   علامہ جوادی": "جس کے بعد سب میدان هحشر میں نظر آئیں گے",
      " محمد جوناگڑھی": "کہ (جس کے ﻇاہر ہوتے ہی) وه ایک دم میدان میں جمع ہو جائیں گے",
      " محمد حسین نجفی ": "پھر وہ کھلے ہوئے میدان (قیامت) میں موجود ہوں گے۔",
      "مفتی تقی عثمانی": "جس کے بعد وہ اچانک ایک کھلے میدان میں ہوں گے ۔"
     },
     {
      "Aya": "﴾‏هَلْ أَتَاكَ حَدِيثُ مُوسَىٰ ﴿١٥‎‏",
      "ابوالاعلی مودودی ": "کیا تمہیں موسیٰؑ کے قصے کی خبر پہنچی ہے؟",
      "  احمد رضا خان ": "کیا تمہیں موسیٰ کی خبر آئی",
      "احمد علی ":"کیا آپ کو موسیٰ کا حال معلوم ہوا ہے",
      "  جالندہری ": "بھلا تم کو موسیٰ کی حکایت پہنچی ہے",
      "  طاہر القادری":"کیا آپ کے پاس موسٰی (علیہ السلام) کی خبر پہنچی ہے،",
      "   علامہ جوادی": "کیا تمہارے پاس موسٰی کی خبر آئی ہے",
      " محمد جوناگڑھی": "کیا موسیٰ (علیہ السلام) کی خبر تمہیں پہنچی ہے؟",
      " محمد حسین نجفی ": "اے رسول(ص) کیا آپ(ص) کو موسیٰ(ع) کے قصہ کی خبر پہنچی ہے؟",
      "مفتی تقی عثمانی": " اے پیغمبر کیا تمہیں موسیٰ کا واقعہ پہنچا ہے ؟"
     },
     {
      "Aya": " ﴾‏إِذْ نَادَاهُ رَبُّهُ بِالْوَادِ الْمُقَدَّسِ طُوًى ﴿١٦   ‎‏",
      "ابوالاعلی مودودی ": "جب اس کے رب نے اُسے طویٰ کی مقدس وادی میں پکارا تھا",
      "  احمد رضا خان ": "جب اسے اس کے رب نے پاک جنگل طویٰ میں ندا فرمائی،",
      "احمد علی ":"جب کہ مقدس وادی طویٰ میں اس کے رب نے اسےپکارا",
      "  جالندہری ": "جب اُن کے پروردگار نے ان کو پاک میدان (یعنی) طویٰ میں پکارا",
      "  طاہر القادری":"جب ان کے رب نے طوٰی کی مقدّس وادی میں انہیں پکارا تھا،",
      "   علامہ جوادی": "جب ان کے رب نے انہیں طویٰ کی مقدس وادی میں آواز دی",
      " محمد جوناگڑھی": "جب کہ انہیں ان کے رب نے پاک میدان طویٰ میں پکارا",
      " محمد حسین نجفی ": "جب ان کے پروردگار نے طویٰ کی مقدس وادی میں انہیں پکارا تھا۔",
      "مفتی تقی عثمانی": "جب ان کے پروردگار نے انہیں طوی کی مقدس وادی میں آواز دی تھی "
     },
     {
      "Aya": " ﴾‏اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُ طَغَىٰ ﴿١٧   ‎‏",
      "ابوالاعلی مودودی ": "کہ \"فرعون کے پاس جا، وہ سرکش ہو گیا ہے",
      "  احمد رضا خان ": "کہ فرعون کے پاس جا اس نے سر اٹھایا",
      "احمد علی ":"فرعون کے پاس جاؤ کیونکہ اس نے سرکشی کی ہے",
      "  جالندہری ": "اور حکم دیا کہ فرعون کے پاس جاؤ وہ سرکش ہو رہا ہے",
      "  طاہر القادری":"اور حکم دیا تھا کہ فرعون کے پاس جاؤ وہ سرکش ہو گیا ہے،",
      "   علامہ جوادی": "فرعون کی طرف جاؤ وہ سرکش ہوگیا ہے",
      " محمد جوناگڑھی": "تم فرعون کے پاس جاؤ اس نے سرکشی اختیار کر لی ہے",
      " محمد حسین نجفی ": "کہ جاؤ فرعون کے پاس کہ وہ سرکش ہوگیا ہے۔",
      "مفتی تقی عثمانی": "کہ : فرعون کے پاس چلے جاؤ ، اس نے بہت سرکشی اختیار کر رکھی ہے ۔"
     },
     {
      "Aya": "﴾‏فَقُلْ هَل لَّكَ إِلَىٰ أَن تَزَكَّىٰ ﴿١٨   ‎",
      "ابوالاعلی مودودی ": "اور اس سے کہہ کیا تو اِس کے لیے تیار ہے کہ پاکیزگی اختیار کرے",
      "  احمد رضا خان ": "اس سے کہہ کیا تجھے رغبت اس طرف ہے کہ ستھرا ہو",
      "احمد علی ":"پس کہو کیا تیری خواہش ہے کہ تو پاک ہو",
      "  جالندہری ": "اور (اس سے) کہو کہ کیا تو چاہتا ہے کہ پاک ہو جائے؟",
      "  طاہر القادری":"پھر (اس سے) کہو: کیا تیری خواہش ہے کہ تو پاک ہو جائے،",
      "   علامہ جوادی": "اس سے کہو کیا یہ ممکن ہے تو پاکیزہ کردار ہوجائے",
      " محمد جوناگڑھی": "اس سے کہو کہ کیا تو اپنی درستگی اور اصلاح چاہتا ہے",
      " محمد حسین نجفی ": "پس اس سے کہو کہ کیا تو چاہتا ہے کہ پاکیزگی اختیار کرے؟",
      "مفتی تقی عثمانی": "اور اس سے کہو کہ کیا تمہیں یہ خواہش ہے کہ تم سنور جاؤ؟"
     },
     {
      "Aya": "﴾‏وَأَهْدِيَكَ إِلَىٰ رَبِّكَ فَتَخْشَىٰ ﴿١٩  ‎‏ ",
      "ابوالاعلی مودودی ": "اور میں تیرے رب کی طرف تیری رہنمائی کروں تو (اُس کا) خوف تیرے اندر پیدا ہو؟\"",
      "  احمد رضا خان ": "اور تجھے تیرے رب کی طرف راہ بتاؤں کہ تو ڈرے",
      "احمد علی ":"اور میں تجھے تیرے رب کی طرف راہ بتاؤں کہ تو ڈرے",
      "  جالندہری ": "اور میں تجھے تیرے پروردگار کا رستہ بتاؤں تاکہ تجھ کو خوف (پیدا) ہو",
      "  طاہر القادری":"اور (کیا تو چاہتا ہے کہ) میں تیرے رب کی طرف تیری رہنمائی کروں تاکہ تو (اس سے) ڈرنے لگے،",
      "   علامہ جوادی": "اور میں تجھے تیرے رب کی طرف ہدایت کروں اور تیرے دل میں خوف پیدا ہوجائے",
      " محمد جوناگڑھی": "اور یہ کہ میں تجھے تیرے رب کی راه دکھاؤں تاکہ تو (اس سے) ڈرنے لگے",
      " محمد حسین نجفی ": "اور (کیا تو چاہتا ہے کہ) میں تیرے پروردگار کی طرف تیری راہنمائی کروں تو تُو (اس سے) ڈرے؟",
      "مفتی تقی عثمانی": "اور یہ کہ میں تمہیں تمہارے پروردگار کا راستہ دکھاؤں تو تمہارے دل میں خوف پیدا ہوجائے؟"
     },
     {
      "Aya": "﴾‏فَأَرَاهُ الْآيَةَ الْكُبْرَىٰ ﴿٢٠   ‎",
      "ابوالاعلی مودودی ": "پھر موسیٰؑ نے (فرعون کے پاس جا کر) اُس کو بڑی نشانی دکھائی",
      "  احمد رضا خان ": "پھر موسیٰ نے اسے بہت بڑی نشانی دکھائی",
      "احمد علی ":"پس اس نے اس کو بڑی نشانی دکھائی",
      "  جالندہری ": "غرض انہوں نے اس کو بڑی نشانی دکھائی",
      "  طاہر القادری":"پھر موسٰی (علیہ السلام) نے اسے بڑی نشانی دکھائی،",
      "   علامہ جوادی": "پھر انہوں نے اسے عظیم نشانی دکھلائی",
      " محمد جوناگڑھی": "پس اسے بڑی نشانی دکھائی",
      " محمد حسین نجفی ": "پس موسیٰ(ع) نے (وہاں جا کر) اسے ایک بہت بڑی نشانی دکھائی۔",
      "مفتی تقی عثمانی": "چنانچہ موسیٰ نے اس کو بڑی زبردست نشانی دکھائی "
     },
     {
      "Aya": "  ﴾‏فَكَذَّبَ وَعَصَىٰ ﴿٢١  ‎‏",
      "ابوالاعلی مودودی ": "مگر اُس نے جھٹلا دیا اور نہ مانا",
      "  احمد رضا خان ": "اس پر اس نے جھٹلایا اور نافرمانی کی،",
      "احمد علی ":"تو اس نے جھٹلایا اور نافرمانی کی",
      "  جالندہری ": "مگر اس نے جھٹلایا اور نہ مانا",
      "  طاہر القادری":"تو اس نے جھٹلا دیا اور نافرمانی کی،",
      "   علامہ جوادی": "تو اس نے انکار کردیا اور نافرمانی کی",
      " محمد جوناگڑھی": "تو اس نے جھٹلایا اور نافرمانی کی",
      " محمد حسین نجفی ": "تو اس نے جھٹلایا اور نافرمانی کی۔",
      "مفتی تقی عثمانی": "پھر بھی اس نے ( انہیں ) جھٹلایا ، اور کہنا نہیں مانا ۔"
     },
     {
      "Aya": " ﴾‏ثُمَّ أَدْبَرَ يَسْعَىٰ ﴿٢٢  ‎‏",
      "ابوالاعلی مودودی ": "پھر چالبازیاں کرنے کے لیے پلٹا",
      "  احمد رضا خان ": "پھر پیٹھ دی اپنی کوشش میں لگا",
      "احمد علی ":"پھر کوشش کرتا ہوا واپس لوٹا",
      "  جالندہری ": "پھر لوٹ گیا اور تدبیریں کرنے لگا",
      "  طاہر القادری":"پھر وہ (حق سے) رُوگرداں ہو کر (موسٰی علیہ السلام کی مخالفت میں) سعی و کاوش کرنے لگا،",
      "   علامہ جوادی": "پھر منہ پھیر کر دوڑ دھوپ میں لگ گیا",
      " محمد جوناگڑھی": "پھر پلٹا دوڑ دھوپ کرتے ہوئے",
      " محمد حسین نجفی ": "پھر وہ پلٹا (اور مخالفانہ سرگرمیوں میں) کوشاں ہو گیا۔",
      "مفتی تقی عثمانی": "پھر دوڑ دھوپ کرنے کے لیے پلٹا ۔"
     },
     {
      "Aya": "﴾‏فَحَشَرَ فَنَادَىٰ ﴿٢٣‎‏ ",
      "ابوالاعلی مودودی ": "اور لوگوں کو جمع کر کے اس نے پکار کر کہا",
      "  احمد رضا خان ": "تو لوگوں کو جمع کیا پھر پکارا،",
      "احمد علی ":"پھر اس نے سب کو جمع کیا پھر پکارا",
      "  جالندہری ": "اور (لوگوں کو) اکٹھا کیا اور پکارا",
      "  طاہر القادری":"پھر اس نے (لوگوں کو) جمع کیا اور پکارنے لگا،",
      "   علامہ جوادی": "پھر سب کو جمع کیا اور آواز دی",
      " محمد جوناگڑھی": "پھر سب کو جمع کرکے پکارا",
      " محمد حسین نجفی ": "یعنی (لوگوں کو) جمع کیا اور پکار کر کہا۔",
      "مفتی تقی عثمانی": "پھر سب کو اکٹھا کیا اور آواز لگائی ۔"
     },
     {
      "Aya": "﴾‏فَقَالَ أَنَا رَبُّكُمُ الْأَعْلَىٰ ﴿٢٤‎‏",
      "ابوالاعلی مودودی ": "\"میں تمہارا سب سے بڑا رب ہوں\"",
      "  احمد رضا خان ": "پھر بولا میں تمہارا سب سے اونچا رب ہوں",
      "احمد علی ":"پھر کہا کہ میں تمہارا سب سے برتر رب ہوں",
      "  جالندہری ": "کہنے لگا کہ تمہارا سب سے بڑا مالک میں ہوں",
      "  طاہر القادری":"پھر اس نے کہا: میں تمہارا سب سے بلند و بالا رب ہوں،",
      "   علامہ جوادی": "اور کہا کہ میں تمہارا رب اعلیٰ ہوں",
      " محمد جوناگڑھی": "تم سب کا رب میں ہی ہوں",
      " محمد حسین نجفی ": "کہ میں تمہارا سب سے بڑا پرورگار ہوں۔",
      "مفتی تقی عثمانی": "اور کہا کہ : میں تمہارا اعلی درجے کا پروردگار ہوں ۔"
     },
     {
      "Aya": " ﴾‏فَأَخَذَهُ اللَّهُ نَكَالَ الْآخِرَةِ وَالْأُولَىٰ ﴿٢٥  ‎",
      "ابوالاعلی مودودی ": "آخرکار اللہ نے اسے آخرت اور دنیا کے عذاب میں پکڑ لیا",
      "  احمد رضا خان ": "تو اللہ نے اسے دنیا و آخرت دونوں کے عذاب میں پکڑا",
      "احمد علی ":"پھر الله نے اس کو آخرت اور دنیا کے عذاب میں پکڑ لیا",
      "  جالندہری ": "تو خدا نے اس کو دنیا اور آخرت (دونوں) کے عذاب میں پکڑ لیا",
      "  طاہر القادری":"تو اللہ نے اسے آخرت اور دنیا کی (دوہری) سزا میں پکڑ لیا،",
      "   علامہ جوادی": "تو خدا نے اسے دنیا و آخرت دونو ںکے عذاب کی گرفت میں لے لیا",
      " محمد جوناگڑھی": "تو (سب سے بلند وباﻻ) اللہ نے بھی اسے آخرت کے اور دنیا کے عذاب میں گرفتار کرلیا",
      " محمد حسین نجفی ": "پس اللہ نے اسے آخرت اور دنیا کے (دوہرے) عذاب میں پکڑا۔",
      "مفتی تقی عثمانی": "نتیجہ یہ ہوا کہ اللہ نے اسے آخرت اور دنیا کے عذاب میں پکڑ لیا ۔ "
     },
     {
      "Aya": "﴾‏إِنَّ فِي ذَٰلِكَ لَعِبْرَةً لِّمَن يَخْشَىٰ ﴿٢٦‎",
      "ابوالاعلی مودودی ": "درحقیقت اِس میں بڑی عبرت ہے ہر اُس شخص کے لیے جو ڈرے",
      "  احمد رضا خان ": "بیشک اس میں سیکھ ملتا ہے اسے جو ڈرے",
      "احمد علی ":"بے شک اس میں اس کے لیے عبرت ہے جو ڈرتا ہے",
      "  جالندہری ": "جو شخص (خدا سے) ڈر رکھتا ہے اس کے لیے اس (قصے) میں عبرت ہے",
      "  طاہر القادری":"بیشک اس (واقعہ) میں اس شخص کے لئے بڑی عبرت ہے جو (اللہ سے) ڈرتا ہے،",
      "   علامہ جوادی": "اس واقعہ میں خوف خدا رکھنے والوں کے لئے عبرت کا سامان ہے",
      " محمد جوناگڑھی": "بیشک اس میں اس شخص کے لئے عبرت ہے جو ڈرے",
      " محمد حسین نجفی ": "بےشک اس (قصہ) میں بڑی عبرت ہے ہر اس شخص کیلئے جو (خدا سے) ڈرے۔",
      "مفتی تقی عثمانی": "حقیقت یہ ہے کہ اس واقعے میں اس شخص کے لیے بڑی عبرت ہے جو اللہ کا خوف دل میں رکھتا ہو ۔"
     },
     {
      "Aya": "﴾‏أَأَنتُمْ أَشَدُّ خَلْقًا أَمِ السَّمَاءُ ۚ بَنَاهَا ﴿٢٧‎‏",
      "ابوالاعلی مودودی ": "کیا تم لوگوں کی تخلیق زیادہ سخت کام ہے یا آسمان کی؟ اللہ نے اُس کو بنایا",
      "  احمد رضا خان ": "کیا تمہاری سمجھ کے مطابق تمہارا بنانا مشکل یا آسمان کا اللہ نے اسے بنایا،",
      "احمد علی ":"کیا تمہارا بنانا بڑی بات ہے یا آسمان کا جس کو ہم نے بنایا ہے",
      "  جالندہری ": "بھلا تمہارا بنانا آسان ہے یا آسمان کا؟ اسی نے اس کو بنایا",
      "  طاہر القادری":"کیا تمہارا پیدا کرنا زیادہ مشکل ہے یا (پوری) سماوی کائنات کا، جسے اس نے بنایا،",
      "   علامہ جوادی": "کیا تمہاری خلقت آسمان بنانے سے زیادہ مشکل کام ہے کہ اس نے آسمان کو بنایا ہے",
      " محمد جوناگڑھی": "کیا تمہارا پیدا کرنا زیاده دشوار ہے یا آسمان کا؟ اللہ تعالیٰ نے اسے بنایا",
      " محمد حسین نجفی ": "کیا تم لوگوں کا (دوبارہ) پیدا کرنا زیادہ مشکل ہے؟ یا آسمان کا؟ اللہ نے اس کو بنایا۔",
      "مفتی تقی عثمانی": "انسانو  کیا تمہیں پیدا کرنا زیادہ مشکل ہے یا آسمان کو؟  اس کو اللہ نے بنایا ہے "
     },
     {
      "Aya": "﴾‏رَفَعَ سَمْكَهَا فَسَوَّاهَا ﴿٢٨‎‏ ",
      "ابوالاعلی مودودی ": "اُس کی چھت خوب اونچی اٹھائی پھر اُس کا توازن قائم کیا",
      "  احمد رضا خان ": "اس کی چھت اونچی کی پھر اسے ٹھیک کیا",
      "احمد علی ":"ا سکی چھت بلند کی پھر اس کو سنوارا",
      "  جالندہری ": "اس کی چھت کو اونچا کیا اور پھر اسے برابر کر دیا",
      "  طاہر القادری":"اس نے آسمان کے تمام کرّوں (ستاروں) کو (فضائے بسیط میں پیدا کر کے) بلند کیا، پھر ان (کی ترکیب و تشکیل اور افعال و حرکات) میں اعتدال، توازن اور استحکام پیدا کر دیا،",
      "   علامہ جوادی": "اس کی چھت کو بلند کیا اور پھر برابر کردیا ہے",
      " محمد جوناگڑھی": "اس کی بلندی اونچی کی پھر اسے ٹھیک ٹھاک کر دیا",
      " محمد حسین نجفی ": "اور اس کی چھت کو بلند کیا پھر اس کو درست کیا۔",
      "مفتی تقی عثمانی": "اس کی بلندی اٹھائی ہوئی ہے ، پھر اسے ٹھیک کیا ہے"
     },
     {
      "Aya": " ﴾‏وَأَغْطَشَ لَيْلَهَا وَأَخْرَجَ ضُحَاهَا ﴿٢٩‎",
      "ابوالاعلی مودودی ": "اور اُس کی رات ڈھانکی اور اُس کا دن نکالا",
      "  احمد رضا خان ": "اس کی رات اندھیری کی اور اس کی روشنی چمکائی",
      "احمد علی ":"اور اس کی رات اندھیری کی اور اس کے دن کو ظاہر کیا",
      "  جالندہری ": "اور اسی نے رات کو تاریک بنایا اور (دن کو) دھوپ نکالی",
      "  طاہر القادری":"اور اُسی نے آسمانی خلا کی رات کو (یعنی سارے خلائی ماحول کو مثلِ شب) تاریک بنایا، اور (اِس خلا سے) ان (ستاروں) کی روشنی (پیدا کر کے) نکالی،",
      "   علامہ جوادی": "اس کی رات کو تاریک بنایا ہے اور دن کی روشنی نکال دی ہے",
      " محمد جوناگڑھی": "اسکی رات کو تاریک بنایا اور اس کے دن کو نکالا",
      " محمد حسین نجفی ": "اور اس کی رات کو تاریک بنایا اور اس کے دن کو ظاہر کیا۔",
      "مفتی تقی عثمانی": "اور اس کی رات کو اندھیری بنایا ہے ، اور اس کے دن کی دھوپ باہر نکال دی ہے ۔"
     },
     {
      "Aya": "﴾‏وَالْأَرْضَ بَعْدَ ذَٰلِكَ دَحَاهَا ﴿٣٠‎‏",
      "ابوالاعلی مودودی ": "اِس کے بعد زمین کو اس نے بچھایا",
      "  احمد رضا خان ": "اور اس کے بعد زمین پھیلائی",
      "احمد علی ":"اور اس کے بعد زمین کو بچھا دیا",
      "  جالندہری ": "اور اس کے بعد زمین کو پھیلا دیا",
      "  طاہر القادری":"اور اُسی نے زمین کو اِس (ستارے: سورج کے وجود میں آجانے) کے بعد (اِس سے) الگ کر کے زور سے پھینک دیا (اور اِسے قابلِ رہائش بنانے کے لئے بچھا دیا)،",
      "   علامہ جوادی": "اس کے بعد زمین کا فرش بچھایا ہے",
      " محمد جوناگڑھی": "اور اس کے بعد زمین کو (ہموار) بچھا دیا",
      " محمد حسین نجفی ": "اس کے بعد زمین کو بچھایا۔",
      "مفتی تقی عثمانی": "اور زمین کو اس کے بعد بچھا دیا ہے ۔"
     },
     {
      "Aya": "﴾‏أَخْرَجَ مِنْهَا مَاءَهَا وَمَرْعَاهَا ﴿٣١‎",
      "ابوالاعلی مودودی ": "اُس کے اندر سے اُس کا پانی اور چارہ نکالا",
      "  احمد رضا خان ": "اس میں سے اس کا پانی اور چارہ نکا لا",
      "احمد علی ":"اس سے اس کا پانی اور اس کا چارا نکالا",
      "  جالندہری ": "اسی نے اس میں سے اس کا پانی نکالا اور چارا اگایا",
      "  طاہر القادری":"اسی نے زمین میں سے اس کا پانی (الگ) نکال لیا اور (بقیہ خشک قطعات میں) اس کی نباتات نکالیں،",
      "   علامہ جوادی": "اس میں سے پانی اور چارہ نکالا ہے",
      " محمد جوناگڑھی": "اس میں سے پانی اور چاره نکالا",
      " محمد حسین نجفی ": "اور اس سے اس کا پانی اور چارہ نکالا۔",
      "مفتی تقی عثمانی": "اس میں سے اس کا پانی اور اس کا چارہ نکالا ہے ۔"
     },
     {
      "Aya": "﴾‏‏ وَالْجِبَالَ أَرْسَاهَا ﴿٣٢‎‏ ",
      "ابوالاعلی مودودی ": "اور پہاڑ اس میں گاڑ دیے",
      "  احمد رضا خان ": "اور پہاڑوں کو جمایا",
      "احمد علی ":"او رپہاڑوں کو خوب جما دیا",
      "  جالندہری ": "اور اس پر پہاڑوں کابوجھ رکھ دیا",
      "  طاہر القادری":"اور اسی نے (بعض مادوں کو باہم ملا کر) زمین سے محکم پہاڑوں کو ابھار دیا،",
      "   علامہ جوادی": "اور پہاڑوں کو گاڑ دیا ہے",
      " محمد جوناگڑھی": "اور پہاڑوں کو (مضبوط) گاڑ دیا",
      " محمد حسین نجفی ": "اور پہاڑوں کو اس میں گاڑا۔",
      "مفتی تقی عثمانی": "اور پہاڑوں کو گاڑ دیا ہے ۔"
     },
     {
      "Aya": "﴾‏مَتَاعًا لَّكُمْ وَلِأَنْعَامِكُمْ ﴿٣٣‎‏ ",
      "ابوالاعلی مودودی ": "سامان زیست کے طور پر تمہارے لیے اور تمہارے مویشیوں کے لیے",
      "  احمد رضا خان ": "تمہارے اور تمہارے چوپایوں کے فائدہ کو،",
      "احمد علی ":"تمہارے لیے اور تمہارے چار پایوں کے لیے سامان حیات ہے",
      "  جالندہری ": "یہ سب کچھ تمہارے اور تمہارے چارپایوں کے فائدے کے لیے (کیا)",
      "  طاہر القادری":"یہ سب کچھ تمہارے اور تمہارے چوپایوں کے فائدہ کے لئے (کیا)،",
      "   علامہ جوادی": "یہ سب تمہارے اور جانوروں کے لئے ایک سرمایہ ہے",
      " محمد جوناگڑھی": "یہ سب تمہارے اور تمہارے جانوروں کے فائدے کے لئے (ہیں)",
      " محمد حسین نجفی ": "تمہارے اور تمہارے مو یشیوں کے لئے سامانِ زندگی کے طور پر۔",
      "مفتی تقی عثمانی": "تاکہ تمہیں اور تمہارے مویشیوں کو فائدہ پہنچائے ۔"
     },
     {
      "Aya": "﴾‏فَإِذَا جَاءَتِ الطَّامَّةُ الْكُبْرَىٰ ﴿٣٤‎",
      "ابوالاعلی مودودی ": "پھر جب وہ ہنگامہ عظیم برپا ہوگا",
      "  احمد رضا خان ": "پھر جب آئے گی وہ عام مصیبت سب سے بڑی",
      "احمد علی ":"پس جب وہ بڑا حادثہ آئے گا",
      "  جالندہری ": "تو جب بڑی آفت آئے گی",
      "  طاہر القادری":"پھر اس وقت (کائنات کے) بڑھتے بڑھتے (اس کی انتہا پر) ہر چیز پر غالب آجانے والی بہت سخت آفتِ (قیامت) آئے گی،",
      "   علامہ جوادی": "پھر جب بڑی مصیبت آجائے گی",
      " محمد جوناگڑھی": "پس جب وه بڑی آفت (قیامت) آجائے گی",
      " محمد حسین نجفی ": "پس جب بڑی آفت (قیامت) آئے گی۔",
      "مفتی تقی عثمانی": "پھر جب وہ سب سے بڑا ہنگامہ برپا ہوگا ۔"
     },
     {
      "Aya": "﴾‏يَوْمَ يَتَذَكَّرُ الْإِنسَانُ مَا سَعَىٰ ﴿٣٥‎‏ ",
      "ابوالاعلی مودودی ": "جس روز انسان اپنا سب کیا دھرا یاد کرے گا",
      "  احمد رضا خان ": "اس دن آدمی یاد کرے گا جو کوشش کی تھی",
      "احمد علی ":"جس دن انسان اپنے کیے کو یاد کرے گا",
      "  جالندہری ": "اس دن انسان اپنے کاموں کو یاد کرے گا",
      "  طاہر القادری":"اُس دن انسان اپنی (ہر) کوشش و عمل کو یاد کرے گا،",
      "   علامہ جوادی": "جس دن انسان یاد کرے گا کہ اس نے کیا کیا ہے",
      " محمد جوناگڑھی": "جس دن کہ انسان اپنے کیے ہوئے کاموں کو یاد کرے گا",
      " محمد حسین نجفی ": "جس دن انسان یاد کرے گا جو کچھ اس نے کیا ہوگا۔",
      "مفتی تقی عثمانی": "جس دن انسان اپنا سارا کیا دھرا یاد کرے گا ۔"
     },
     {
      "Aya": " ﴾‏وَبُرِّزَتِ الْجَحِيمُ لِمَن يَرَىٰ ﴿٣٦  ‎‏",
      "ابوالاعلی مودودی ": "اور ہر دیکھنے والے کے سامنے دوزخ کھول کر رکھ دی جائے گی",
      "  احمد رضا خان ": "اور جہنم ہر دیکھنے والے پر ظاہر کی جائے گی",
      "احمد علی ":"اور ہر دیکھنے والے کے لیے دوزخ سامنے لائی جائے گی",
      "  جالندہری ": "اور دوزخ دیکھنے والے کے سامنے نکال کر رکھ دی جائے گی",
      "  طاہر القادری":"اور ہر دیکھنے والے کے لئے دوزخ ظاہر کر دی جائے گی،",
      "   علامہ جوادی": "اور جہنم کو دیکھنے والوں کے لئے نمایاں کردیا جائے گا",
      " محمد جوناگڑھی": "اور (ہر) دیکھنے والے کے سامنے جہنم ﻇاہر کی جائے گی",
      " محمد حسین نجفی ": "اور (ہر) دیکھنے والے کیلئے دوزخ ظاہر کر دی جائے گی۔",
      "مفتی تقی عثمانی": "اور دوزخ ہر دیکھنے والے کے سامنے ظاہر کردی جائے گی ۔"
     },
     {
      "Aya": "﴾‏فَأَمَّا مَن طَغَىٰ ﴿٣٧‎‏ ",
      "ابوالاعلی مودودی ": "تو جس نے سرکشی کی تھی",
      "  احمد رضا خان ": "تو وہ جس نے سرکشی کی",
      "احمد علی ":"سو جس نے سرکشی کی",
      "  جالندہری ": "تو جس نے سرکشی کی",
      "  طاہر القادری":"پھر جس شخص نے سرکشی کی ہوگی،",
      "   علامہ جوادی": "پھر جس نے سرکشی کی ہے",
      " محمد جوناگڑھی": "تو جس (شخص) نے سرکشی کی (ہوگی)",
      " محمد حسین نجفی ": "پس جس شخص نے سرکشی کی ہوگی۔",
      "مفتی تقی عثمانی": "تو وہ جس نے سرکشی کی تھی ۔"
     },
     {
      "Aya": "﴾‏‏ وَآثَرَ الْحَيَاةَ الدُّنْيَا ﴿٣٨‎",
      "ابوالاعلی مودودی ": "اور دنیا کی زندگی کو ترجیح دی تھی",
      "  احمد رضا خان ": "اور دنیا کی زندگی کو ترجیح دی",
      "احمد علی ":"اور دنیا کی زندگی کو ترجیح دی",
      "  جالندہری ": "اور دنیا کی زندگی کو مقدم سمجھا",
      "  طاہر القادری":"اور دنیاوی زندگی کو (آخرت پر) ترجیح دی ہوگی،",
      "   علامہ جوادی": "اور زندگانی دنیا کو اختیار کیا ہے",
      " محمد جوناگڑھی": "اور دنیوی زندگی کو ترجیح دی (ہوگی)",
      " محمد حسین نجفی ": "اور (آخرت پر) دنیٰوی زندگی کو ترجیح دی ہوگی۔",
      "مفتی تقی عثمانی": "اور دنیا کی زندگی کو ترجیح دی تھی ۔"
     },
     {
      "Aya": " ﴾‏فَإِنَّ الْجَحِيمَ هِيَ الْمَأْوَىٰ ﴿٣٩‎‏",
      "ابوالاعلی مودودی ": "دوزخ ہی اس کا ٹھکانا ہوگی",
      "  احمد رضا خان ": "تو بیشک جہنم ہی اس کا ٹھکانا ہے،",
      "احمد علی ":"سو بے شک اس کا ٹھکانا دوزخ ہی ہے",
      "  جالندہری ": "اس کا ٹھکانہ دوزخ ہے",
      "  طاہر القادری":"تو بیشک دوزخ ہی (اُس کا) ٹھکانا ہوگا،",
      "   علامہ جوادی": "جہنم ّاس کا ٹھکانا ہوگا",
      " محمد جوناگڑھی": "اس کا ٹھکانا جہنم ہی ہے",
      " محمد حسین نجفی ": "تو اس کا ٹھکانہ دوزخ ہوگا۔",
      "مفتی تقی عثمانی": "تو دوزخ ہی اس کا ٹھکانا ہوگی ۔"
     },
     {
      "Aya": "﴾‏وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَىٰ ﴿٤٠‎",
      "ابوالاعلی مودودی ": "اور جس نے اپنے رب کے سامنے کھڑے ہونے کا خوف کیا تھا اور نفس کو بری خواہشات سے باز رکھا تھا",
      "  احمد رضا خان ": "اور وہ جو اپنے رب کے حضور کھڑے ہونے سے ڈرا اور نفس کو خواہش سے روکا",
      "احمد علی ":"اور لیکن جو اپنے رب کے سامنے کھڑا ہونے سے ڈرتارہا اور اس نے اپنے نفس کو بری خواہش سے روکا",
      "  جالندہری ": "اور جو اپنے پروردگار کے سامنے کھڑے ہونے سے ڈرتا اور جی کو خواہشوں سے روکتا رہا",
      "  طاہر القادری":"اور جو شخص اپنے رب کے حضور کھڑا ہونے سے ڈرتا رہا اور اُس نے (اپنے) نفس کو (بری) خواہشات و شہوات سے باز رکھا،",
      "   علامہ جوادی": "اور جس نے رب کی بارگاہ میں حاضری کا خوف پیدا کیا ہے اور اپنے نفس کو خواہشات سے روکا ہے",
      " محمد جوناگڑھی": "ہاں جو شخص اپنے رب کے سامنے کھڑے ہونے سے ڈرتا رہا ہوگا اور اپنے نفس کو خواہش سے روکا ہوگا",
      " محمد حسین نجفی ": "اور جو شخص اپنے پروردگار کی بارگاہ میں حاضری سے ڈرتا رہا ہوگا اور (اپنے) نفس کو (اس کی) خواہش سے روکا ہوگا۔",
      "مفتی تقی عثمانی": "لیکن وہ جو اپنے پروردگار کے سامنے کھڑا ہونے کا خوف رکھتا تھا اور اپنے نفس کو بری خواہشات سے روکتا تھا ۔"
     },
     {
      "Aya": "﴾‏فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَىٰ ﴿٤١‎",
      "ابوالاعلی مودودی ": "جنت اس کا ٹھکانا ہوگی",
      "  احمد رضا خان ": "تو بیشک جنت ہی ٹھکانا ہے",
      "احمد علی ":"سو بے شک اس کا ٹھکانا بہشت ہی ہے",
      "  جالندہری ": "اس کا ٹھکانہ بہشت ہے",
      "  طاہر القادری":"تو بیشک جنت ہی (اُس کا) ٹھکانا ہوگا،",
      "   علامہ جوادی": "تو جنّت اس کا ٹھکانا اور مرکز ہے",
      " محمد جوناگڑھی": "تو اس کا ٹھکانا جنت ہی ہے",
      " محمد حسین نجفی ": "تو اس کا ٹھکانہ جنت ہے۔",
      "مفتی تقی عثمانی": "تو جنت ہی اس کا ٹھکانا ہوگی ۔"
     },
     {
      "Aya": "﴾‏يَسْأَلُونَكَ عَنِ السَّاعَةِ أَيَّانَ مُرْسَاهَا ﴿٤٢‎‏ ",
      "ابوالاعلی مودودی ": "یہ لوگ تم سے پوچھتے ہیں کہ \"آخر وہ گھڑی کب آ کر ٹھیرے گی؟\"",
      "  احمد رضا خان ": "تم سے قیامت کو پوچھتے ہیں کہ وہ کب کے لیے ٹھہری ہوئی ہے،",
      "احمد علی ":"آپ سے قیامت کی بابت پوچھتے ہیں کہ اس کا قیام کب ہوگا",
      "  جالندہری ": "اے پیغمبر، لوگ تم سے قیامت کے بارے میں پوچھتے ہیں کہ اس کا وقوع کب ہو گا؟",
      "  طاہر القادری":"کفّار آپ سے قیامت کے بارے میں پوچھتے ہیں کہ اس کا وقوع کب ہوگا،",
      "   علامہ جوادی": "پیغمبر لوگ آپ سے قیامت کے بارے میں پوچھتے ہیں کہ اس کا ٹھکانا کب ہے",
      " محمد جوناگڑھی": "لوگ آپ سے قیامت کے واقع ہونے کا وقت دریافت کرتے ہیں",
      " محمد حسین نجفی ": "یہ لوگ آپ(ص) سے سوال کرتے ہیں کہ قیامت کب کھڑی (برپا) ہوگی۔",
      "مفتی تقی عثمانی": "یہ لوگ تم سے قیامت کی گھڑی کے بارے میں پوچھتے ہیں کہ وہ کب قائم ہوگی ؟"
     },
     {
      "Aya": "﴾‏فِيمَ أَنتَ مِن ذِكْرَاهَا ﴿٤٣‎",
      "ابوالاعلی مودودی ": "تمہارا کیا کام کہ اس کا وقت بتاؤ",
      "  احمد رضا خان ": "تمہیں اس کے بیان سے کیا تعلق",
      "احمد علی ":"آپ کو اس کےذکر سے کیا واسطہ",
      "  جالندہری ": "سو تم اس کے ذکر سے کس فکر میں ہو",
      "  طاہر القادری":"تو آپ کو اس کے (وقت کے) ذکر سے کیا غرض،",
      "   علامہ جوادی": "آپ اس کی یاد کے بارے میں کس منزل پر ہیں",
      " محمد جوناگڑھی": "آپ کو اس کے بیان کرنے سے کیا تعلق؟",
      " محمد حسین نجفی ": "آپ(ص) کا اس کے وقت بتانے سے کیا تعلق؟",
      "مفتی تقی عثمانی": "تمہارا یہ بات بیان کرنے کیا کام؟"
     },
     {
      "Aya": "﴾‏إِلَىٰ رَبِّكَ مُنتَهَاهَا ﴿٤٤  ‎",
      "ابوالاعلی مودودی ": "اس کا علم تو اللہ پر ختم ہے",
      "  احمد رضا خان ": "تمہارے رب ہی تک اس کی انتہا ہے،",
      "احمد علی ":"اس کے علم کی انتہا آپ کے رب ہی کی طرف ہے",
      "  جالندہری ": "اس کا منتہا (یعنی واقع ہونے کا وقت) تمہارے پروردگار ہی کو (معلوم ہے)",
      "  طاہر القادری":"اس کی انتہا تو آپ کے رب تک ہے (یعنی ابتداء کی طرح انتہاء میں بھی صرف وحدت رہ جائے گی)،",
      "   علامہ جوادی": "اس کے علم کی ا نتہائ آپ کے پروردگار کی طرف ہے",
      " محمد جوناگڑھی": "اس کے علم کی انتہا تو اللہ کی جانب ہے",
      " محمد حسین نجفی ": "اس کی انتہا تو بس آپ(ص) کے پروردگار پر ہے۔",
      "مفتی تقی عثمانی": "اس کا علم تو تمہارے پروردگار پر ختم ہے ۔"
     },
     {
      "Aya": " ﴾‏إِنَّمَا أَنتَ مُنذِرُ مَن يَخْشَاهَا ﴿٤٥‎",
      "ابوالاعلی مودودی ": "تم صرف خبردار کرنے والے ہو ہر اُس شخص کو جو اُس کا خوف کرے",
      "  احمد رضا خان ": "تم تو فقط اسے ڈرا نے والے ہو جو اس سے ڈرے",
      "احمد علی ":"بے شک آپ تو صرف اس کو ڈرانے والے ہیں جو اس سے ڈرتا ہے",
      "  جالندہری ": "جو شخص اس سے ڈر رکھتا ہے تم تو اسی کو ڈر سنانے والے ہو",
      "  طاہر القادری":"آپ تو محض اس شخص کو ڈر سنانے والے ہیں جو اس سے خائف ہے،",
      "   علامہ جوادی": "آپ تو صرف اس کا خوف رکھنے والوں کو اس سے ڈرانے والے ہیں",
      " محمد جوناگڑھی": "آپ تو صرف اس سے ڈرتے رہنے والوں کو آگاه کرنے والے ہیں",
      " محمد حسین نجفی ": "آپ(ص) تو بس ڈرانے والے ہیں اس شخص کو جو اس سے ڈرے۔",
      "مفتی تقی عثمانی": "جو شخص اس سے ڈرتا ہو ، تم تو صرف اس کو خبردار کرنے والے ہو ۔"
     },
     {
      "Aya": " ﴾‏كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلَّا عَشِيَّةً أَوْ ضُحَاهَا ﴿٤٦‎‏",
      "ابوالاعلی مودودی ": "جس روز یہ لوگ اسے دیکھ لیں گے تو انہیں یوں محسوس ہوگا کہ (یہ دنیا میں یا حالت موت میں) بس ایک دن کے پچھلے پہر یا اگلے پہر تک ٹھیرے ہیں",
      "  احمد رضا خان ": "گویا جس دن وہ اسے دیکھیں گے دنیا میں نہ رہے تھے مگر ایک شام یا اس کے دن چڑھے،",
      "احمد علی ":"جس دن اسے دیکھ لیں گے (تو یہی سمجھیں گے کہ دنیا میں) گویا ہم ایک شام یا اس کی صبح تک ٹھیرے تھے",
      "  جالندہری ": "جب وہ اس کو دیکھیں گے (تو ایسا خیال کریں گے) کہ گویا (دنیا میں صرف) ایک شام یا صبح رہے تھے",
      "  طاہر القادری":"گویا وہ جس دن اسے دیکھ لیں گے تو (یہ خیال کریں گے کہ) وہ (دنیا میں) ایک شام یا اس کی صبح کے سوا ٹھہرے ہی نہ تھے،",
      "   علامہ جوادی": "گویا جب وہ لوگ اسے دیکھیں گے تو ایسا معلوم ہوگاجیسے ایک شام یا ایک صبح دنیامیں ٹھہرے ہیں",
      " محمد جوناگڑھی": "جس روز یہ اسے دیکھ لیں گے تو ایسا معلوم ہوگا کہ صرف دن کا آخری حصہ یا اول حصہ ہی (دنیا میں) رہے ہیں",
      " محمد حسین نجفی ": "جس دن یہ لوگ اس (قیامت) کو دیکھیں گے تو (انہیں ایسا محسوس ہوگا کہ) وہ (دنیا میں) نہیں ٹھہرے تھے۔ مگر ایک شام یا اس کی ایک صبح۔",
      "مفتی تقی عثمانی": "جس دن یہ اس کو دیکھ لیں گے ، اس دن انہیں ایسا معلوم ہوگا جیسے وہ ( دنیا میں یا قبر میں ) ایک شام یا ایک صبح سے زیادہ نہیں رہے"
     }
    ]