[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
        "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
     "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ":"شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":  "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ":"(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾‏أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ ﴿١ ‎‏",
      "ابوالاعلی مودودی ": "اے نبیؐ کیا ہم نے تمہارا سینہ تمہارے لیے کھول نہیں دیا؟",
        "  احمد رضا خان ": "کیا ہم نے تمہارا سینہ کشادہ نہ کیا",
     "احمد علی ": "کیا ہم نے آپ کا سینہ نہیں کھول دیا",
      "  جالندہری ":"اے محمدﷺ کیا ہم نے تمہارا سینہ کھول نہیں دیا؟ (بےشک کھول دیا)",
      "  طاہر القادری": "کیا ہم نے آپ کی خاطر آپ کا سینہ (انوارِ علم و حکمت اور معرفت کے لئے) کشادہ نہیں فرما دیا،",
      "   علامہ جوادی":  "کیا ہم نے آپ کے سینہ کو کشادہ نہیں کیا",
      " محمد جوناگڑھی": "کیا ہم نے تیرا سینہ نہیں کھول دیا",
      " محمد حسین نجفی ":"اے رسول(ص) کیا ہم نے آپ(ص) کے سینے کو کشادہ نہیں کر دیا؟",
      "مفتی تقی عثمانی": "اے پیغمبر  کیا ہم نے تمہاری خاطر تمہارا سینہ کھول نہیں دیا؟"
     },
     {
      "Aya": "﴾‏ وَوَضَعْنَا عَنكَ وِزْرَكَ ﴿٢    ‎",
      "ابوالاعلی مودودی ": "اور تم پر سے وہ بھاری بوجھ اتار دیا",
        "  احمد رضا خان ": "اور تم پر سے تمہارا بوجھ اتار لیا،",
     "احمد علی ": "اور کیا آپ سے آپ کا وہ بوجھ نہیں اتار دیا",
      "  جالندہری ":"اور تم پر سے بوجھ بھی اتار دیا",
      "  طاہر القادری": "اور ہم نے آپ کا (غمِ امت کا وہ) بار آپ سے اتار دیا،",
      "   علامہ جوادی":  "اور کیا آپ کے بوجھ کو اتار نہیں لیا",
      " محمد جوناگڑھی": "اور تجھ پر سے تیرا بوجھ ہم نے اتار دیا",
      " محمد حسین نجفی ":"اور وہ بَوجھ آپ سے اتار دیا۔",
      "مفتی تقی عثمانی": "اور ہم نے تم سے تمہارا وہ بوجھ اتار دیا ہے ۔"
     },
     {
      "Aya": " ﴾‏الَّذِي أَنقَضَ ظَهْرَكَ ﴿٣     ‎",
      "ابوالاعلی مودودی ": "جو تمہاری کمر توڑے ڈال رہا تھا",
        "  احمد رضا خان ": "جس نے تمہاری پیٹھ توڑی تھی",
     "احمد علی ": "جس نے آپ کی کمر جھکا دی تھی",
      "  جالندہری ":"جس نے تمہاری پیٹھ توڑ رکھی تھی",
      "  طاہر القادری": "جو آپ کی پشتِ (مبارک) پر گراں ہو رہا تھا،",
      "   علامہ جوادی":  "جس نے آپ کی کمر کو توڑ دیا تھا",
      " محمد جوناگڑھی": "جس نے تیری پیٹھ توڑ دی تھی",
      " محمد حسین نجفی ":"جو آپ(ص) کی کمر کو توڑ رہا تھا۔",
      "مفتی تقی عثمانی": "جس نے تمہاری کمر توڑ رکھی تھی "
     },
     {
      "Aya":" ﴾‏وَرَفَعْنَا لَكَ ذِكْرَكَ ﴿٤     ‎",
      "ابوالاعلی مودودی ": "اور تمہاری خاطر تمہارے ذکر کا آوازہ بلند کر دیا",
        "  احمد رضا خان ": "اور ہم نے تمہارے لیے تمہارا ذکر بلند کردیا",
     "احمد علی ": "اور ہم نے آپ کا ذکر بلند کر دیا",
      "  جالندہری ":"اور تمہارا ذکر بلند کیا",
      "  طاہر القادری": "اور ہم نے آپ کی خاطر آپ کا ذکر (اپنے ذکر کے ساتھ ملا کر دنیا و آخرت میں ہر جگہ) بلند فرما دیا،",
      "   علامہ جوادی":  "اور آپ کے ذکر کو بلند کردیا",
      " محمد جوناگڑھی": "اور ہمنے تیرا ذکر بلند کر دیا",
      " محمد حسین نجفی ":"اور آپ(ص) کے ذکر (آوازہ) کو بلند کیا۔",
      "مفتی تقی عثمانی": "اور ہم نے تمہاری خاطر تمہارے تذکرے کو اونچا مقام عطا کردیا ہے "
     },
     {
      "Aya": " ﴾‏فَإِنَّ مَعَ الْعُسْرِ يُسْرًا ﴿٥    ‎‏ ",
      "ابوالاعلی مودودی ": "پس حقیقت یہ ہے کہ تنگی کے ساتھ فراخی بھی ہے",
        "  احمد رضا خان ": "تو بیشک دشواری کے ساتھ آسانی ہے،",
     "احمد علی ": "پس بے شک ہر مشکل کے ساتھ آسانی ہے",
      "  جالندہری ":"ہاں ہاں مشکل کے ساتھ آسانی بھی ہے",
      "  طاہر القادری": "سو بیشک ہر دشواری کے ساتھ آسانی (آتی) ہے،",
      "   علامہ جوادی":  "ہاں زحمت کے ساتھ آسانی بھی ہے",
      " محمد جوناگڑھی": "پس یقیناً مشکل کے ساتھ آسانی ہے",
      " محمد حسین نجفی ":"یقیناً ہر دشواری کے ساتھ آسانی ہے۔",
      "مفتی تقی عثمانی": "چنانچہ حقیقت یہ ہے کہ مشکلات کے ساتھ آسانی بھی ہوتی ہے "
     },
     {
      "Aya":" ﴾‏إِنَّ مَعَ الْعُسْرِ يُسْرًا ﴿٦     ‎‏",
      "ابوالاعلی مودودی ": "بے شک تنگی کے ساتھ فراخی بھی ہے",
        "  احمد رضا خان ": "بیشک دشواری کے ساتھ آسانی ہے",
     "احمد علی ": "بے شک ہر مشکل کے ساتھ آسانی ہے",
      "  جالندہری ":"اور بے شک مشکل کے ساتھ آسانی ہے",
      "  طاہر القادری": "یقیناً (اس) دشواری کے ساتھ آسانی (بھی) ہے،",
      "   علامہ جوادی":  "بے شک تکلیف کے ساتھ سہولت بھی ہے",
      " محمد جوناگڑھی": "بیشک مشکل کے ساتھ آسانی ہے",
      " محمد حسین نجفی ":"بےشک ہر تنگی کے ساتھ فراخی ہے۔",
      "مفتی تقی عثمانی": "یقینا مشکلات کے ساتھ آسانی بھی ہوتی ہے "
     },
     {
      "Aya": " ﴾‏فَإِذَا فَرَغْتَ فَانصَبْ  ﴿٧   ‎‏",
      "ابوالاعلی مودودی ": "لہٰذا جب تم فارغ ہو تو عبادت کی مشقت میں لگ جاؤ",
        "  احمد رضا خان ": "تو جب تم نماز سے فارغ ہو تو دعا میں محنت کرو",
     "احمد علی ": "پس جب آپ (تبلیغ احکام سے) فارغ ہوں تو ریاضت کیجئے",
      "  جالندہری ":"تو جب فارغ ہوا کرو تو (عبادت میں) محنت کیا کرو",
      "  طاہر القادری": "پس جب آپ (تعلیمِ امت، تبلیغ و جہاد اور ادائیگیِ فرائض سے) فارغ ہوں تو (ذکر و عبادت میں) محنت فرمایا کریں،",
      "   علامہ جوادی":  "لہذا جب آپ فارغ ہوجائیں تو نصب کردیں",
      " محمد جوناگڑھی": "پس جب تو فارغ ہو تو عبادت میں محنت کر",
      " محمد حسین نجفی ":"جب (کارِ رسا لت سے) فارغ ہوں تو (عبادت و ریا ضت کرنے میں) محنت کیجئے۔",
      "مفتی تقی عثمانی": "لہذا جب تم فارغ ہوجاؤ تو ( عبادت میں ) اپنے آپ کو تھکاؤ ۔"
     },
     {
      "Aya":" ﴾‏وَإِلَىٰ رَبِّكَ فَارْغَب ﴿٨    ‎‏",
      "ابوالاعلی مودودی ": "اور اپنے رب ہی کی طرف راغب ہو",
        "  احمد رضا خان ": "اور اپنے رب ہی کی طرف رغبت کرو",
     "احمد علی ": "اور اپنے رب کی طرف دل لگائیے",
      "  جالندہری ":"اور اپنے پروردگار کی طرف متوجہ ہو جایا کرو",
      "  طاہر القادری": "اور اپنے رب کی طرف راغب ہو جایا کریں،",
      "   علامہ جوادی":  "اور اپنے رب کی طرف رخ کریں",
      " محمد جوناگڑھی": "اور اپنے پروردگار ہی کی طرف دل لگا",
      " محمد حسین نجفی ":"اور اپنے پروردگار کی طرف رغبت کیجئے۔",
      "مفتی تقی عثمانی": "اور اپنے پروردگار ہی سے دل لگاؤ ۔"
     }
    ]
    