[
   
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ":  "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری":"اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی":  "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی":"شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾١‎﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ",
      "ابوالاعلی مودودی ": "کہو، میں پناہ مانگتا ہوں صبح کے رب کی",
      "  احمد رضا خان ":  "تم فرماؤ میں اس کی پناہ لیتا ہوں جو صبح کا پیدا کرنے والا ہے",
      "احمد علی ": "کہہ دو صبح کے پیدا کرنے والے کی پناہ مانگتا ہوں",
      "  جالندہری ": "کہو کہ میں صبح کے پروردگار کی پناہ مانگتا ہوں",
      "  طاہر القادری": "آپ عرض کیجئے کہ میں (ایک) دھماکے سے انتہائی تیزی کے ساتھ (کائنات کو) وجود میں لانے والے رب کی پناہ مانگتا ہوں،",
      "   علامہ جوادی":  "کہہ دیجئے کہ میں صبح کے مالک کی پناہ چاہتا ہوں",
      " محمد جوناگڑھی": "آپ کہہ دیجئے! کہ میں صبح کے رب کی پناه میں آتا ہوں",
      " محمد حسین نجفی ": "(اے رسول(ص)) آپ(ص) کہہ دیجئے کہ میں پناہ لیتا ہوں صبح کے پروردگار کی۔",
      "مفتی تقی عثمانی": "کہو کہ : میں صبح کے مالک کی پناہ مانگتا ہوں"
     },
     {
      "Aya": "﴾٢‎﴿ مِن شَرِّ مَا خَلَقَ ",
      "ابوالاعلی مودودی ": "ہر اُس چیز کے شر سے جو اُس نے پیدا کی ہے",
      "  احمد رضا خان ":  "اس کی سب مخلوق کی شر سے",
      "احمد علی ": "اس کی مخلوقات کے شر سے",
      "  جالندہری ": "ہر چیز کی بدی سے جو اس نے پیدا کی",
      "  طاہر القادری": "ہر اس چیز کے شر (اور نقصان) سے جو اس نے پیدا فرمائی ہے،",
      "   علامہ جوادی":  "تمام مخلوقات کے شر سے",
      " محمد جوناگڑھی":"ہر اس چیز کے شر سے جو اس نے پیدا کی ہے",
      " محمد حسین نجفی ": "ہر اس چیز کے شر سے جو اس نے پیدا کی ہے۔",
      "مفتی تقی عثمانی": "ہر اس چیز کے شر سے جو اس نے پیدا کی ہے ۔"
     },
     {
      "Aya": "﴾٣‎﴿وَمِن شَرِّ غاسِقٍ إِذا وَقَبَ ",
      "ابوالاعلی مودودی ": "اور رات کی تاریکی کے شر سے جب کہ وہ چھا جائے",
      "  احمد رضا خان ":  "اور اندھیری ڈالنے والے کے شر سے جب وہ ڈوبے",
      "احمد علی ": "اور اندھیری رات کے شر سے جب وہ چھا جائے",
      "  جالندہری ": "اور شب تاریکی کی برائی سے جب اس کااندھیرا چھا جائے",
      "  طاہر القادری": "اور (بالخصوص) اندھیری رات کے شر سے جب (اس کی) ظلمت چھا جائے،",
      "   علامہ جوادی":  "اور اندھیری رات کے شر سے جب اس کا اندھیرا چھا جائے",
      " محمد جوناگڑھی": "اور اندھیری رات کی تاریکی کے شر سے جب اس کا اندھیرا پھیل جائے",
      " محمد حسین نجفی ": "اور رات کی تاریکی کے شر سے جبکہ وہ چھا جائے۔",
      "مفتی تقی عثمانی": "ہر اس چیز کے شر سے جو اس نے پیدا کی ہے ۔"
     },
     {
      "Aya": "﴾٤‎﴿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقد",
      "ابوالاعلی مودودی ": "اور گرہوں میں پھونکنے والوں (یا والیوں) کے شر سے",
      "احمد رضا خان": "اور ان عورتوں کے شر سے جو گرہوں میں پھونکتی ہیں",
      "احمد علی ":  "اورگرہوں میں پھونکنے والیوں کے شر سے",
      "  جالندہری ": "اور گنڈوں پر (پڑھ پڑھ کر) پھونکنے والیوں کی برائی سے",
      "  طاہر القادری": "اور گرہوں میں پھونک مارنے والی جادوگرنیوں (اور جادوگروں) کے شر سے،",
      "   علامہ جوادی":  "اور گنڈوں پر پھونکنے والیوں کے شر سے",
      " محمد جوناگڑھی": "اور گره (لگا کر ان) میں پھونکنے والیوں کے شر سے (بھی)",
      "محمد حسین نجفی ": "اوران کے شر سے جو گِرہوں میں پھونکے مارتی ہیں۔",
      " محمد حسین نجفی ": "اور ان جانوں کے شر سے جو ( گنڈے کی ) گرہوں میں پھونک مارتی ہیں ۔ "
     },
     {
      "Aya": "﴾٥‎﴿ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَد  ",
      "ابوالاعلی مودودی ": "اور حاسد کے شر سے جب کہ وہ حسد کرے",
      "  احمد رضا خان ":  "اور حسد والے کے شر سے جب وہ مجھ سے جلے",
      "احمد علی ": "اور حسد کرنے والے کے شر سے جب وہ حسد کرے",
      "  جالندہری ": "اور حسد کرنے والے کی برائی سے جب حسد کرنے لگے",
      "  طاہر القادری": "اور ہر حسد کرنے والے کے شر سے جب وہ حسد کرے،",
      "   علامہ جوادی":  "اور ہرحسد کرنے والے کے شر سے جب بھی وہ حسد کرے",
      " محمد جوناگڑھی": "اور حسد کرنے والے کی برائی سے بھی جب وه حسد کرے",
      " محمد حسین نجفی ": "اورحاسد کے شر سے جب وہ حسد کرے۔",
      "مفتی تقی عثمانی": "اور حسد کرنے والے کے شر سے جب وہ حسد کرے ۔"
     }
    ]