[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  طاہر القادری":"اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏وَالسَّمَاءِ وَالطَّارِقِ ﴿١‎",
      "ابوالاعلی مودودی ": "قسم ہے آسمان کی اور رات کو نمودار ہونے والے کی",
       "  احمد رضا خان ": "آسمان کی قسم اور رات کے آنے والے کی، ف۲)",
       "احمد علی ": "آسمان کی قسم ہے اور رات کو آنے والے کی",
      "  جالندہری ": "آسمان اور رات کے وقت آنے والے کی قسم",
       "  طاہر القادری":"آسمان (کی فضائے بسیط اور خلائے عظیم) کی قَسم اور رات کو (نظر) آنے والے کی قَسم،",
      "   علامہ جوادی": "آسمان اور رات کو آنے والے کی قسم",
      " محمد جوناگڑھی": "قسم ہے آسمان کی اور اندھیرے میں روشن ہونے والے کی",
      " محمد حسین نجفی ": "قَسم ہے آسمان کی اور رات کو نمودار ہو نے والے کی۔",
      "مفتی تقی عثمانی": "قسم ہے آسمان کی اور رات کو آنے والے کی "
     },
     {
      "Aya": "﴾‏وَمَا أَدْرَاكَ مَا الطَّارِقُ ﴿٢‎‏",
      "ابوالاعلی مودودی ": "اور تم کیا جانو کہ وہ رات کو نمودار ہونے والا کیا ہے؟",
       "  احمد رضا خان ": "اور کچھ تم نے جا نا وه رات کو آنے والا کیا ہے،",
       "احمد علی ": "اور آپ کو کیا معلوم رات کو آنے والا کیا ہے",
      "  جالندہری ": "اور تم کو کیا معلوم کہ رات کے وقت آنے والا کیا ہے",
       "  طاہر القادری":"اور آپ کو کیا معلوم کہ رات کو (نظر) آنے والا کیا ہے،",
      "   علامہ جوادی": "اور تم کیا جانو کہ طارق کیا ہے",
      " محمد جوناگڑھی": "تجھے معلوم بھی ہے کہ وه رات کو نمودار ہونے والی چیز کیا ہے؟",
     " محمد حسین نجفی ": "اورتمہیں کیا معلوم کہ رات کو نمودار ہو نے والا کیا ہے؟",
      "مفتی تقی عثمانی": "اور تمہیں کیا معلوم کہ وہ رات کو آنے والا کیا ہے؟"
     },
     {
      "Aya": "﴾‏النَّجْمُ الثَّاقِبُ ﴿٣‎‏ ",
      "ابوالاعلی مودودی ": "چمکتا ہوا تارا",
       "  احمد رضا خان ": "خوب چمکتا تارا،",
       "احمد علی ": "وہ چمکتا ہوا ستارہ ہے",
      "  جالندہری ": "وہ تارا ہے چمکنے والا",
       "  طاہر القادری":"اس سے مراد ہر وہ آسمانی کرّہ ہے (خواہ وہ ستارہ ہو یا سیارہ یا اَجرامِ سماوی کا کوئی اور کرّہ) جو چمک کر (فضا کو) روشن کر دیتا ہے٭، ٭ النجم الثاقب سے مراد ذاتِ محمد مصطفی صلی اللہ علیہ وآلہ وسلم بھی ہے، جس نے سراجاً منیراً کی شان کے ساتھ آسمانِ رسالت پر چمک کر ظلمت بھری کائنات کو نورِ ایمان سے روشن کر دیا ہے۔ (الشفاء)",
      "   علامہ جوادی": "یہ ایک چمکتا ہوا ستارہ ہے",
      " محمد جوناگڑھی": "وه روشن ستاره ہے",
     " محمد حسین نجفی ": "وہ چمکتا ہوا تاراہے۔",
      "مفتی تقی عثمانی": "چمکتا ہوا ستارا"
     },
     {
      "Aya": "﴾‏إِن كُلُّ نَفْسٍ لَّمَّا عَلَيْهَا حَافِظٌ ﴿٤‎",
      "ابوالاعلی مودودی ": "کوئی جان ایسی نہیں ہے جس کے اوپر کوئی نگہبان نہ ہو",
       "  احمد رضا خان ": "کوئی جان نہیں جس پر نگہبان نہ ہو",
       "احمد علی ": "ایسی کوئی بھی جان نہیں کہ جس پر ایک محافظ مقرر نہ ہو",
      "  جالندہری ": "کہ کوئی متنفس نہیں جس پر نگہبان مقرر نہیں",
       "  طاہر القادری":"کوئی شخص ایسا نہیں جس پر ایک نگہبان (مقرر) نہیں ہے،",
      "   علامہ جوادی": "کوئی نفس ایسا نہیں ہے جس کے اوپر نگراں نہ معین کیا گیا ہو",
      " محمد جوناگڑھی": "کوئی ایسا نہیں جس پر نگہبان فرشتہ نہ ہو",
     " محمد حسین نجفی ": "کوئی متنفس ایسا نہیں ہے جس پرکوئی نگہبان نہ ہو۔",
      "مفتی تقی عثمانی": "کہ کوئی جان ایسی نہیں ہے جس کی کوئی نگرانی کرنے والا موجود نہ ہو ۔"
     },
     {
      "Aya": "﴾‏فَلْيَنظُرِ الْإِنسَانُ مِمَّ خُلِقَ ﴿٥‎",
      "ابوالاعلی مودودی ": "پھر ذرا انسان یہی دیکھ لے کہ وہ کس چیز سے پیدا کیا گیا ہے",
       "  احمد رضا خان ": "تو چاہئے کہ آدمی غور کرے کہ کس چیز سے بنا یا گیا",
       "احمد علی ": "پس انسان کو دیکھنا چاہیے کہ وہ کس چیز سے پیدا کیا گیا ہے",
      "  جالندہری ": "تو انسان کو دیکھنا چاہئے کہ وہ کاہے سے پیدا ہوا ہے",
       "  طاہر القادری":"پس انسان کو غور (و تحقیق) کرنا چاہیے کہ وہ کس چیز سے پیدا کیا گیا ہے،",
      "   علامہ جوادی": "پھر انسان دیکھے کہ اسے کس چیز سے پیدا کیا گیا ہے",
      " محمد جوناگڑھی": "انسان کو دیکھنا چاہئے کہ وه کس چیز سے پیدا کیا گیا ہے",
     " محمد حسین نجفی ": "سو انسان کو دیکھنا چاہیے کہ وہ کس چیز سے پیدا کیا گیا ہے؟",
      "مفتی تقی عثمانی": "اب انسان کو یہ دیکھنا چاہیے کہ اسے کس چیز سے پیدا کیا گیا ہے ؟"
     },
     {
      "Aya": "﴾‏خُلِقَ مِن مَّاءٍ دَافِقٍ ﴿٦‎‏",
      "ابوالاعلی مودودی ": "ایک اچھلنے والے پانی سے پیدا کیا گیا ہے",
       "  احمد رضا خان ": "جَست کرتے (اوچھلتے ہوئے) پانی سے، ف۵)",
       "احمد علی ": "ایک اچھلتے ہوئے پانی سے پیدا کیا گیا ہے",
      "  جالندہری ": "وہ اچھلتے ہوئے پانی سے پیدا ہوا ہے",
       "  طاہر القادری":"وہ قوت سے اچھلنے والے پانی (یعنی قوی اور متحرک مادۂ تولید) میں سے پیدا کیا گیا ہے،",
      "   علامہ جوادی": "وہ ایک اُچھلتے ہوئے پانی سے پیدا کیا گیا ہے",
      " محمد جوناگڑھی": "وه ایک اچھلتے پانی سے پیدا کیا گیا ہے",
     " محمد حسین نجفی ": "اچھل کر نکلنے والے پانی سے پیدا کیا گیا ہے۔",
      "مفتی تقی عثمانی": "اسے ایک اچھلتے ہوئے پانی سے پیدا کیا گیا ہے ۔"
     },
     {
      "Aya": "﴾‏يَخْرُجُ مِن بَيْنِ الصُّلْبِ وَالتَّرَائِبِ ﴿٧‎",
      "ابوالاعلی مودودی ": "جو پیٹھ اور سینے کی ہڈیوں کے درمیان سے نکلتا ہے",
       "  احمد رضا خان ": "جو نکلتا ہے پیٹھ اور سینوں کے بیچ سے",
       "احمد علی ": "جو پیٹھ اور سینے کی ہڈیوں کے درمیان سے نکلتا ہے",
      "  جالندہری ": "جو پیٹھ اور سینے کے بیچ میں سے نکلتا ہے",
       "  طاہر القادری":"جو پیٹھ اور کولہے کی ہڈیوں کے درمیان (پیڑو کے حلقہ میں) سے گزر کر باہر نکلتا ہے،",
      "   علامہ جوادی": "جو پیٹھ اور سینہ کی ہڈیوں کے درمیان سے نکلتا ہے",
      " محمد جوناگڑھی": "جو پیٹھ اور سینے کے درمیان سے نکلتا ہے",
     " محمد حسین نجفی ": "جو ریڑھ اور سینے کی ہڈیوں کے درمیان سے نکلتا ہے۔",
      "مفتی تقی عثمانی": "جو پیٹھ اور سینے کی ہڈیوں کے درمیان سے نکلتا ہے "
     },
     {
      "Aya": "﴾‏إِنَّهُ عَلَىٰ رَجْعِهِ لَقَادِرٌ ﴿٨‎",
      "ابوالاعلی مودودی ": "یقیناً وہ (خالق) اُسے دوبارہ پیدا کرنے پر قادر ہے",
       "  احمد رضا خان ": "بے شک اللہ اس کے واپس کرینے پر قادر ہے",
       "احمد علی ": "بے شک وہ اس کے لوٹانے پر قادر ہے",
      "  جالندہری ": "بےشک خدا اس کے اعادے (یعنی پھر پیدا کرنے) پر قادر ہے",
       "  طاہر القادری":"بیشک وہ اس (زندگی) کو پھر واپس لانے پر بھی قادر ہے،",
      "   علامہ جوادی": "یقینا وہ خدا انسان کے دوبارہ پیدا کرنے پر بھی قادر ہے",
      " محمد جوناگڑھی": "بیشک وه اسے پھیر ﻻنے پر یقیناً قدرت رکھنے واﻻ ہے",
     " محمد حسین نجفی ": "بےشک وہ (خدا) اس کے لوٹا سکنے (دوبارہ پیدا کرنے) پر قادر ہے۔",
      "مفتی تقی عثمانی": "بیشک وہ اسے دوبارہ پیدا کرنے پر پوری طرح قادر ہے"
     },
     {
      "Aya": "﴾‏يَوْمَ تُبْلَى السَّرَائِرُ ﴿٩‏",
      "ابوالاعلی مودودی ": "جس روز پوشیدہ اسرار کی جانچ پڑتال ہوگی",
       "  احمد رضا خان ": "جس دن چھپی باتوں کی جانچ ہوگی",
       "احمد علی ": "جس دن بھید ظاہر کیے جائیں گے",
      "  جالندہری ": "جس دن دلوں کے بھید جانچے جائیں گے",
       "  طاہر القادری":"جس دن سب راز ظاہر کر دیے جائیں گے،",
      "   علامہ جوادی": "جس دن رازوں کو آزمایا جائے گا",
      " محمد جوناگڑھی": "جس دن پوشیده بھیدوں کی جانچ پڑتال ہوگی",
     " محمد حسین نجفی ": "جس دن سب پوشیدہ راز کھل جائیں گے۔",
      "مفتی تقی عثمانی": "جس دن تمام پوشیدہ باتوں کی جانچ ہوگی "
     },
     {
      "Aya": "﴾‏فَمَا لَهُ مِن قُوَّةٍ وَلَا نَاصِرٍ ﴿١٠‎",
      "ابوالاعلی مودودی ": "اُس وقت انسان کے پاس نہ خود اپنا کوئی زور ہوگا اور نہ کوئی اس کی مدد کرنے والا ہوگا",
       "  احمد رضا خان ": "تو آدمی کے پاس نہ کچھ زور ہوگا نہ کوئی مددگار",
       "احمد علی ": "تو اس کے لیے نہ کوئی طاقت ہو گی اور نہ کوئی مددگار",
      "  جالندہری ": "تو انسان کی کچھ پیش نہ چل سکے گی اور نہ کوئی اس کا مددگار ہو گا",
       "  طاہر القادری":"پھر انسان کے پاس نہ (خود) کوئی قوت ہوگی اور نہ کوئی (اس کا) مددگار ہوگا،",
      "   علامہ جوادی": "تو پھر نہ کسی کے پاس قوت ہوگی اور نہ مددگار",
      " محمد جوناگڑھی": "تو نہ ہوگا اس کے پاس کچھ زور نہ مدددگار",
     " محمد حسین نجفی ": "پس اس وقت نہ خود انسان کے پاس کوئی طاقت ہوگی اور نہ کوئی مددگار ہوگا۔",
      "مفتی تقی عثمانی": "تو انسان کے پاس نہ اپنا کوئی زور ہوگا نہ کوئی مددگار ۔"
     },
     {
      "Aya": "﴾‏وَالسَّمَاءِ ذَاتِ الرَّجْعِ ﴿١١‎‏",
      "ابوالاعلی مودودی ": "قسم ہے بارش برسانے والے آسمان کی",
       "  احمد رضا خان ": "آسمان کی قسم! جس سے مینھ اترتا ہے",
       "احمد علی ": "آسمان اور بارش والے کی قسم ہے",
      "  جالندہری ": "آسمان کی قسم جو مینہ برساتا ہے",
       "  طاہر القادری":"اس آسمانی کائنات کی قَسم جو پھر اپنی ابتدائی حالت میں پلٹ جانے والی ہے،",
      "   علامہ جوادی": "قسم ہے چکر کھانے والے آسمان کی",
      " محمد جوناگڑھی": "بارش والے آسمان کی قسم!",
     " محمد حسین نجفی ": "قَسم ہے بارش والے آسمان کی۔",
      "مفتی تقی عثمانی": "قسم ہے بارش بھرے آسمان کی ۔"
     },
     {
      "Aya": "﴾‏وَالْأَرْضِ ذَاتِ الصَّدْعِ ﴿١٢‎‏ ",
      "ابوالاعلی مودودی ": "اور (نباتات اگتے وقت) پھٹ جانے والی زمین کی",
       "  احمد رضا خان ": "اور زمین کی جو اس سے کھلتی ہے",
       "احمد علی ": "اور زمین کی جو پھٹ جاتی ہے",
      "  جالندہری ": "اور زمین کی قسم جو پھٹ جاتی ہے",
       "  طاہر القادری":"اس زمین کی قَسم جو پھٹ (کر ریزہ ریزہ ہو) جانے والی ہے،",
      "   علامہ جوادی": "اور شگافتہ ہونے والی زمین کی",
      " محمد جوناگڑھی": "اور پھٹنے والی زمین کی قسم!",
     " محمد حسین نجفی ": "اور (نباتات کے ذریعہ سے) پھٹ جانے والی زمین کی۔",
      "مفتی تقی عثمانی": "اور پھوٹ پڑنے والی زمین کی "
     },
     {
      "Aya": "﴾‏إِنَّهُ لَقَوْلٌ فَصْلٌ ﴿١٣‎",
      "ابوالاعلی مودودی ": "یہ ایک جچی تلی بات ہے",
       "  احمد رضا خان ": "بیشک قرآن ضرور فیصلہ کی بات ہے",
       "احمد علی ": "بے شک قرآن قطعی بات ہے",
      "  جالندہری ": "کہ یہ کلام (حق کو باطل سے) جدا کرنے والا ہے",
       "  طاہر القادری":"بیشک یہ فیصلہ کن (قطعی) فرمان ہے،",
      "   علامہ جوادی": "بے شک یہ قول فیصل ہے",
      " محمد جوناگڑھی": "بیشک یہ (قرآن) البتہ دو ٹوک فیصلہ کرنے واﻻ کلام ہے",
     " محمد حسین نجفی ": "کہ وہ (قرآن) قولِ فیصل ہے۔",
      "مفتی تقی عثمانی": "کہ یہ ( قرآن ) ایک فیصلہ کن بات ہے ۔"
     },
     {
      "Aya": "﴾‏وَمَا هُوَ بِالْهَزْلِ ﴿١٤‎",
      "ابوالاعلی مودودی ": "ہنسی مذاق نہیں ہے",
       "  احمد رضا خان ": "اور کوئی ہنسی کی بات نہیں",
       "احمد علی ": "اوروہ ہنسی کی بات نہیں ہے",
      "  جالندہری ": "اور بیہودہ بات نہیں ہے",
       "  طاہر القادری":"اور یہ ہنسی کی بات نہیں ہے،",
      "   علامہ جوادی": "اور مذاق نہیں ہے",
      " محمد جوناگڑھی": "یہ ہنسی کی (اور بے فائده) بات نہیں",
     " محمد حسین نجفی ": "کوئی ہنسی مذاق نہیں ہے۔",
      "مفتی تقی عثمانی": "اور یہ کوئی مذاق نہیں ہے ۔"
     },
     {
      "Aya": "﴾‏إِنَّهُمْ يَكِيدُونَ كَيْدًا ﴿١٥‎",
      "ابوالاعلی مودودی ": "یہ لوگ چالیں چل رہے ہیں",
       "  احمد رضا خان ": "بیشک کافر اپنا سا داؤ چلتے ہیں",
       "احمد علی ": "بے شک وہ ایک تدبیر کر رہے ہیں",
      "  جالندہری ": "یہ لوگ تو اپنی تدبیروں میں لگ رہے ہیں",
       "  طاہر القادری":"بیشک وہ (کافر) پُر فریب تدبیروں میں لگے ہوئے ہیں،",
      "   علامہ جوادی": "یہ لوگ اپنا مکر کررہے ہیں",
      " محمد جوناگڑھی": "البتہ کافر داؤ گھات میں ہیں",
     " محمد حسین نجفی ": "بےشک وہ (کافر لوگ) کچھ چالیں چل رہے ہیں۔",
      "مفتی تقی عثمانی": "بیشک یہ ( کافر لوگ ) چالیں چل رہے ہیں ۔"
     },
     {
      "Aya": "﴾‏وَأَكِيدُ كَيْدًا ﴿١٦‎",
      "ابوالاعلی مودودی ": "اور میں بھی ایک چال چل رہا ہوں",
       "  احمد رضا خان ": "اور میں اپنی خفیہ تدبیر فرماتا ہوں",
       "احمد علی ": "اور میں بھی ایک تدبیر کر رہا ہوں",
      "  جالندہری ": "اور ہم اپنی تدبیر کر رہے ہیں",
       "  طاہر القادری":"اور میں اپنی تدبیر فرما رہا ہوں",
      "   علامہ جوادی": "اور ہم اپنی تدبیر کررہے ہیں",
      " محمد جوناگڑھی": "اور میں بھی ایک چال چل رہا ہوں",
     " محمد حسین نجفی ": "اور میں بھی (ان کیخلاف) ایک چال چل رہا ہوں۔",
      "مفتی تقی عثمانی": "اور میں بھی اپنی چال چل رہا ہوں ۔"
     },
     {
      "Aya": "﴾‏فَمَهِّلِ الْكَافِرِينَ أَمْهِلْهُمْ رُوَيْدًا ﴿١٧‎‏",
      "ابوالاعلی مودودی ": "پس چھوڑ دو اے نبیؐ، اِن کافروں کو اک ذرا کی ذرا اِن کے حال پر چھوڑ دو",
       "  احمد رضا خان ": "تو تم کافروں کو ڈھیل دو انہیں کچھ تھوڑی مہلت دو",
       "احمد علی ": "پس کافرو ں کو تھوڑے دنوں کی مہلت دے دو",
      "  جالندہری ": "تو تم کافروں کو مہلت دو بس چند روز ہی مہلت دو",
       "  طاہر القادری":"پس آپ کافروں کو (ذرا) مہلت دے دیجئے، (زیادہ نہیں بس) انہیں تھوڑی سی ڈھیل (اور) دے دیجئے،",
      "   علامہ جوادی": "تو کافروں کو چھوڑ دو اور انہیں تھوڑی سی مہلت دے دو",
      " محمد جوناگڑھی": "تو کافروں کو مہلت دے انہیں تھوڑے دنوں چھوڑ دے",
     " محمد حسین نجفی ": "تو (اے رسول(ص)) ان (کافروں) کو مہلت دے دیجئے ان کو تھوڑی سی مہلت دے دیجئے۔",
      "مفتی تقی عثمانی": "لہذا ( اے پیغمبر ) تم ان کافروں کو ڈھیل دو ، انہیں تھوڑے دنوں اپنے حال پر چھوڑ دو "
     }
    ]
   