[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
     "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
       "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
       "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
      "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾‏لِإِيلَافِ قُرَيْشٍ ﴿١",
     "ابوالاعلی مودودی ": "چونکہ قریش مانوس ہوئے",
       "  احمد رضا خان ": "اس لیے کہ قریش کو میل دلایا",
      "احمد علی ": "اس لیے کہ قریش کو مانوس کر دیا",
      "  جالندہری ": "قریش کے مانوس کرنے کے سبب",
       "  طاہر القادری": "ریش کو رغبت دلانے کے سبب سے،",
      "   علامہ جوادی": "قریش کے انس و الفت کی خاطر",
      " محمد جوناگڑھی": "قریش کے مانوس کرنے کے لئے",
      " محمد حسین نجفی ": "چونکہ (اللہ نے) قریش کو مانوس کر دیا۔",
      "مفتی تقی عثمانی": "چونکہ قریش کے لوگ عادی ہیں ۔"
     },
     {
      "Aya": " ﴾‏إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ ﴿٢",
     "ابوالاعلی مودودی ": " جاڑے اور گرمی کے سفروں سے مانوس (یعنی) ",
       "  احمد رضا خان ": "اس لیے کہ قریش کو میل دلایا",
      "احمد علی ": "ان کو جاڑے اور گرمی کے سفر سے مانوس کرنے کے باعث",
      "  جالندہری ": " ان کو جاڑے اور گرمی کے سفر سے مانوس کرنے کے سبب",
       "  طاہر القادری": "انہیں سردیوں اور گرمیوں کے (تجارتی) سفر سے مانوس کر دیا،",
      "   علامہ جوادی": "جو انہیں سردی اور گرمی کے سفرسے ہے ابرہہ کو ہلاک کردیا ہے",
      " محمد جوناگڑھی": " انہیں جاڑے اور گرمی کے سفر سے مانوس کرنے کے لئے۔ (اس کے شکریہ میں)",
      " محمد حسین نجفی ": "یعنی جاڑے اور گرمی کے تجارتی سفر سے مانوس کر دیا ہے۔",
      "مفتی تقی عثمانی": "عنی وہ سردی اور گرمی کے موسموں میں ( یمن اور شام کے ) سفر کرنے کے عادی ہیں "
     },
     {
      "Aya": " ﴾فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ ﴿٣",
     "ابوالاعلی مودودی ": "لہٰذا اُن کو چاہیے کہ اِس گھر کے رب کی عبادت کریں",
       "  احمد رضا خان ": "تو انہیں چاہیے اس گھر کے رب کی بندگی کریں،",
      "احمد علی ": "ان کو اس گھرکے مالک کی عبادت کرنی چاہیئے",
      "  جالندہری ": "لوگوں کو چاہیئے کہ (اس نعمت کے شکر میں) اس گھر کے مالک کی عبادت کریں",
       "  طاہر القادری": "پس انہیں چاہئے کہ اس گھر (خانہ کعبہ) کے رب کی عبادت کریں (تاکہ اس کی شکر گزاری ہو)،",
      "   علامہ جوادی": "لہذا انہیں چاہئے کہ اس گھر کے مالک کی عبادت کریں",
      " محمد جوناگڑھی": "پس انہیں چاہئے کہ اسی گھر کے رب کی عبادت کرتے رہیں",
      " محمد حسین نجفی ": "تو ان کو چاہیے کہ اس گھر (خانۂ کعبہ) کے پروردگار کی عبادت کریں۔",
      "مفتی تقی عثمانی": "اس لیے انہیں چاہیے کہ وہ اس گھر کے مالک کی عبادت کریں "
     },
     {
      "Aya": " ﴾‏لَّذِي أَطْعَمَهُم مِّن جُوعٍ وَآمَنَهُم مِّنْ خَوْفٍ ﴿٤",
     "ابوالاعلی مودودی ": "جس نے اُنہیں بھوک سے بچا کر کھانے کو دیا اور خوف سے بچا کر امن عطا کیا",
       "  احمد رضا خان ": "جس نے انہیں بھوک میں کھانا دیا، اور انہیں ایک بڑے خوف سے امان بخشا",
      "احمد علی ": "جس نے ان کو بھوک میں کھلایا اور ان کو خوف سے امن دیا",
      "  جالندہری ": "جس نے ان کو بھوک میں کھانا کھلایا اور خوف سے امن بخشا",
       "  طاہر القادری": "جس نے انہیں بھوک (یعنی فقر و فاقہ کے حالات) میں کھانا دیا (یعنی رِزق فراہم کیا) اور (دشمنوں کے) خوف سے امن بخشا (یعنی محفوظ و مامون زندگی سے نوازا)،",
      "   علامہ جوادی": "جس نے انہیں بھوک میں سیر کیا ہے اور خوف سے محفوظ بنایا ہے",
      " محمد جوناگڑھی": "جس نے انہیں بھوک میں کھانا دیا اور ڈر (اور خوف) میں امن (وامان) دیا",
      " محمد حسین نجفی ": "جس نے ان کو بھوک میں کھانے کو دیا اور خوف میں امن عطا کیا۔",
      "مفتی تقی عثمانی": "جس نے بھوک کی حالت میں انہیں کھانے کو دیا ، اور بدامنی سے انہیں محفوظ رکھا "
     }
    ]
   