[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
       "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
       "   علامہ جوادی":  "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
      " محمد جوناگڑھی":"شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
     " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
      "مفتی تقی عثمانی":"شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": " ﴾أَلْهَاكُمُ التَّكَاثُرُ ﴿١‎",
      "ابوالاعلی مودودی ": "تم لوگوں کو زیادہ سے زیادہ اور ایک دوسرے سے بڑھ کر دنیا حاصل کرنے کی دھن نے غفلت میں ڈال رکھا ہے",
      "  احمد رضا خان ": "تمہیں غافل رکھا مال کی زیادہ طلبی نے",
       "احمد علی ": "تمہیں حرص نے غافل کر دیا",
      "  جالندہری ": " تم کو (مال کی) بہت سی طلب نے غافل کر دیا",
      "  طاہر القادری": "تمہیں کثرتِ مال کی ہوس اور فخر نے (آخرت سے) غافل کر دیا،",
       "   علامہ جوادی":  "تمہیں باہمی مقابلہ کثرت مال و اولاد نے غافل بنادیا",
      " محمد جوناگڑھی":"زیادتی کی چاہت نے تمہیں غافل کردیا",
     " محمد حسین نجفی ": "تمہیں کثرت (مال و اولاد) کی مسابقت نے غفلت میں رکھا۔",
      "مفتی تقی عثمانی":"ایک دوسرے سے بڑھ چڑھ کر ( دنیا کا عیش ) حاصل کرنے کی ہوس نے تمہیں غلفت میں ڈال رکھا ہے"
     },
     {
      "Aya": " ﴾حَتَّىٰ زُرْتُمُ الْمَقَابِرَ ﴿٢‎",
      "ابوالاعلی مودودی ": "یہاں تک کہ (اسی فکر میں) تم لب گور تک پہنچ جاتے ہو",
      "  احمد رضا خان ": "یہاں تک کہ تم نے قبروں کا منہ دیکھا",
       "احمد علی ": "یہاں تک کہ قبریں جا دیکھیں",
      "  جالندہری ": "یہاں تک کہ تم نے قبریں جا دیکھیں",
      "  طاہر القادری": "یہاں تک کہ تم قبروں میں جا پہنچے،",
       "   علامہ جوادی":  "یہاں تک کہ تم نے قبروں سے ملاقات کرلی",
      " محمد جوناگڑھی":"یہاں تک کہ تم قبرستان جا پہنچے",
     " محمد حسین نجفی ": "یہاں تک کہ تم قبروں میں جا پہنچے۔",
      "مفتی تقی عثمانی":"یہاں تک کہ تم قبرستانوں میں پہنچ جاتے ہو ۔"
     },
     {
      "Aya": " ﴾كَلَّا سَوْفَ تَعْلَمُونَ﴿٣",
      "ابوالاعلی مودودی ": "ہرگز نہیں، عنقریب تم کو معلوم ہو جائے گا",
      "  احمد رضا خان ": "ہاں ہاں جلد جان جاؤ گے",
       "احمد علی ": "ایسا نہیں آئندہ تم جان لو گے",
      "  جالندہری ": "دیکھو تمہیں عنقریب معلوم ہو جائے گا",
      "  طاہر القادری": "ہرگز نہیں! (مال و دولت تمہارے کام نہیں آئیں گے) تم عنقریب (اس حقیقت کو) جان لو گے،",
       "   علامہ جوادی":  "دیکھو تمہیں عنقریب معلوم ہوجائے گا",
      " محمد جوناگڑھی":"ہرگز نہیں تم عنقریب معلوم کر لو گے",
     " محمد حسین نجفی ": "ہرگز نہیں! عنقریب تمہیں معلوم ہو جائے گا۔",
      "مفتی تقی عثمانی":"ہرگز ایسا نہیں چاہیے ۔ تمہیں عنقریب سب پتہ چل جائے گا ۔"
     },
     {
      "Aya": " ﴾ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ ﴿٤‎",
      "ابوالاعلی مودودی ": "پھر (سن لو کہ) ہرگز نہیں، عنقریب تم کو معلوم ہو جائے گا",
      "  احمد رضا خان ": "پھر ہاں ہاں جلد جان جاؤ گے",
       "احمد علی ": "پھر ایسا نہیں چاہیئے آئندہ تم جان لو گے",
      "  جالندہری ": "پھر دیکھو تمہیں عنقریب معلوم ہو جائے گا",
      "  طاہر القادری": "پھر (آگاہ کیا جاتا ہے:) ہرگز نہیں! عنقریب تمہیں (اپنا انجام) معلوم ہو جائے گا،",
       "   علامہ جوادی":  "اور پھر خوب معلوم ہوجائے گا",
      " محمد جوناگڑھی":"ہرگز نہیں پھر تمہیں جلد علم ہو جائے گا",
     " محمد حسین نجفی ": "پھر ہرگز نہیں! عنقریب تمہیں معلوم ہو جائے گا۔",
      "مفتی تقی عثمانی":"پھر ( سن لو کہ ) ہرگز ایسا نہیں چاہیے ۔ تمہیں عنقریب سب پتہ چل جائے گا "
     },
     {
      "Aya": " ﴾‏كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ ﴿٥‎‏",
      "ابوالاعلی مودودی ": "ہرگز نہیں، اگر تم یقینی علم کی حیثیت سے (اِس روش کے انجام کو) جانتے ہوتے (تو تمہارا یہ طرز عمل نہ ہوتا)",
      "  احمد رضا خان ": "ہاں ہاں اگر یقین کا جاننا جانتے تو مال کی محبت نہ رکھتے",
       "احمد علی ": "ایسا نہیں چاہیئے کاش تم یقینی طور پر جانتے",
      "  جالندہری ": "دیکھو اگر تم جانتے (یعنی) علم الیقین (رکھتے تو غفلت نہ کرتے)",
      "  طاہر القادری": "ہاں ہاں! کاش تم (مال و زَر کی ہوس اور اپنی غفلت کے انجام کو) یقینی علم کے ساتھ جانتے (تو دنیا میں کھو کر آخرت کو اس طرح نہ بھولتے)،",
       "   علامہ جوادی":  "دیکھو اگر تمہیں یقینی علم ہوجاتا",
      " محمد جوناگڑھی":"ہرگز نہیں اگر تم یقینی طور پر جان لو",
     " محمد حسین نجفی ": "ہرگز نہیں! اگر تم یقینی طور پر (اس روش کے انجام کو) جانتے (تو ہرگز ایسا نہ کرتے)۔",
      "مفتی تقی عثمانی":"ہرگز نہیں ! اگر تم یقینی علم کے ساتھ یہ بات جانتے ہوتے ( تو ایسا نہ کرتے )"
     },
     {
      "Aya": " ﴾لَتَرَوُنَّ الْجَحِيمَ ﴿٦‎",
      "ابوالاعلی مودودی ": "تم دوزخ دیکھ کر رہو گے",
      "  احمد رضا خان ": "بیشک ضرور جنہم کو دیکھو گے",
       "احمد علی ": "البتہ تم ضرور دوزخ کو دیکھو گے",
      "  جالندہری ": "تم ضرور دوزخ کو دیکھو گے",
      "  طاہر القادری": "تم (اپنی حرص کے نتیجے میں) دوزخ کو ضرور دیکھ کر رہو گے،",
       "   علامہ جوادی":  "کہ تم جہنمّ کو ضرور دیکھو گے",
      " محمد جوناگڑھی":"تو بیشک تم جہنم دیکھ لو گے",
     " محمد حسین نجفی ": "تم ضرور دوزخ کو دیکھو گے۔",
      "مفتی تقی عثمانی":"یقین جانو تم دوزخ کو ضرور دیکھو گے ۔"
     },
     {
      "Aya": " ﴾ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ ﴿٧",
      "ابوالاعلی مودودی ": "پھر (سن لو کہ) تم بالکل یقین کے ساتھ اُسے دیکھ لو گے",
      "  احمد رضا خان ": "پھر بیشک ضرور اسے یقینی دیکھنا دیکھو گے،",
       "احمد علی ": "پھر تم اسے ضرور بالکل یقینی طور پر دیکھو گے",
      "  جالندہری ": "پھر اس کو (ایسا) دیکھو گے (کہ) عین الیقین (آ جائے گا)",
      "  طاہر القادری": "پھر تم اسے ضرور یقین کی آنکھ سے دیکھ لو گے،",
       "   علامہ جوادی":  "پھر اسے اپنی آنکھوں دیکھے یقین کی طرح دیکھو گے",
      " محمد جوناگڑھی":"اور تم اسے یقین کی آنکھ سے دیکھ لو گے",
     " محمد حسین نجفی ": "پھر تم لوگ (آخرت میں) ضرور یقین کی آنکھ سے اسے (یقینی دیکھنا) دیکھو گے۔",
      "مفتی تقی عثمانی":"پھر یقین جانو کہ تم اسے بالکل یقین کے ساتھ دیکھ لو گے ۔"
     },
     {
      "Aya": " ﴾‏ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ ﴿٨‏",
      "ابوالاعلی مودودی ": "پھر ضرور اُس روز تم سے اِن نعمتوں کے بارے میں جواب طلبی کی جائے گی",
      "  احمد رضا خان ": "پھر بیشک ضرور اس دن تم سے نعمتوں کی پرسش ہوگی",
       "احمد علی ": "پھر اس دن تم سے نعمتوں کے متعلق پوچھا جائے گا",
      "  جالندہری ": "پھر اس روز تم سے (شکر) نعمت کے بارے میں پرسش ہو گی",
      "  طاہر القادری": "پھر اس دن تم سے (اﷲ کی) نعمتوں کے بارے میں ضرور پوچھا جائے گا (کہ تم نے انہیں کہاں کہاں اور کیسے کیسے خرچ کیا تھا)،",
       "   علامہ جوادی":  "اور پھر تم سے اس دن نعمت کے بارے میں سوال کیا جائے گا",
      " محمد جوناگڑھی":"پھر اس دن تم سے ضرور بالضرور نعمتوں کا سوال ہوگا",
     " محمد حسین نجفی ": "پھر اس دن تم سے نعمتوں کے بارے میں ضرور بازپُرس کی جائے گی۔",
      "مفتی تقی عثمانی":"پھر تم سے اس دن نعمتوں کے بارے میں پوچھا جائے گا ( کہ ان کا کیا حق ادا کیا ) "
     }
    ]
    