[
     {
      "Aya": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
       "ابوالاعلی مودودی ": "اللہ کے نام سے جو رحمان و رحیم ہے",
      "  احمد رضا خان ": "اللہ کے نام سے شروع جو بہت مہربان رحمت والا",
      "احمد علی ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
     "  جالندہری ": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
      "  طاہر القادری": "اللہ کے نام سےشروع جو نہایت مہربان ہمیشہ رحم فرمانےوالا ہے ",
     "   علامہ جوادی": "عظیم اور دائمی رحمتوں والے خدا کے نام سے",
       " محمد جوناگڑھی": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      " محمد حسین نجفی ": "(شروع کرتا ہوں) اللہ کے نام سے جو بڑا مہربان نہایت رحم والا ہے۔",
     "مفتی تقی عثمانی": "شروع اللہ کے نام سے جو سب پر مہربان ہے ، بہت مہربان ہے"
     },
     {
      "Aya": "﴾١‎﴿ قُلْ يَا أَيُّهَا الْكَافِرُونَ",
       "ابوالاعلی مودودی ": "کہہ دو کہ اے کافرو",
      "  احمد رضا خان ": "تم فرماؤ اے کافرو،",
      "احمد علی ": "کہہ دو اے کافرو",
     "  جالندہری ": "    اے پیغمبر ان منکران اسلام سے  کہہ دو کہ اے کافرو!",
      "  طاہر القادری": "آپ فرما دیجئے: اے کافرو!،",
     "   علامہ جوادی": "آپ کہہ دیجئے کہ اے کافرو",
       " محمد جوناگڑھی": "آپ کہہ دیجئے کہ اے کافرو!",
     " محمد حسین نجفی ": " آپ(ص) کہہ دیجئے اے کافرو۔",
     "مفتی تقی عثمانی": "تم کہہ دو کہ : اے حق کا انکار کرنے والو ۔"
     },
     {
      "Aya": "﴾٢‎﴿ لَا أَعْبُدُ مَا تَعْبُدُونَ ",
       "ابوالاعلی مودودی ": "میں اُن کی عبادت نہیں کرتا جن کی عبادت تم کرتے ہو",
      "  احمد رضا خان ": "نہ میں پوجتا ہوں جو تم پوجتے ہو،",
      "احمد علی ": "نہ تومیں تمہارے معبودوں کی عبادت کرتا ہوں",
     "  جالندہری ": "جن (بتوں) کو تم پوچتے ہو ان کو میں نہیں پوجتا",
      "  طاہر القادری": "میں ان (بتوں) کی عبادت نہیں کرتا جنہیں تم پوجتے ہو،",
     "   علامہ جوادی": "میں ان خداؤں کی عبادت نہیں کرسکتا جن کی تم پوجا کرتے ہو",
       " محمد جوناگڑھی": "نہ میں عبادت کرتا ہوں اس کی جس کی تم عبادت کرتے ہو",
     " محمد حسین نجفی ": "میں ان (بتوں) کی عبادت نہیں کرتا جن کی تم عبادت کرتے ہو۔",
     "مفتی تقی عثمانی": "میں ان چیزوں کی عبادت نہیں کرتا جن کی تم عبادت کرتے ہو ۔"
     },
     {
      "Aya": "﴾٣‎﴿ وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ ",
       "ابوالاعلی مودودی ": "اور نہ تم اُس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں",
      "  احمد رضا خان ": "اور نہ تم پوجتے ہو جو میں پوجتا ہوں،",
      "احمد علی ": "اور نہ تم ہی میرے معبود کی عبادت کرتے ہو",
     "  جالندہری ": "اور جس (خدا) کی میں عبادت کرتا ہوں اس کی تم عبادت نہیں کرتے",
      "  طاہر القادری": "اور نہ تم اس (رب) کی عبادت کرنے والے ہو جس کی میں عبادت کرتا ہوں،",
     "   علامہ جوادی": "اور نہ تم میرے خدا کی عبادت کرنے والے ہو",
       " محمد جوناگڑھی": "نہ تم عبادت کرنے والے ہو اس کی جس کی میں عبادت کرتا ہوں",
     " محمد حسین نجفی ": "اور نہ تم اس (اللہ) کی عبادت کرنے والے ہو جس کی میں عبادت کرتا ہوں۔",
     "مفتی تقی عثمانی": "اور تم اس کی عبادت نہیں کرتے جس کی میں عبادت کرتا ہوں ۔"
     },
     {
      "Aya": "﴾٤‎﴿ وَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ ",
       "ابوالاعلی مودودی ": "اور نہ میں اُن کی عبادت کرنے والا ہوں جن کی عبادت تم نے کی ہے",
      "  احمد رضا خان ": "اور نہ میں پوجوں گا جو تم نے پوجا،",
      "احمد علی ": "اور نہ میں تمہارے معبودوں کی عبادت کروں گا",
     "  جالندہری ": "اور (میں پھر کہتا ہوں کہ) جن کی تم پرستش کرتے ہوں ان کی میں پرستش کرنے والا نہیں ہوں",
      "  طاہر القادری": "اور نہ (ہی) میں (آئندہ کبھی) ان کی عبادت کرنے والا ہوں جن (بتوں) کی تم پرستش کرتے ہو،",
     "   علامہ جوادی": "اور نہ میں تمہارے معبودوں کو پوجا کرنے ولا ہوں",
       " محمد جوناگڑھی": "اور نہ میں عبادت کروں گا جس کی تم عبادت کرتے ہو",
     " محمد حسین نجفی ": "اور نہ میں ان (بتوں) کی عبادت کرنے والا ہوں جن کی تم عبادت کرتے ہو۔",
     "مفتی تقی عثمانی": "اور نہ میں ( آئندہ ) اس کی عبادت کرنے والا ہوں جس کی عبادت تم کرتے ہو ۔"
     },
     {
      "Aya": "﴾٥‎﴿ وَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ ",
       "ابوالاعلی مودودی ": "اور نہ تم اُس کی عبادت کرنے والے ہو جس کی عبادت میں کرتا ہوں",
      "  احمد رضا خان ": "اور نہ تم پوجو گے جو میں پوجتا ہوں،",
      "احمد علی ": "اور نہ تم میرے معبود کی عبادت کرو گے",
     "  جالندہری ": "اور نہ تم اس کی بندگی کرنے والے (معلوم ہوتے) ہو جس کی میں بندگی کرتا ہوں",
      "  طاہر القادری": "اور نہ (ہی) تم اس کی عبادت کرنے والے ہو جس (رب) کی میں عبادت کرتا ہوں،",
     "   علامہ جوادی": "اور نہ تم میرے معبود کے عبادت گزار ہو",
       " محمد جوناگڑھی": "اور نہ تم اس کی عبادت کرنے والے ہو جس کی میں عبادت کر رہا ہوں",
     " محمد حسین نجفی ": "اور نہ تم (اللہ) کی عبادت کرنے والے ہو جس کی میں عبادت کرتا ہوں۔",
     "مفتی تقی عثمانی": "اور نہ تم اس کی عبادت کرنے والے ہو جس کی میں عبادت کرتا ہوں "
     },
     {
      "Aya": "﴾٦‎﴿ لَكُمْ دِينُكُمْ وَلِيَ دِينِ ",
       "ابوالاعلی مودودی ": "تمہارے لیے تمہارا دین ہے اور میرے لیے میرا دین",
      "  احمد رضا خان ": "تمہیں تمہارا دین اور مجھے میرا دین",
      "احمد علی ": "تمہارے لیے تمہارا دین ہے اور میرے لیے میرا دین",
     "  جالندہری ": "تم اپنے دین پر میں اپنے دین پر",
      "  طاہر القادری": "(سو) تمہارا دین تمہارے لئے اور میرا دین میرے لئے ہے،",
     "   علامہ جوادی": "تمہارے لئے تمہارا دین ہے اور میرے لئے میرا دین ہے",
       " محمد جوناگڑھی": "تمہارے لئے تمہارا دین ہے اور میرے لئے میرا دین ہے",
     " محمد حسین نجفی ": "تمہارے لئے تمہارا دین ہے اور میرے لئے میرا دین۔",
     "مفتی تقی عثمانی": "تمہارے لیے تمہارا دین ہے اور میرے لیے میرا دین ۔ "
     }
    ]
    